<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libgnutls-dane.so.0'>
  <elf-needed>
    <dependency name='libgnutls.so.30'/>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.5'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libhogweed.so.6'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libunbound.so.8'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dane_cert_type_name' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_cert_usage_name' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_match_type_name' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_data' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_deinit' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='towlower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_ctx_add_ta_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_ctx_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_ctx_debugout' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_ctx_delete' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_ctx_hosts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_ctx_resolvconf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_ctx_set_option' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_resolve' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ub_resolve_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcrtomb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcslen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcwidth' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='gnutls_calloc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='gnutls_free' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='gnutls_malloc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='asnprintf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='basename-lgpl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isalnum.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswalnum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswalnum' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isalpha.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswalpha' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswalpha' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isblank.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswblank' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswblank' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32iscntrl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswcntrl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswcntrl' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isdigit.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswdigit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswdigit' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isgraph.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswgraph' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswgraph' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32islower.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswlower' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswlower' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isprint.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswprint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswprint' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32ispunct.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswpunct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswpunct' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isspace.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswspace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswspace' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isupper.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswupper' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswupper' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isxdigit.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswxdigit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswxdigit' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32tolower.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='wint_t' type-id='type-id-3' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-5'/>
    <function-decl name='towlower' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='towlower' hash='0389e499374a3f97'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32width.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='wchar_t' type-id='type-id-4' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-6'/>
    <function-decl name='wcwidth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcwidth' hash='d628501fd2223339'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dirname-lgpl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-10'>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='fcntl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fcntl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fcntl' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gl_array_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <class-decl name='gl_list_impl' is-struct='yes' visibility='default' size-in-bits='512' hash='8aff8fe17e529334' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='elements' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='allocated' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_impl_base' is-struct='yes' visibility='default' size-in-bits='320' hash='87fead70842d9c11' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='equals_fn' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hashcode_fn' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dispose_fn' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='allow_duplicates' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_implementation' is-struct='yes' visibility='default' size-in-bits='2048' hash='9cc09438439034c9' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nx_create_empty' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nx_create' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='node_value' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='node_nx_set_value' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_node' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='previous_node' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='first_node' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='last_node' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_at' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nx_set_at' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='search_from_to' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='indexof_from_to' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nx_add_first' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nx_add_last' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nx_add_before' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nx_add_after' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nx_add_at' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='remove_node' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='remove_at' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='remove_elt' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='list_free' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='iterator' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='iterator_from_to' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='iterator_next' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='iterator_free' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='sortedlist_search' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='sortedlist_search_from_to' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='sortedlist_indexof' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='sortedlist_indexof_from_to' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='sortedlist_nx_add' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='sortedlist_remove' type-id='type-id-46' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_iterator_t' is-struct='yes' naming-typedef-id='type-id-47' visibility='default' size-in-bits='448' hash='d76cab97557a2e2c' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='q' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='i' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='j' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gl_list_implementation_t' type-id='type-id-15' size-in-bits='64' hash='110336bb35e7e25e' id='type-id-50'/>
    <typedef-decl name='gl_list_iterator_t' type-id='type-id-48' size-in-bits='448' id='type-id-47'/>
    <typedef-decl name='gl_list_t' type-id='type-id-51' size-in-bits='64' hash='e1171300825cff8a' id='type-id-49'/>
    <typedef-decl name='gl_listelement_compar_fn' type-id='type-id-52' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-53'/>
    <typedef-decl name='gl_listelement_dispose_fn' type-id='type-id-54' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-18'/>
    <typedef-decl name='gl_listelement_equals_fn' type-id='type-id-55' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-16'/>
    <typedef-decl name='gl_listelement_hashcode_fn' type-id='type-id-56' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-17'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-40'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-34'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-46'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-35'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-36'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-55'/>
    <qualified-type-def type-id='type-id-20' const='yes' hash='643d1ce1907c72b1' id='type-id-63'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' hash='110336bb35e7e25e' id='type-id-15'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' hash='e1171300825cff8a' id='type-id-51'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-38'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-39'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' hash='4f59ecfad21d653a' id='type-id-66'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-27'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-26'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-33'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-43'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-42'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-30'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-29'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-32'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-21'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-22'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-25'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-52'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-23'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-45'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-44'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-31'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-56'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-41'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-37'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-24'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-28'/>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <class-decl name='gl_list_node_impl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-88'/>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='gl_list_node_t' type-id='type-id-89' size-in-bits='64' id='type-id-90'/>
    <function-decl name='realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='abort' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='e68c127d5f09a14a' id='type-id-57'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='971edc0dd0c0b69b' id='type-id-58'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='f9cf54a3ad5219b7' id='type-id-59'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='3242e8e532f2c22c' id='type-id-60'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='971edc0dd0c0b69b' id='type-id-61'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='c7c710e908194b91' id='type-id-62'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='7120e0d884257f1a' id='type-id-64'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-47'/>
    </function-type>
    <function-type size-in-bits='64' hash='9438c9ae69db38d8' id='type-id-65'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-47'/>
    </function-type>
    <function-type size-in-bits='64' hash='7120e0d884257f1a' id='type-id-67'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='7120e0d884257f1a' id='type-id-68'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='7120e0d884257f1a' id='type-id-69'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='15ba5317abf90a75' id='type-id-70'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='ff6c50063ad64c54' id='type-id-71'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='9438c9ae69db38d8' id='type-id-72'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='f7057205879ade96' id='type-id-73'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='7120e0d884257f1a' id='type-id-74'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' hash='482580eb7f61e2ff' id='type-id-75'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-49'/>
    </function-type>
    <function-type size-in-bits='64' hash='34da15c4f2b63295' id='type-id-76'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-49'/>
    </function-type>
    <function-type size-in-bits='64' hash='dd97f2e7fe389fd6' id='type-id-77'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-78'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='bee6c600db68f560' id='type-id-79'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='89fc29820d9f5984' id='type-id-80'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='ed052148b1bbfadb' id='type-id-81'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='b13d0188417d62e2' id='type-id-82'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-83'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='67bacb665697d118' id='type-id-84'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='7120e0d884257f1a' id='type-id-85'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='7120e0d884257f1a' id='type-id-86'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='f7057205879ade96' id='type-id-87'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-92'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='gl_linkedhash_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc' hash='91495cdf6321a116'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gl_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <class-decl name='gl_list_node_impl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-93'/>
    <typedef-decl name='gl_list_node_t' type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
  </abi-instr>
  <abi-instr address-size='64' path='gl_rbtree_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='glthread/lock.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='320' hash='e7f9696e246a3049' id='type-id-97'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-98'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='32' hash='932523ac2c3bfb84' id='type-id-99'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-100'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='448' hash='b9acc09cd17d593e' id='type-id-101'>
      <subrange length='56' lower-bound='0' upper-bound='55' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='1911f4cdae5d7aa5' id='type-id-102'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' hash='5bcfb7f1ab39fa47' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-104' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' hash='765d7e157ef2ec37' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-107' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_rwlock_arch_t' is-struct='yes' visibility='default' size-in-bits='448' hash='b18ffe431d8c608c' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__readers' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__writers' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__wrphase_futex' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__writers_futex' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__pad3' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__pad4' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__cur_writer' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='__shared' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__rwelision' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='__pad1' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__pad2' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='__flags' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-103' size-in-bits='128' id='type-id-107'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-111' size-in-bits='320' id='type-id-112'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-113' size-in-bits='32' id='type-id-114'/>
    <typedef-decl name='pthread_rwlock_t' type-id='type-id-115' size-in-bits='448' id='type-id-116'/>
    <typedef-decl name='pthread_rwlockattr_t' type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <union-decl name='pthread_mutex_t' naming-typedef-id='type-id-112' visibility='default' size-in-bits='320' hash='8e3e5ddbcaed875f' id='type-id-111'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-119' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutexattr_t' naming-typedef-id='type-id-114' visibility='default' size-in-bits='32' hash='9efcb016ff95e817' id='type-id-113'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-4' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_rwlock_t' naming-typedef-id='type-id-116' visibility='default' size-in-bits='448' hash='f7c61974aee33c67' id='type-id-115'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-119' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_rwlockattr_t' naming-typedef-id='type-id-118' visibility='default' size-in-bits='64' hash='18249e50f761d107' id='type-id-117'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-120' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-119' visibility='default'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-121' size-in-bits='56' hash='f53d0e61e68df14e' id='type-id-110'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='type-id-122'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' hash='b83eb2deac70d470' id='type-id-104'/>
    <qualified-type-def type-id='type-id-114' const='yes' hash='c2459df9f244e03e' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' hash='27684f07d936e645' id='type-id-124'/>
    <qualified-type-def type-id='type-id-118' const='yes' hash='1e74626014079ce8' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' hash='5424a0f7dcf0ba3f' id='type-id-126'/>
    <qualified-type-def type-id='type-id-126' restrict='yes' hash='9c58f3d608f57ade' id='type-id-127'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' hash='8f341987365c3f23' id='type-id-128'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' hash='936e3ba559212412' id='type-id-129'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' hash='31f26b95bb2f546c' id='type-id-130'/>
    <qualified-type-def type-id='type-id-130' restrict='yes' hash='2b23232a329750be' id='type-id-131'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' hash='718ed2a23424c188' id='type-id-132'/>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_init' hash='f616842fe991fad1'>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_init' hash='a3a0b292219abea7'>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_destroy' hash='a3a0b292219abea7'>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_settype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_settype' hash='b4332199ac7eb1fc'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlock_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlock_init' hash='4bcf5136088d0ab8'>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_init' hash='8fcb2361c566050c'>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_destroy' hash='8fcb2361c566050c'>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_setkind_np' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_setkind_np' hash='1c6722e4cb2fbef0'>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='glthread/once.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='pthread_once_t' type-id='type-id-4' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='a9d5a79abcefcfe6' id='type-id-134'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-135'/>
    <function-decl name='pthread_once' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_once' hash='022106852535817c'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hard-locale.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='strcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='localcharset.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='nl_item' type-id='type-id-4' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-136'/>
    <function-decl name='nl_langinfo' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nl_langinfo' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-136'/>
      <return type-id='type-id-137'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow_preserve.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_set_array_size.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloca.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='mbchar.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='mbiterf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <class-decl name='__mbstate_t' is-struct='yes' naming-typedef-id='type-id-138' visibility='default' size-in-bits='64' hash='e97fe294ce223fec' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-139' size-in-bits='64' id='type-id-138'/>
    <typedef-decl name='__uint_least32_t' type-id='type-id-141' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-142'/>
    <typedef-decl name='char32_t' type-id='type-id-142' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-143'/>
    <typedef-decl name='mbstate_t' type-id='type-id-138' size-in-bits='64' id='type-id-144'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' hash='6e3d8c55e57b583a#5' id='type-id-140'>
      <data-member access='public'>
        <var-decl name='__wch' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__wchb' type-id='type-id-99' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' hash='fc96de23e5520f6c' id='type-id-145'/>
    <qualified-type-def type-id='type-id-144' const='yes' hash='a328f2686e4dcc6e' id='type-id-146'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' hash='965b139f91617649' id='type-id-147'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='18fb85b101e2cd25' id='type-id-148'/>
    <function-decl name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='__assert_fail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__assert_fail' hash='f20e7a25b596c040'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='mbsinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mbsinit' hash='aefbffd326e575e4'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbrtoc32.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <qualified-type-def type-id='type-id-145' restrict='yes' hash='fd941aad4ee15c1e' id='type-id-149'/>
    <qualified-type-def type-id='type-id-1' restrict='yes' hash='b7d5472019e79b5f' id='type-id-150'/>
    <qualified-type-def type-id='type-id-148' restrict='yes' hash='42a15c82a35f0371' id='type-id-151'/>
    <function-decl name='mbrtoc32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mbrtoc32' hash='485b3b6f3fd8f469'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbrtowc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='4c855c998d0c713a' id='type-id-152'/>
    <qualified-type-def type-id='type-id-152' restrict='yes' hash='0a4c1e4c3cbe993c' id='type-id-153'/>
    <function-decl name='mbrtowc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mbrtowc' hash='802359caacf592bb'>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbsnlen.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__ctype_get_mb_cur_max' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_get_mb_cur_max' hash='e0055d99adb0e173'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbszero.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='memeq.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='memset_explicit.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='printf-args.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='printf-parse.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='read-file.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='192' hash='9904ddbe9e0e1da6' id='type-id-155'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-156'/>
    </array-type-def>
    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' hash='4f24305487cf2e09' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-160' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-161' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-163' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-165' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-155' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__blkcnt_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-166'/>
    <typedef-decl name='__blksize_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-165'/>
    <typedef-decl name='__dev_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-158'/>
    <typedef-decl name='__gid_t' type-id='type-id-3' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-163'/>
    <typedef-decl name='__ino_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-159'/>
    <typedef-decl name='__mode_t' type-id='type-id-3' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-161'/>
    <typedef-decl name='__nlink_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-160'/>
    <typedef-decl name='__uid_t' type-id='type-id-3' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-162'/>
    <qualified-type-def type-id='type-id-168' restrict='yes' hash='6a2cf982d0fba87f' id='type-id-169'/>
    <qualified-type-def type-id='type-id-137' restrict='yes' hash='566dfacc48804f50' id='type-id-170'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' hash='925ad1338878bb49' id='type-id-171'/>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-172'/>
    <function-decl name='fopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen' hash='ce3a19dab827954e'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setvbuf' hash='d6d5b7fa8675939e'>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-170'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread' hash='b41d7fe688a81bb5'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='ftello' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftello' hash='eb0e1ae48e8b4470'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-164'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ferror' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat' hash='5227d00433989f9c'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='realloc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='setlocale_null-unlocked.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='setlocale' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setlocale' hash='63f13efed1e26e48'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-137'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='setlocale_null.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='streq.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='stripslash.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='strnul.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='uniwidth/width.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='vasnprintf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-173' size-in-bits='1792' hash='c5bf4b10be185261' id='type-id-174'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='type-id-122'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-175' size-in-bits='4928' hash='b993512e5f5336ac' id='type-id-176'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='type-id-122'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-177'/>
    <enum-decl name='arg_type' naming-typedef-id='type-id-178' size-in-bits='32' alignment-in-bits='32' hash='30907e2cb385ab3c' id='type-id-179'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='TYPE_NONE' value='0'/>
      <enumerator name='TYPE_SCHAR' value='1'/>
      <enumerator name='TYPE_UCHAR' value='2'/>
      <enumerator name='TYPE_SHORT' value='3'/>
      <enumerator name='TYPE_USHORT' value='4'/>
      <enumerator name='TYPE_INT' value='5'/>
      <enumerator name='TYPE_UINT' value='6'/>
      <enumerator name='TYPE_LONGINT' value='7'/>
      <enumerator name='TYPE_ULONGINT' value='8'/>
      <enumerator name='TYPE_LONGLONGINT' value='9'/>
      <enumerator name='TYPE_ULONGLONGINT' value='10'/>
      <enumerator name='TYPE_INT8_T' value='11'/>
      <enumerator name='TYPE_UINT8_T' value='12'/>
      <enumerator name='TYPE_INT16_T' value='13'/>
      <enumerator name='TYPE_UINT16_T' value='14'/>
      <enumerator name='TYPE_INT32_T' value='15'/>
      <enumerator name='TYPE_UINT32_T' value='16'/>
      <enumerator name='TYPE_INT64_T' value='17'/>
      <enumerator name='TYPE_UINT64_T' value='18'/>
      <enumerator name='TYPE_INT_FAST8_T' value='19'/>
      <enumerator name='TYPE_UINT_FAST8_T' value='20'/>
      <enumerator name='TYPE_INT_FAST16_T' value='21'/>
      <enumerator name='TYPE_UINT_FAST16_T' value='22'/>
      <enumerator name='TYPE_INT_FAST32_T' value='23'/>
      <enumerator name='TYPE_UINT_FAST32_T' value='24'/>
      <enumerator name='TYPE_INT_FAST64_T' value='25'/>
      <enumerator name='TYPE_UINT_FAST64_T' value='26'/>
      <enumerator name='TYPE_DOUBLE' value='27'/>
      <enumerator name='TYPE_LONGDOUBLE' value='28'/>
      <enumerator name='TYPE_CHAR' value='29'/>
      <enumerator name='TYPE_WIDE_CHAR' value='30'/>
      <enumerator name='TYPE_STRING' value='31'/>
      <enumerator name='TYPE_WIDE_STRING' value='32'/>
      <enumerator name='TYPE_POINTER' value='33'/>
      <enumerator name='TYPE_COUNT_SCHAR_POINTER' value='34'/>
      <enumerator name='TYPE_COUNT_SHORT_POINTER' value='35'/>
      <enumerator name='TYPE_COUNT_INT_POINTER' value='36'/>
      <enumerator name='TYPE_COUNT_LONGINT_POINTER' value='37'/>
      <enumerator name='TYPE_COUNT_LONGLONGINT_POINTER' value='38'/>
      <enumerator name='TYPE_COUNT_INT8_T_POINTER' value='39'/>
      <enumerator name='TYPE_COUNT_INT16_T_POINTER' value='40'/>
      <enumerator name='TYPE_COUNT_INT32_T_POINTER' value='41'/>
      <enumerator name='TYPE_COUNT_INT64_T_POINTER' value='42'/>
      <enumerator name='TYPE_COUNT_INT_FAST8_T_POINTER' value='43'/>
      <enumerator name='TYPE_COUNT_INT_FAST16_T_POINTER' value='44'/>
      <enumerator name='TYPE_COUNT_INT_FAST32_T_POINTER' value='45'/>
      <enumerator name='TYPE_COUNT_INT_FAST64_T_POINTER' value='46'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-181'/>
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-182'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-183'/>
    <class-decl name='argument' is-struct='yes' naming-typedef-id='type-id-173' visibility='default' size-in-bits='256' hash='ac606fb3b977dc34' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-185' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='arguments' is-struct='yes' naming-typedef-id='type-id-186' visibility='default' size-in-bits='1920' hash='095971d7baa9e5a2' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='direct_alloc_arg' type-id='type-id-174' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directive' is-struct='yes' naming-typedef-id='type-id-175' visibility='default' size-in-bits='704' hash='8a4832b9ca8847e2' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='width_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='width_arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='precision_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='precision_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='precision_arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conversion' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directives' is-struct='yes' naming-typedef-id='type-id-190' visibility='default' size-in-bits='5184' hash='eda54347339c46a6' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_width_length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_precision_length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='direct_alloc_dir' type-id='type-id-176' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-4' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-193'/>
    <typedef-decl name='__int64_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-194'/>
    <typedef-decl name='__int8_t' type-id='type-id-109' size-in-bits='8' hash='3c595c3350588f18' id='type-id-195'/>
    <typedef-decl name='arg_type' type-id='type-id-179' size-in-bits='32' alignment-in-bits='32' hash='30907e2cb385ab3c' id='type-id-178'/>
    <typedef-decl name='argument' type-id='type-id-184' size-in-bits='256' id='type-id-173'/>
    <typedef-decl name='arguments' type-id='type-id-187' size-in-bits='1920' id='type-id-186'/>
    <typedef-decl name='char_directive' type-id='type-id-189' size-in-bits='704' id='type-id-175'/>
    <typedef-decl name='char_directives' type-id='type-id-191' size-in-bits='5184' id='type-id-190'/>
    <typedef-decl name='int32_t' type-id='type-id-193' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-196'/>
    <typedef-decl name='int64_t' type-id='type-id-194' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-197'/>
    <typedef-decl name='int8_t' type-id='type-id-195' size-in-bits='8' hash='3c595c3350588f18' id='type-id-198'/>
    <typedef-decl name='int_fast16_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-199'/>
    <typedef-decl name='int_fast32_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-200'/>
    <typedef-decl name='int_fast64_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-201'/>
    <typedef-decl name='int_fast8_t' type-id='type-id-109' size-in-bits='8' hash='3c595c3350588f18' id='type-id-202'/>
    <typedef-decl name='uint_fast16_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-203'/>
    <typedef-decl name='uint_fast32_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-204'/>
    <typedef-decl name='uint_fast64_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-205'/>
    <typedef-decl name='uint_fast8_t' type-id='type-id-121' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-206'/>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='128' is-anonymous='yes' hash='54ba289bd7480d14#3' id='type-id-185'>
      <data-member access='public'>
        <var-decl name='a_schar' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uchar' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_short' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ushort' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longint' type-id='type-id-119' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulongint' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longlongint' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulonglongint' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int8_t' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint8_t' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int16_t' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint16_t' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int32_t' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint32_t' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int64_t' type-id='type-id-197' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint64_t' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast8_t' type-id='type-id-202' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast8_t' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast16_t' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast16_t' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast32_t' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast32_t' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast64_t' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast64_t' type-id='type-id-205' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_float' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_double' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longdouble' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_char' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_char' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_string' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_string' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_pointer' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_schar_pointer' type-id='type-id-215' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_short_pointer' type-id='type-id-216' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_pointer' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longint_pointer' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longlongint_pointer' type-id='type-id-218' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int8_t_pointer' type-id='type-id-219' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int16_t_pointer' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int32_t_pointer' type-id='type-id-221' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int64_t_pointer' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast8_t_pointer' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast16_t_pointer' type-id='type-id-224' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast32_t_pointer' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast64_t_pointer' type-id='type-id-226' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-208'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' hash='a5ee0afd5ff6d40b' id='type-id-188'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' hash='1a72c30a4a116ed3' id='type-id-227'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' hash='86710da2ca66920d' id='type-id-192'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='267f2642a7e40b33' id='type-id-228'/>
    <qualified-type-def type-id='type-id-6' const='yes' hash='ec486fb00a2b9a49' id='type-id-229'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='7ae0d48e9d921c08' id='type-id-214'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' hash='e1c556b63d77e5a5' id='type-id-220'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' hash='eed3dd419640fb3b' id='type-id-221'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' hash='e24def43c7e4b3b5' id='type-id-222'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' hash='a214be57f5aa79fe' id='type-id-219'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' hash='b9094866e36835fe' id='type-id-224'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='d5867fa403ca227d' id='type-id-225'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='cc35e81c901ca583' id='type-id-226'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' hash='c142d9c660922ab7' id='type-id-223'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' hash='9525b6affe75cc9d#2' id='type-id-217'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' hash='77d6ad71d7d08df8#3' id='type-id-218'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' hash='ccc99a75f65fca1e#4' id='type-id-216'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' hash='759f00c63d08adc8' id='type-id-215'/>
    <function-decl name='snprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf' hash='9e970561a213ee08'>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strnlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen' hash='e62a7a46b2904b02'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='wcslen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcslen' hash='3df1bfc94027e171'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='wcrtomb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcrtomb' hash='5537d0fc51348515'>
      <parameter type-id='type-id-170'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vsnzprintf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-231'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-232'/>
  </abi-instr>
  <abi-instr address-size='64' path='xsize.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='dane-params.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/libdane' language='LANG_C11'>
    <function-decl name='dane_cert_type_name' mangled-name='dane_cert_type_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dane_cert_type_name@@DANE_0_0' hash='e5120cd00fe85bb3'>
      <parameter type-id='type-id-233' name='type'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dane_match_type_name' mangled-name='dane_match_type_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dane_match_type_name@@DANE_0_0' hash='a680d6a44c7a900f'>
      <parameter type-id='type-id-234' name='type'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dane_cert_usage_name' mangled-name='dane_cert_usage_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dane_cert_usage_name@@DANE_0_0' hash='5033d5c1e9725eee'>
      <parameter type-id='type-id-235' name='usage'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dane.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/libdane' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-236' hash='f193e1859cc21deb' id='type-id-237'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-238'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-239' size-in-bits='512' hash='f7c937524e441072' id='type-id-240'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-241'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-19'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-96'/>
    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='944' hash='e78758ef10066232' id='type-id-242'>
      <subrange length='118' lower-bound='0' upper-bound='117' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6f97e773a1e88e39' id='type-id-243'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-244'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-245'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-96' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-120'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-246'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-247' size-in-bits='16384' hash='f5527a47a47193e1' id='type-id-248'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-249'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-250' size-in-bits='8192' hash='53459f448cd20882' id='type-id-251'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-252'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-253' size-in-bits='8192' hash='9a207680cddf7259' id='type-id-254'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-252'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-255' size-in-bits='16' hash='80d479b5dd0a4be7' id='type-id-256'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-241'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-233' size-in-bits='3200' alignment-in-bits='32' hash='872190bfd3321d3c' id='type-id-257'>
      <subrange length='100' lower-bound='0' upper-bound='99' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='5dfc2c3b81f9ce6a' id='type-id-258'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-235' size-in-bits='3200' alignment-in-bits='32' hash='c54bec19d73ed484' id='type-id-259'>
      <subrange length='100' lower-bound='0' upper-bound='99' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='5dfc2c3b81f9ce6a' id='type-id-258'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-234' size-in-bits='3200' alignment-in-bits='32' hash='7ea494bc0a60ffad' id='type-id-260'>
      <subrange length='100' lower-bound='0' upper-bound='99' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='5dfc2c3b81f9ce6a' id='type-id-258'/>
    </array-type-def>
    <enum-decl name='bye_state_t' size-in-bits='32' alignment-in-bits='32' hash='b589e94b100498f0' id='type-id-261'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='BYE_STATE0' value='0'/>
      <enumerator name='BYE_STATE1' value='1'/>
      <enumerator name='BYE_STATE2' value='2'/>
    </enum-decl>
    <enum-decl name='cipher_type_t' naming-typedef-id='type-id-262' size-in-bits='32' alignment-in-bits='32' hash='b9bbb6a16754b671' id='type-id-263'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='CIPHER_STREAM' value='0'/>
      <enumerator name='CIPHER_BLOCK' value='1'/>
      <enumerator name='CIPHER_AEAD' value='2'/>
    </enum-decl>
    <enum-decl name='content_type_t' size-in-bits='32' alignment-in-bits='32' hash='ab63d1d2c704c2b5' id='type-id-264'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_CHANGE_CIPHER_SPEC' value='20'/>
      <enumerator name='GNUTLS_ALERT' value='21'/>
      <enumerator name='GNUTLS_HANDSHAKE' value='22'/>
      <enumerator name='GNUTLS_APPLICATION_DATA' value='23'/>
      <enumerator name='GNUTLS_HEARTBEAT' value='24'/>
    </enum-decl>
    <enum-decl name='dane_cert_type_t' size-in-bits='32' alignment-in-bits='32' hash='f167816e91b59417' id='type-id-265'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='DANE_CERT_X509' value='0'/>
      <enumerator name='DANE_CERT_PK' value='1'/>
    </enum-decl>
    <enum-decl name='dane_cert_usage_t' size-in-bits='32' alignment-in-bits='32' hash='2a16d2e6f77d38f3' id='type-id-266'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='DANE_CERT_USAGE_CA' value='0'/>
      <enumerator name='DANE_CERT_USAGE_EE' value='1'/>
      <enumerator name='DANE_CERT_USAGE_LOCAL_CA' value='2'/>
      <enumerator name='DANE_CERT_USAGE_LOCAL_EE' value='3'/>
    </enum-decl>
    <enum-decl name='dane_match_type_t' size-in-bits='32' alignment-in-bits='32' hash='2e2e948ff01449bd' id='type-id-267'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='DANE_MATCH_EXACT' value='0'/>
      <enumerator name='DANE_MATCH_SHA2_256' value='1'/>
      <enumerator name='DANE_MATCH_SHA2_512' value='2'/>
    </enum-decl>
    <enum-decl name='dane_query_status_t' size-in-bits='32' alignment-in-bits='32' hash='e0cea15a8fc84e6d' id='type-id-268'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='DANE_QUERY_UNKNOWN' value='0'/>
      <enumerator name='DANE_QUERY_DNSSEC_VERIFIED' value='1'/>
      <enumerator name='DANE_QUERY_BOGUS' value='2'/>
      <enumerator name='DANE_QUERY_NO_DNSSEC' value='3'/>
    </enum-decl>
    <enum-decl name='ext_master_secret_t' size-in-bits='32' alignment-in-bits='32' hash='fcaba45f958a6d35' id='type-id-269'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='EMS_REQUEST' value='0'/>
      <enumerator name='EMS_REQUIRE' value='1'/>
    </enum-decl>
    <enum-decl name='extensions_t' size-in-bits='32' alignment-in-bits='32' hash='031e95890c9c05d1' id='type-id-270'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_EXTENSION_INVALID' value='65535'/>
      <enumerator name='GNUTLS_EXTENSION_STATUS_REQUEST' value='0'/>
      <enumerator name='GNUTLS_EXTENSION_CERT_TYPE' value='1'/>
      <enumerator name='GNUTLS_EXTENSION_CLIENT_CERT_TYPE' value='2'/>
      <enumerator name='GNUTLS_EXTENSION_SERVER_CERT_TYPE' value='3'/>
      <enumerator name='GNUTLS_EXTENSION_SUPPORTED_GROUPS' value='4'/>
      <enumerator name='GNUTLS_EXTENSION_SUPPORTED_EC_POINT_FORMATS' value='5'/>
      <enumerator name='GNUTLS_EXTENSION_SRP' value='6'/>
      <enumerator name='GNUTLS_EXTENSION_SIGNATURE_ALGORITHMS' value='7'/>
      <enumerator name='GNUTLS_EXTENSION_SRTP' value='8'/>
      <enumerator name='GNUTLS_EXTENSION_HEARTBEAT' value='9'/>
      <enumerator name='GNUTLS_EXTENSION_ALPN' value='10'/>
      <enumerator name='GNUTLS_EXTENSION_ETM' value='11'/>
      <enumerator name='GNUTLS_EXTENSION_EXT_MASTER_SECRET' value='12'/>
      <enumerator name='GNUTLS_EXTENSION_SESSION_TICKET' value='13'/>
      <enumerator name='GNUTLS_EXTENSION_KEY_SHARE' value='14'/>
      <enumerator name='GNUTLS_EXTENSION_SUPPORTED_VERSIONS' value='15'/>
      <enumerator name='GNUTLS_EXTENSION_POST_HANDSHAKE' value='16'/>
      <enumerator name='GNUTLS_EXTENSION_SAFE_RENEGOTIATION' value='17'/>
      <enumerator name='GNUTLS_EXTENSION_SERVER_NAME' value='18'/>
      <enumerator name='GNUTLS_EXTENSION_COOKIE' value='19'/>
      <enumerator name='GNUTLS_EXTENSION_EARLY_DATA' value='20'/>
      <enumerator name='GNUTLS_EXTENSION_PSK_KE_MODES' value='21'/>
      <enumerator name='GNUTLS_EXTENSION_RECORD_SIZE_LIMIT' value='22'/>
      <enumerator name='GNUTLS_EXTENSION_MAX_RECORD_SIZE' value='23'/>
      <enumerator name='GNUTLS_EXTENSION_COMPRESS_CERTIFICATE' value='24'/>
      <enumerator name='GNUTLS_EXTENSION_DUMBFW' value='25'/>
      <enumerator name='GNUTLS_EXTENSION_PRE_SHARED_KEY' value='26'/>
      <enumerator name='GNUTLS_EXTENSION_MAX' value='27'/>
    </enum-decl>
    <enum-decl name='gnutls_alert_description_t' naming-typedef-id='type-id-271' size-in-bits='32' alignment-in-bits='32' hash='e194d6870a33c76f' id='type-id-272'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_A_CLOSE_NOTIFY' value='0'/>
      <enumerator name='GNUTLS_A_UNEXPECTED_MESSAGE' value='10'/>
      <enumerator name='GNUTLS_A_BAD_RECORD_MAC' value='20'/>
      <enumerator name='GNUTLS_A_DECRYPTION_FAILED' value='21'/>
      <enumerator name='GNUTLS_A_RECORD_OVERFLOW' value='22'/>
      <enumerator name='GNUTLS_A_DECOMPRESSION_FAILURE' value='30'/>
      <enumerator name='GNUTLS_A_HANDSHAKE_FAILURE' value='40'/>
      <enumerator name='GNUTLS_A_SSL3_NO_CERTIFICATE' value='41'/>
      <enumerator name='GNUTLS_A_BAD_CERTIFICATE' value='42'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_CERTIFICATE' value='43'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REVOKED' value='44'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_EXPIRED' value='45'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNKNOWN' value='46'/>
      <enumerator name='GNUTLS_A_ILLEGAL_PARAMETER' value='47'/>
      <enumerator name='GNUTLS_A_UNKNOWN_CA' value='48'/>
      <enumerator name='GNUTLS_A_ACCESS_DENIED' value='49'/>
      <enumerator name='GNUTLS_A_DECODE_ERROR' value='50'/>
      <enumerator name='GNUTLS_A_DECRYPT_ERROR' value='51'/>
      <enumerator name='GNUTLS_A_EXPORT_RESTRICTION' value='60'/>
      <enumerator name='GNUTLS_A_PROTOCOL_VERSION' value='70'/>
      <enumerator name='GNUTLS_A_INSUFFICIENT_SECURITY' value='71'/>
      <enumerator name='GNUTLS_A_INTERNAL_ERROR' value='80'/>
      <enumerator name='GNUTLS_A_INAPPROPRIATE_FALLBACK' value='86'/>
      <enumerator name='GNUTLS_A_USER_CANCELED' value='90'/>
      <enumerator name='GNUTLS_A_NO_RENEGOTIATION' value='100'/>
      <enumerator name='GNUTLS_A_MISSING_EXTENSION' value='109'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_EXTENSION' value='110'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNOBTAINABLE' value='111'/>
      <enumerator name='GNUTLS_A_UNRECOGNIZED_NAME' value='112'/>
      <enumerator name='GNUTLS_A_UNKNOWN_PSK_IDENTITY' value='115'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REQUIRED' value='116'/>
      <enumerator name='GNUTLS_A_NO_APPLICATION_PROTOCOL' value='120'/>
      <enumerator name='GNUTLS_A_MAX' value='120'/>
    </enum-decl>
    <enum-decl name='gnutls_alert_level_t' naming-typedef-id='type-id-273' size-in-bits='32' alignment-in-bits='32' hash='b546ad11d37e0a85' id='type-id-274'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_AL_WARNING' value='1'/>
      <enumerator name='GNUTLS_AL_FATAL' value='2'/>
    </enum-decl>
    <enum-decl name='gnutls_certificate_request_t' naming-typedef-id='type-id-275' size-in-bits='32' alignment-in-bits='32' hash='4b3e7ca8c9b97e72' id='type-id-276'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_CERT_IGNORE' value='0'/>
      <enumerator name='GNUTLS_CERT_REQUEST' value='1'/>
      <enumerator name='GNUTLS_CERT_REQUIRE' value='2'/>
    </enum-decl>
    <enum-decl name='gnutls_certificate_type_t' naming-typedef-id='type-id-277' size-in-bits='32' alignment-in-bits='32' hash='0b0e0e9affa9ae45' id='type-id-278'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_CRT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CRT_X509' value='1'/>
      <enumerator name='GNUTLS_CRT_OPENPGP' value='2'/>
      <enumerator name='GNUTLS_CRT_RAWPK' value='3'/>
      <enumerator name='GNUTLS_CRT_MAX' value='3'/>
    </enum-decl>
    <enum-decl name='gnutls_cipher_algorithm' size-in-bits='32' alignment-in-bits='32' hash='235da410b0b1d84f' id='type-id-279'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_CIPHER_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CIPHER_NULL' value='1'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_128' value='2'/>
      <enumerator name='GNUTLS_CIPHER_3DES_CBC' value='3'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CBC' value='4'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CBC' value='5'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_40' value='6'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_CBC' value='7'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_CBC' value='8'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CBC' value='9'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_GCM' value='10'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_GCM' value='11'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_192_CBC' value='12'/>
      <enumerator name='GNUTLS_CIPHER_SALSA20_256' value='13'/>
      <enumerator name='GNUTLS_CIPHER_ESTREAM_SALSA20_256' value='14'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_GCM' value='15'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_GCM' value='16'/>
      <enumerator name='GNUTLS_CIPHER_RC2_40_CBC' value='17'/>
      <enumerator name='GNUTLS_CIPHER_DES_CBC' value='18'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM' value='19'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM' value='20'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM_8' value='21'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM_8' value='22'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_POLY1305' value='23'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CFB' value='24'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPA_CFB' value='25'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPB_CFB' value='26'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPC_CFB' value='27'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPD_CFB' value='28'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CFB8' value='29'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CFB8' value='30'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CFB8' value='31'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_XTS' value='32'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_XTS' value='33'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CNT' value='34'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_64' value='35'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_32' value='36'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_SIV' value='37'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_SIV' value='38'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_GCM' value='39'/>
      <enumerator name='GNUTLS_CIPHER_MAGMA_CTR_ACPKM' value='40'/>
      <enumerator name='GNUTLS_CIPHER_KUZNYECHIK_CTR_ACPKM' value='41'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_SIV_GCM' value='42'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_SIV_GCM' value='43'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CFB' value='44'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CFB' value='45'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CFB' value='46'/>
      <enumerator name='GNUTLS_CIPHER_IDEA_PGP_CFB' value='200'/>
      <enumerator name='GNUTLS_CIPHER_3DES_PGP_CFB' value='201'/>
      <enumerator name='GNUTLS_CIPHER_CAST5_PGP_CFB' value='202'/>
      <enumerator name='GNUTLS_CIPHER_BLOWFISH_PGP_CFB' value='203'/>
      <enumerator name='GNUTLS_CIPHER_SAFER_SK128_PGP_CFB' value='204'/>
      <enumerator name='GNUTLS_CIPHER_AES128_PGP_CFB' value='205'/>
      <enumerator name='GNUTLS_CIPHER_AES192_PGP_CFB' value='206'/>
      <enumerator name='GNUTLS_CIPHER_AES256_PGP_CFB' value='207'/>
      <enumerator name='GNUTLS_CIPHER_TWOFISH_PGP_CFB' value='208'/>
    </enum-decl>
    <enum-decl name='gnutls_compression_method_t' naming-typedef-id='type-id-280' size-in-bits='32' alignment-in-bits='32' hash='ba81a0fa2ccfe4db' id='type-id-281'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_COMP_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_COMP_NULL' value='1'/>
      <enumerator name='GNUTLS_COMP_DEFLATE' value='2'/>
      <enumerator name='GNUTLS_COMP_ZLIB' value='2'/>
      <enumerator name='GNUTLS_COMP_BROTLI' value='3'/>
      <enumerator name='GNUTLS_COMP_ZSTD' value='4'/>
    </enum-decl>
    <enum-decl name='gnutls_credentials_type_t' naming-typedef-id='type-id-282' size-in-bits='32' alignment-in-bits='32' hash='7be2a490e9a7a839' id='type-id-283'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_CRD_CERTIFICATE' value='1'/>
      <enumerator name='GNUTLS_CRD_ANON' value='2'/>
      <enumerator name='GNUTLS_CRD_SRP' value='3'/>
      <enumerator name='GNUTLS_CRD_PSK' value='4'/>
      <enumerator name='GNUTLS_CRD_IA' value='5'/>
    </enum-decl>
    <enum-decl name='gnutls_digest_algorithm_t' naming-typedef-id='type-id-284' size-in-bits='32' alignment-in-bits='32' hash='d3dd239150955bb0' id='type-id-285'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_DIG_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DIG_NULL' value='1'/>
      <enumerator name='GNUTLS_DIG_MD5' value='2'/>
      <enumerator name='GNUTLS_DIG_SHA1' value='3'/>
      <enumerator name='GNUTLS_DIG_RMD160' value='4'/>
      <enumerator name='GNUTLS_DIG_MD2' value='5'/>
      <enumerator name='GNUTLS_DIG_SHA256' value='6'/>
      <enumerator name='GNUTLS_DIG_SHA384' value='7'/>
      <enumerator name='GNUTLS_DIG_SHA512' value='8'/>
      <enumerator name='GNUTLS_DIG_SHA224' value='9'/>
      <enumerator name='GNUTLS_DIG_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_DIG_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_DIG_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_DIG_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_DIG_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_DIG_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_512' value='17'/>
      <enumerator name='GNUTLS_DIG_SHAKE_128' value='209'/>
      <enumerator name='GNUTLS_DIG_SHAKE_256' value='210'/>
    </enum-decl>
    <enum-decl name='gnutls_ecc_curve_t' naming-typedef-id='type-id-286' size-in-bits='32' alignment-in-bits='32' hash='2ef4a0a674bed49f' id='type-id-287'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_ECC_CURVE_INVALID' value='0'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_ECC_CURVE_X25519' value='6'/>
      <enumerator name='GNUTLS_ECC_CURVE_ED25519' value='7'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPA' value='8'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPB' value='9'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPC' value='10'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXA' value='11'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXB' value='12'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512A' value='13'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512B' value='14'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512C' value='15'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256A' value='16'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256B' value='17'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256C' value='18'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256D' value='19'/>
      <enumerator name='GNUTLS_ECC_CURVE_X448' value='20'/>
      <enumerator name='GNUTLS_ECC_CURVE_ED448' value='21'/>
      <enumerator name='GNUTLS_ECC_CURVE_MAX' value='21'/>
    </enum-decl>
    <enum-decl name='gnutls_ext_flags_t' naming-typedef-id='type-id-288' size-in-bits='32' alignment-in-bits='32' hash='2ab270b02907c165' id='type-id-289'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_EXT_FLAG_OVERRIDE_INTERNAL' value='1'/>
      <enumerator name='GNUTLS_EXT_FLAG_CLIENT_HELLO' value='2'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS12_SERVER_HELLO' value='4'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS13_SERVER_HELLO' value='8'/>
      <enumerator name='GNUTLS_EXT_FLAG_EE' value='16'/>
      <enumerator name='GNUTLS_EXT_FLAG_HRR' value='32'/>
      <enumerator name='GNUTLS_EXT_FLAG_IGNORE_CLIENT_REQUEST' value='64'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS' value='128'/>
      <enumerator name='GNUTLS_EXT_FLAG_DTLS' value='256'/>
    </enum-decl>
    <enum-decl name='gnutls_gost_paramset_t' naming-typedef-id='type-id-290' size-in-bits='32' alignment-in-bits='32' hash='e2894c0d8a2d6625' id='type-id-291'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_TC26_Z' value='1'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_A' value='2'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_B' value='3'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_C' value='4'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_D' value='5'/>
    </enum-decl>
    <enum-decl name='gnutls_group_t' naming-typedef-id='type-id-292' size-in-bits='32' alignment-in-bits='32' hash='8338e4b21ac038a0' id='type-id-293'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_GROUP_INVALID' value='0'/>
      <enumerator name='GNUTLS_GROUP_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_GROUP_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_GROUP_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_GROUP_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_GROUP_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_GROUP_X25519' value='6'/>
      <enumerator name='GNUTLS_GROUP_X448' value='20'/>
      <enumerator name='GNUTLS_GROUP_GC256A' value='16'/>
      <enumerator name='GNUTLS_GROUP_GC256B' value='17'/>
      <enumerator name='GNUTLS_GROUP_GC256C' value='18'/>
      <enumerator name='GNUTLS_GROUP_GC256D' value='19'/>
      <enumerator name='GNUTLS_GROUP_GC512A' value='13'/>
      <enumerator name='GNUTLS_GROUP_GC512B' value='14'/>
      <enumerator name='GNUTLS_GROUP_GC512C' value='15'/>
      <enumerator name='GNUTLS_GROUP_FFDHE2048' value='256'/>
      <enumerator name='GNUTLS_GROUP_FFDHE3072' value='257'/>
      <enumerator name='GNUTLS_GROUP_FFDHE4096' value='258'/>
      <enumerator name='GNUTLS_GROUP_FFDHE8192' value='259'/>
      <enumerator name='GNUTLS_GROUP_FFDHE6144' value='260'/>
      <enumerator name='GNUTLS_GROUP_MAX' value='260'/>
      <enumerator name='GNUTLS_GROUP_EXP_X25519_KYBER768' value='512'/>
      <enumerator name='GNUTLS_GROUP_EXP_SECP256R1_MLKEM768' value='513'/>
      <enumerator name='GNUTLS_GROUP_EXP_SECP384R1_MLKEM1024' value='518'/>
      <enumerator name='GNUTLS_GROUP_EXP_X25519_MLKEM768' value='514'/>
      <enumerator name='GNUTLS_GROUP_EXP_KYBER768' value='515'/>
      <enumerator name='GNUTLS_GROUP_EXP_MLKEM768' value='516'/>
      <enumerator name='GNUTLS_GROUP_EXP_MLKEM1024' value='517'/>
      <enumerator name='GNUTLS_GROUP_EXP_MIN' value='512'/>
      <enumerator name='GNUTLS_GROUP_EXP_MAX' value='518'/>
    </enum-decl>
    <enum-decl name='gnutls_handshake_description_t' naming-typedef-id='type-id-294' size-in-bits='32' alignment-in-bits='32' hash='d98ade4fb04d008c' id='type-id-295'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_REQUEST' value='0'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO' value='1'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO' value='2'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_VERIFY_REQUEST' value='3'/>
      <enumerator name='GNUTLS_HANDSHAKE_NEW_SESSION_TICKET' value='4'/>
      <enumerator name='GNUTLS_HANDSHAKE_END_OF_EARLY_DATA' value='5'/>
      <enumerator name='GNUTLS_HANDSHAKE_ENCRYPTED_EXTENSIONS' value='8'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_PKT' value='11'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_KEY_EXCHANGE' value='12'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_REQUEST' value='13'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO_DONE' value='14'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_VERIFY' value='15'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_KEY_EXCHANGE' value='16'/>
      <enumerator name='GNUTLS_HANDSHAKE_FINISHED' value='20'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_STATUS' value='22'/>
      <enumerator name='GNUTLS_HANDSHAKE_SUPPLEMENTAL' value='23'/>
      <enumerator name='GNUTLS_HANDSHAKE_KEY_UPDATE' value='24'/>
      <enumerator name='GNUTLS_HANDSHAKE_COMPRESSED_CERTIFICATE_PKT' value='25'/>
      <enumerator name='GNUTLS_HANDSHAKE_CHANGE_CIPHER_SPEC' value='254'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO_V2' value='1024'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_RETRY_REQUEST' value='1025'/>
    </enum-decl>
    <enum-decl name='gnutls_kx_algorithm_t' naming-typedef-id='type-id-296' size-in-bits='32' alignment-in-bits='32' hash='1a87bc2b38745424' id='type-id-297'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_KX_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_KX_RSA' value='1'/>
      <enumerator name='GNUTLS_KX_DHE_DSS' value='2'/>
      <enumerator name='GNUTLS_KX_DHE_RSA' value='3'/>
      <enumerator name='GNUTLS_KX_ANON_DH' value='4'/>
      <enumerator name='GNUTLS_KX_SRP' value='5'/>
      <enumerator name='GNUTLS_KX_RSA_EXPORT' value='6'/>
      <enumerator name='GNUTLS_KX_SRP_RSA' value='7'/>
      <enumerator name='GNUTLS_KX_SRP_DSS' value='8'/>
      <enumerator name='GNUTLS_KX_PSK' value='9'/>
      <enumerator name='GNUTLS_KX_DHE_PSK' value='10'/>
      <enumerator name='GNUTLS_KX_ANON_ECDH' value='11'/>
      <enumerator name='GNUTLS_KX_ECDHE_RSA' value='12'/>
      <enumerator name='GNUTLS_KX_ECDHE_ECDSA' value='13'/>
      <enumerator name='GNUTLS_KX_ECDHE_PSK' value='14'/>
      <enumerator name='GNUTLS_KX_RSA_PSK' value='15'/>
      <enumerator name='GNUTLS_KX_VKO_GOST_12' value='16'/>
    </enum-decl>
    <enum-decl name='gnutls_mac_algorithm_t' naming-typedef-id='type-id-298' size-in-bits='32' alignment-in-bits='32' hash='aad3044eddba03c1' id='type-id-299'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_MAC_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_MAC_NULL' value='1'/>
      <enumerator name='GNUTLS_MAC_MD5' value='2'/>
      <enumerator name='GNUTLS_MAC_SHA1' value='3'/>
      <enumerator name='GNUTLS_MAC_RMD160' value='4'/>
      <enumerator name='GNUTLS_MAC_MD2' value='5'/>
      <enumerator name='GNUTLS_MAC_SHA256' value='6'/>
      <enumerator name='GNUTLS_MAC_SHA384' value='7'/>
      <enumerator name='GNUTLS_MAC_SHA512' value='8'/>
      <enumerator name='GNUTLS_MAC_SHA224' value='9'/>
      <enumerator name='GNUTLS_MAC_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_MAC_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_MAC_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_MAC_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_MAC_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_MAC_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_512' value='17'/>
      <enumerator name='GNUTLS_MAC_AEAD' value='200'/>
      <enumerator name='GNUTLS_MAC_UMAC_96' value='201'/>
      <enumerator name='GNUTLS_MAC_UMAC_128' value='202'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_128' value='203'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_256' value='204'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_128' value='205'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_192' value='206'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_256' value='207'/>
      <enumerator name='GNUTLS_MAC_GOST28147_TC26Z_IMIT' value='208'/>
      <enumerator name='GNUTLS_MAC_SHAKE_128' value='209'/>
      <enumerator name='GNUTLS_MAC_SHAKE_256' value='210'/>
      <enumerator name='GNUTLS_MAC_MAGMA_OMAC' value='211'/>
      <enumerator name='GNUTLS_MAC_KUZNYECHIK_OMAC' value='212'/>
      <enumerator name='GNUTLS_MAC_PBMAC1' value='213'/>
    </enum-decl>
    <enum-decl name='gnutls_pk_algorithm_t' naming-typedef-id='type-id-300' size-in-bits='32' alignment-in-bits='32' hash='e7b740922d3040e7' id='type-id-301'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_PK_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_PK_RSA' value='1'/>
      <enumerator name='GNUTLS_PK_DSA' value='2'/>
      <enumerator name='GNUTLS_PK_DH' value='3'/>
      <enumerator name='GNUTLS_PK_ECDSA' value='4'/>
      <enumerator name='GNUTLS_PK_ECDH_X25519' value='5'/>
      <enumerator name='GNUTLS_PK_RSA_PSS' value='6'/>
      <enumerator name='GNUTLS_PK_EDDSA_ED25519' value='7'/>
      <enumerator name='GNUTLS_PK_GOST_01' value='8'/>
      <enumerator name='GNUTLS_PK_GOST_12_256' value='9'/>
      <enumerator name='GNUTLS_PK_GOST_12_512' value='10'/>
      <enumerator name='GNUTLS_PK_ECDH_X448' value='11'/>
      <enumerator name='GNUTLS_PK_EDDSA_ED448' value='12'/>
      <enumerator name='GNUTLS_PK_RSA_OAEP' value='13'/>
      <enumerator name='GNUTLS_PK_MLKEM768' value='14'/>
      <enumerator name='GNUTLS_PK_MLDSA44' value='15'/>
      <enumerator name='GNUTLS_PK_MLDSA65' value='16'/>
      <enumerator name='GNUTLS_PK_MLDSA87' value='17'/>
      <enumerator name='GNUTLS_PK_MLKEM1024' value='18'/>
      <enumerator name='GNUTLS_PK_MAX' value='18'/>
      <enumerator name='GNUTLS_PK_EXP_KYBER768' value='256'/>
      <enumerator name='GNUTLS_PK_EXP_MAX' value='256'/>
    </enum-decl>
    <enum-decl name='gnutls_protocol_t' naming-typedef-id='type-id-302' size-in-bits='32' alignment-in-bits='32' hash='e847215942717a07' id='type-id-303'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_SSL3' value='1'/>
      <enumerator name='GNUTLS_TLS1_0' value='2'/>
      <enumerator name='GNUTLS_TLS1' value='2'/>
      <enumerator name='GNUTLS_TLS1_1' value='3'/>
      <enumerator name='GNUTLS_TLS1_2' value='4'/>
      <enumerator name='GNUTLS_TLS1_3' value='5'/>
      <enumerator name='GNUTLS_DTLS0_9' value='200'/>
      <enumerator name='GNUTLS_DTLS1_0' value='201'/>
      <enumerator name='GNUTLS_DTLS1_2' value='202'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MIN' value='200'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MAX' value='202'/>
      <enumerator name='GNUTLS_TLS_VERSION_MAX' value='5'/>
      <enumerator name='GNUTLS_VERSION_UNKNOWN' value='255'/>
    </enum-decl>
    <enum-decl name='gnutls_record_encryption_level_t' naming-typedef-id='type-id-304' size-in-bits='32' alignment-in-bits='32' hash='f6b50cfa44d9ffbb' id='type-id-305'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_INITIAL' value='0'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_EARLY' value='1'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_HANDSHAKE' value='2'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_APPLICATION' value='3'/>
    </enum-decl>
    <enum-decl name='gnutls_sec_param_t' naming-typedef-id='type-id-306' size-in-bits='32' alignment-in-bits='32' hash='8e169468aa6f6c47' id='type-id-307'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_SEC_PARAM_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SEC_PARAM_INSECURE' value='5'/>
      <enumerator name='GNUTLS_SEC_PARAM_EXPORT' value='10'/>
      <enumerator name='GNUTLS_SEC_PARAM_VERY_WEAK' value='15'/>
      <enumerator name='GNUTLS_SEC_PARAM_WEAK' value='20'/>
      <enumerator name='GNUTLS_SEC_PARAM_LOW' value='25'/>
      <enumerator name='GNUTLS_SEC_PARAM_LEGACY' value='30'/>
      <enumerator name='GNUTLS_SEC_PARAM_MEDIUM' value='35'/>
      <enumerator name='GNUTLS_SEC_PARAM_HIGH' value='40'/>
      <enumerator name='GNUTLS_SEC_PARAM_ULTRA' value='45'/>
      <enumerator name='GNUTLS_SEC_PARAM_FUTURE' value='50'/>
      <enumerator name='GNUTLS_SEC_PARAM_MAX' value='50'/>
    </enum-decl>
    <enum-decl name='gnutls_sign_algorithm_t' naming-typedef-id='type-id-308' size-in-bits='32' alignment-in-bits='32' hash='918dad5d5baf242d' id='type-id-309'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_SIGN_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA1' value='1'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA' value='1'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA1' value='2'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA' value='2'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD5' value='3'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD2' value='4'/>
      <enumerator name='GNUTLS_SIGN_RSA_RMD160' value='5'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA256' value='6'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA384' value='7'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA512' value='8'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA224' value='9'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA224' value='10'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA256' value='11'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA1' value='12'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA224' value='13'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA256' value='14'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA384' value='15'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA512' value='16'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA384' value='17'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA512' value='18'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_224' value='20'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_256' value='21'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_384' value='22'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_512' value='23'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_224' value='24'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_256' value='25'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_384' value='26'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_512' value='27'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_224' value='28'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_256' value='29'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_384' value='30'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_512' value='31'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA256' value='32'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA384' value='33'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA512' value='34'/>
      <enumerator name='GNUTLS_SIGN_EDDSA_ED25519' value='35'/>
      <enumerator name='GNUTLS_SIGN_RSA_RAW' value='36'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP256R1_SHA256' value='37'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP384R1_SHA384' value='38'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP521R1_SHA512' value='39'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA256' value='40'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA384' value='41'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA512' value='42'/>
      <enumerator name='GNUTLS_SIGN_GOST_94' value='43'/>
      <enumerator name='GNUTLS_SIGN_GOST_256' value='44'/>
      <enumerator name='GNUTLS_SIGN_GOST_512' value='45'/>
      <enumerator name='GNUTLS_SIGN_EDDSA_ED448' value='46'/>
      <enumerator name='GNUTLS_SIGN_MLDSA44' value='47'/>
      <enumerator name='GNUTLS_SIGN_MLDSA65' value='48'/>
      <enumerator name='GNUTLS_SIGN_MLDSA87' value='49'/>
      <enumerator name='GNUTLS_SIGN_MAX' value='49'/>
    </enum-decl>
    <enum-decl name='gnutls_vdata_types_t' naming-typedef-id='type-id-310' size-in-bits='32' alignment-in-bits='32' hash='a3cc4a6c4e5bfb00' id='type-id-311'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_DT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DT_DNS_HOSTNAME' value='1'/>
      <enumerator name='GNUTLS_DT_KEY_PURPOSE_OID' value='2'/>
      <enumerator name='GNUTLS_DT_RFC822NAME' value='3'/>
      <enumerator name='GNUTLS_DT_IP_ADDRESS' value='4'/>
    </enum-decl>
    <enum-decl name='gnutls_x509_crt_fmt_t' naming-typedef-id='type-id-312' size-in-bits='32' alignment-in-bits='32' hash='2a90723ab146748b' id='type-id-313'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <enum-decl name='handshake_state_t' size-in-bits='32' alignment-in-bits='32' hash='0fa1ff01b0f233e1' id='type-id-314'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='STATE0' value='0'/>
      <enumerator name='STATE1' value='1'/>
      <enumerator name='STATE2' value='2'/>
      <enumerator name='STATE3' value='3'/>
      <enumerator name='STATE4' value='4'/>
      <enumerator name='STATE5' value='5'/>
      <enumerator name='STATE6' value='6'/>
      <enumerator name='STATE7' value='7'/>
      <enumerator name='STATE8' value='8'/>
      <enumerator name='STATE9' value='9'/>
      <enumerator name='STATE10' value='10'/>
      <enumerator name='STATE11' value='11'/>
      <enumerator name='STATE12' value='12'/>
      <enumerator name='STATE13' value='13'/>
      <enumerator name='STATE14' value='14'/>
      <enumerator name='STATE15' value='15'/>
      <enumerator name='STATE16' value='16'/>
      <enumerator name='STATE17' value='17'/>
      <enumerator name='STATE18' value='18'/>
      <enumerator name='STATE19' value='19'/>
      <enumerator name='STATE20' value='20'/>
      <enumerator name='STATE21' value='21'/>
      <enumerator name='STATE22' value='22'/>
      <enumerator name='STATE30' value='30'/>
      <enumerator name='STATE31' value='31'/>
      <enumerator name='STATE40' value='40'/>
      <enumerator name='STATE41' value='41'/>
      <enumerator name='STATE50' value='50'/>
      <enumerator name='STATE90' value='90'/>
      <enumerator name='STATE91' value='91'/>
      <enumerator name='STATE92' value='92'/>
      <enumerator name='STATE93' value='93'/>
      <enumerator name='STATE94' value='94'/>
      <enumerator name='STATE99' value='99'/>
      <enumerator name='STATE100' value='100'/>
      <enumerator name='STATE101' value='101'/>
      <enumerator name='STATE102' value='102'/>
      <enumerator name='STATE103' value='103'/>
      <enumerator name='STATE104' value='104'/>
      <enumerator name='STATE105' value='105'/>
      <enumerator name='STATE106' value='106'/>
      <enumerator name='STATE107' value='107'/>
      <enumerator name='STATE108' value='108'/>
      <enumerator name='STATE109' value='109'/>
      <enumerator name='STATE110' value='110'/>
      <enumerator name='STATE111' value='111'/>
      <enumerator name='STATE112' value='112'/>
      <enumerator name='STATE113' value='113'/>
      <enumerator name='STATE114' value='114'/>
      <enumerator name='STATE115' value='115'/>
      <enumerator name='STATE150' value='116'/>
    </enum-decl>
    <enum-decl name='hash_security_level_t' size-in-bits='32' alignment-in-bits='32' hash='cd87d7e872c2c733' id='type-id-315'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='_SECURE' value='0'/>
      <enumerator name='_INSECURE_FOR_CERTS' value='1'/>
      <enumerator name='_INSECURE' value='2'/>
    </enum-decl>
    <enum-decl name='heartbeat_state_t' size-in-bits='32' alignment-in-bits='32' hash='75b2b76e34c7797c' id='type-id-316'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='SHB_SEND1' value='0'/>
      <enumerator name='SHB_SEND2' value='1'/>
      <enumerator name='SHB_RECV' value='2'/>
    </enum-decl>
    <enum-decl name='reauth_state_t' size-in-bits='32' alignment-in-bits='32' hash='44fa8a0f6d681bd4' id='type-id-317'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='REAUTH_STATE0' value='0'/>
      <enumerator name='REAUTH_STATE1' value='1'/>
      <enumerator name='REAUTH_STATE2' value='2'/>
      <enumerator name='REAUTH_STATE3' value='3'/>
      <enumerator name='REAUTH_STATE4' value='4'/>
      <enumerator name='REAUTH_STATE5' value='5'/>
    </enum-decl>
    <enum-decl name='record_send_state_t' size-in-bits='32' alignment-in-bits='32' hash='2b547b942e1b2e51' id='type-id-318'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='RECORD_SEND_NORMAL' value='0'/>
      <enumerator name='RECORD_SEND_CORKED' value='1'/>
      <enumerator name='RECORD_SEND_CORKED_TO_KU' value='2'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_1' value='3'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_2' value='4'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_3' value='5'/>
    </enum-decl>
    <enum-decl name='recv_state_t' size-in-bits='32' alignment-in-bits='32' hash='25d8cf32c8e36db0' id='type-id-319'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='RECV_STATE_0' value='0'/>
      <enumerator name='RECV_STATE_DTLS_RETRANSMIT' value='1'/>
      <enumerator name='RECV_STATE_FALSE_START_HANDLING' value='2'/>
      <enumerator name='RECV_STATE_FALSE_START' value='3'/>
      <enumerator name='RECV_STATE_ASYNC_HANDSHAKE' value='4'/>
      <enumerator name='RECV_STATE_EARLY_START_HANDLING' value='5'/>
      <enumerator name='RECV_STATE_EARLY_START' value='6'/>
      <enumerator name='RECV_STATE_REHANDSHAKE' value='7'/>
      <enumerator name='RECV_STATE_REAUTH' value='8'/>
    </enum-decl>
    <enum-decl name='safe_renegotiation_t' naming-typedef-id='type-id-320' size-in-bits='32' alignment-in-bits='32' hash='ca2121b74694e837' id='type-id-321'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='SR_DISABLED' value='0'/>
      <enumerator name='SR_UNSAFE' value='1'/>
      <enumerator name='SR_PARTIAL' value='2'/>
      <enumerator name='SR_SAFE' value='3'/>
    </enum-decl>
    <enum-decl name='send_ticket_state_t' size-in-bits='32' alignment-in-bits='32' hash='69ed3175885a96dd' id='type-id-322'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='TICKET_STATE0' value='0'/>
      <enumerator name='TICKET_STATE1' value='1'/>
    </enum-decl>
    <enum-decl name='transport_t' size-in-bits='32' alignment-in-bits='32' hash='443449e2b70fecc0' id='type-id-323'>
      <underlying-type type-id='type-id-180'/>
      <enumerator name='GNUTLS_STREAM' value='0'/>
      <enumerator name='GNUTLS_DGRAM' value='1'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-324' size-in-bits='2048' alignment-in-bits='32' hash='8b2267ba14003f60' id='type-id-325'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-326'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-327' size-in-bits='12800' hash='5ae0ccc9b4b35305' id='type-id-328'>
      <subrange length='100' lower-bound='0' upper-bound='99' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='5dfc2c3b81f9ce6a' id='type-id-258'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-292' size-in-bits='96' alignment-in-bits='32' hash='d2e752353673df8d' id='type-id-329'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-330' size-in-bits='3456' hash='3e2cb8ebc812bf5c' id='type-id-331'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-332'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-4'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-119'/>
    <array-type-def dimensions='1' type-id='type-id-333' size-in-bits='1024' hash='b5a5186b75f1dfe0' id='type-id-334'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-238'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='type-id-106'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-109'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' hash='dedab36ee0ea6582' id='type-id-335'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-336' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='type-id-244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-339' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-340' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-341' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='type-id-342' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='type-id-343' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='type-id-120' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='api_aead_cipher_hd_st' is-struct='yes' visibility='default' size-in-bits='768' hash='ecbff7cfc23c57c8' id='type-id-344'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-345' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='auth_cipher_hd_st' is-struct='yes' naming-typedef-id='type-id-346' visibility='default' size-in-bits='1472' hash='94aa6d5d22bebd62' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cipher' type-id='type-id-345' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mac' type-id='type-id-348' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='is_mac' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1345'>
        <var-decl name='continuous_mac' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1346'>
        <var-decl name='non_null' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1347'>
        <var-decl name='etm' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tag_size' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='auth_cred_st' is-struct='yes' visibility='default' size-in-bits='192' hash='86b49a7a1eed437b' id='type-id-349'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='algorithm' type-id='type-id-282' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='credentials' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-350' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='binder_data_st' is-struct='yes' visibility='default' size-in-bits='256' hash='ea17d2220017a726' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prf' type-id='type-id-351' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='psk' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='idx' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='resumption' type-id='type-id-209' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='cipher_entry_st' is-struct='yes' visibility='default' size-in-bits='256' hash='269904741085248a' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-353' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blocksize' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='keysize' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='implicit_iv' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='explicit_iv' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cipher_iv' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='tagsize' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='cipher_hd_st' is-struct='yes' naming-typedef-id='type-id-345' visibility='default' size-in-bits='768' hash='44579ebda7aea33c' id='type-id-354'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='e' type-id='type-id-355' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='encrypt' type-id='type-id-356' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt' type-id='type-id-357' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aead_encrypt' type-id='type-id-358' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='aead_decrypt' type-id='type-id-359' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth' type-id='type-id-360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tag' type-id='type-id-361' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='setiv' type-id='type-id-362' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='getiv' type-id='type-id-363' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='setkey' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='deinit' type-id='type-id-365' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ciphersuite_list_st' is-struct='yes' visibility='default' size-in-bits='16448' hash='480ff5a44dcec4f3' id='type-id-366'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='size' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dane_query_st' is-struct='yes' visibility='default' size-in-bits='22592' hash='4c2c70821127fc38' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result' type-id='type-id-368' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_entries' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='usage' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='type' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='match' type-id='type-id-260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='data' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22528'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22560'>
        <var-decl name='status' type-id='type-id-369' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dane_state_st' is-struct='yes' visibility='default' size-in-bits='128' hash='d5b35e1724d36e4e' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-371' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='digest_hd_st' is-struct='yes' naming-typedef-id='type-id-372' visibility='default' size-in-bits='512' hash='d8a8287206620f57' id='type-id-373'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-374' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-375' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='output' type-id='type-id-376' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='deinit' type-id='type-id-377' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='copy' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='key' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='keysize' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handle' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dtls_st' is-struct='yes' naming-typedef-id='type-id-379' visibility='default' size-in-bits='576' hash='04dce61c185fe59b' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dcookie' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hsk_write_seq' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hsk_read_seq' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mtu' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flight_init' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='last_flight' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='retrans_timeout_ms' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hsk_hello_verify_requests' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='actual_retrans_timeout_ms' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='async_term' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_retransmit' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='packets_dropped' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_buffer_st' is-struct='yes' visibility='default' size-in-bits='256' hash='e4fde87a6645b3bc' id='type-id-382'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocd' type-id='type-id-383' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-383' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_cipher_suite_entry_st' is-struct='yes' visibility='default' size-in-bits='448' hash='540d531231aac646' id='type-id-384'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-256' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='canonical_name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='block_algorithm' type-id='type-id-353' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='kx_algorithm' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mac_algorithm' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='min_version' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_version' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='min_dtls_version' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='max_dtls_version' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='prf' type-id='type-id-298' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_datum_t' is-struct='yes' naming-typedef-id='type-id-327' visibility='default' size-in-bits='128' hash='bb81b3b569018715' id='type-id-385'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-386' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_group_entry_st' is-struct='yes' visibility='default' size-in-bits='704' hash='6b0519ca924f6c4f' id='type-id-387'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prime' type-id='type-id-388' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='q' type-id='type-id-388' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='generator' type-id='type-id-388' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='q_bits' type-id='type-id-389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='curve' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pk' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pubkey_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ciphertext_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ids' type-id='type-id-329' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='tls_id' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_key_st' is-struct='yes' visibility='default' size-in-bits='28480' hash='491f314661305998' id='type-id-390'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kshare' type-id='type-id-391' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16640'>
        <var-decl name='proto' type-id='type-id-392' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25856'>
        <var-decl name='binders' type-id='type-id-240' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26368'>
        <var-decl name='key' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26496'>
        <var-decl name='session_ticket_key' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27008'>
        <var-decl name='previous_ticket_key' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27520'>
        <var-decl name='initial_stek' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28032'>
        <var-decl name='stek_initialized' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28096'>
        <var-decl name='auth_info' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28160'>
        <var-decl name='auth_info_type' type-id='type-id-282' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28192'>
        <var-decl name='auth_info_size' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28224'>
        <var-decl name='cred' type-id='type-id-394' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28288'>
        <var-decl name='totp' type-id='type-id-395' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_ocsp_data_st' is-struct='yes' visibility='default' size-in-bits='512' hash='a5ce60cba1417622' id='type-id-396'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exptime' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='padding' type-id='type-id-397' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pcert_st' is-struct='yes' visibility='default' size-in-bits='256' hash='af1db882300c9847' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pubkey' type-id='type-id-399' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cert' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='type' type-id='type-id-277' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pk_params_st' is-struct='yes' naming-typedef-id='type-id-400' visibility='default' size-in-bits='4160' hash='a052ebeb92eb89c6' id='type-id-401'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-237' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='params_nr' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='pkflags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='qbits' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='curve' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_group' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='gost_params' type-id='type-id-290' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='raw_pub' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='raw_priv' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='raw_seed' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='seed_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='seed' type-id='type-id-402' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='palgo' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='spki' type-id='type-id-403' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='algo' type-id='type-id-300' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_priority_st' is-struct='yes' visibility='default' size-in-bits='66432' hash='1f1a74ffd5a55fec' id='type-id-404'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='client_ctype' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='server_ctype' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12384'>
        <var-decl name='_cipher' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16512'>
        <var-decl name='_mac' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20640'>
        <var-decl name='_kx' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24768'>
        <var-decl name='_sign_algo' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28896'>
        <var-decl name='_supported_ecc' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33024'>
        <var-decl name='groups' type-id='type-id-406' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41280'>
        <var-decl name='sigalg' type-id='type-id-407' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49536'>
        <var-decl name='cs' type-id='type-id-408' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65984'>
        <var-decl name='no_extensions' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65992'>
        <var-decl name='no_shuffle_extensions' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66016'>
        <var-decl name='sr' type-id='type-id-320' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66048'>
        <var-decl name='min_record_version' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66056'>
        <var-decl name='server_precedence' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66064'>
        <var-decl name='allow_server_key_usage_violation' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66072'>
        <var-decl name='no_status_request' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66080'>
        <var-decl name='no_tickets' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66088'>
        <var-decl name='no_tickets_tls12' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66096'>
        <var-decl name='have_cbc' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66104'>
        <var-decl name='have_psk' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66112'>
        <var-decl name='force_etm' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66144'>
        <var-decl name='additional_verify_flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66176'>
        <var-decl name='tls13_compat_mode' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66208'>
        <var-decl name='force_ext_master_secret' type-id='type-id-409' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66240'>
        <var-decl name='fallback' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66272'>
        <var-decl name='level' type-id='type-id-306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66304'>
        <var-decl name='_allow_large_records' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66312'>
        <var-decl name='_allow_small_records' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66320'>
        <var-decl name='_no_etm' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66328'>
        <var-decl name='_no_ext_master_secret' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66336'>
        <var-decl name='_allow_key_usage_violation' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66344'>
        <var-decl name='_dumbfw' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66368'>
        <var-decl name='_dh_prime_bits' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_session_int' is-struct='yes' visibility='default' size-in-bits='67072' hash='2ff4715e2e0628ec' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security_parameters' type-id='type-id-411' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='record_parameters' type-id='type-id-334' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='internals' type-id='type-id-412' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38592'>
        <var-decl name='key' type-id='type-id-413' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_sign_entry_st' is-struct='yes' visibility='default' size-in-bits='448' hash='1608d2adf026acee' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pk' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='priv_pk' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cert_pk' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='curve' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='aid' type-id='type-id-415' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='slevel' type-id='type-id-416' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='hash_output_size' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_typed_vdata_st' is-struct='yes' naming-typedef-id='type-id-417' visibility='default' size-in-bits='192' hash='dc89933b032ad501' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-310' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-386' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_x509_spki_st' is-struct='yes' visibility='default' size-in-bits='384' hash='005ca2e9ea981e5f' id='type-id-419'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_dig' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='salt_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsa_oaep_dig' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rsa_oaep_label' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='legacy' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='dsa_dig' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='group_list_st' is-struct='yes' visibility='default' size-in-bits='8256' hash='99fb73fe1c70c225' id='type-id-420'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-251' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='have_ffdhe' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='handshake_buffer_st' is-struct='yes' naming-typedef-id='type-id-330' visibility='default' size-in-bits='576' hash='78eed1136adeded8' id='type-id-421'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='htype' type-id='type-id-294' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rtype' type-id='type-id-294' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sequence' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_offset' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='end_offset' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='header' type-id='type-id-422' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='header_size' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data' type-id='type-id-423' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='internals_st' is-struct='yes' naming-typedef-id='type-id-412' visibility='default' size-in-bits='35520' hash='7c75331c4f4095f0' id='type-id-424'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_buffer' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handshake_hash_buffer_prev_len' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='handshake_hash_buffer_client_hello_len' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='handshake_hash_buffer_client_kx_len' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='handshake_hash_buffer_server_finished_len' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handshake_hash_buffer_client_finished_len' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handshake_hash_buffer' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resumable' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='ticket_state' type-id='type-id-426' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bye_state' type-id='type-id-427' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reauth_state' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='handshake_final_state' type-id='type-id-429' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='handshake_state' type-id='type-id-429' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='invalid_connection' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='904'>
        <var-decl name='may_not_read' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='may_not_write' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='920'>
        <var-decl name='read_eof' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='last_alert' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='last_handshake_in' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='last_handshake_out' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='priorities' type-id='type-id-430' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='allow_large_records' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1096'>
        <var-decl name='allow_small_records' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='no_etm' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1112'>
        <var-decl name='no_ext_master_secret' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='allow_key_usage_violation' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1128'>
        <var-decl name='dumbfw' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='dh_prime_bits' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='resumed' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1160'>
        <var-decl name='resumption_requested' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='resumed_security_parameters' type-id='type-id-411' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='resumption_data' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='handshake_send_buffer' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='handshake_header_recv_buffer' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='handshake_recv_buffer' type-id='type-id-331' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='handshake_recv_buffer_size' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='record_recv_buffer' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='record_send_buffer' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='record_send_buffer_user_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='early_data_recv_buffer' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='early_data_presend_buffer' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='rsend_state' type-id='type-id-431' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='record_key_update_buffer' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='record_presend_buffer' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='reauth_buffer' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='expire_time' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='auth_struct' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='adv_version_major' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9480'>
        <var-decl name='adv_version_minor' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9504'>
        <var-decl name='send_cert_req' type-id='type-id-275' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='cert_output_callback' type-id='type-id-433' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='max_handshake_data_buffer_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='pull_timeout_func' type-id='type-id-434' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='pull_func' type-id='type-id-435' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='push_func' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9856'>
        <var-decl name='vec_push_func' type-id='type-id-437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='errno_func' type-id='type-id-438' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='transport_recv_ptr' type-id='type-id-439' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='transport_send_ptr' type-id='type-id-439' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='db_store_func' type-id='type-id-440' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='db_retrieve_func' type-id='type-id-441' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='db_remove_func' type-id='type-id-442' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='db_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='user_hello_func' type-id='type-id-443' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10432'>
        <var-decl name='h_hook' type-id='type-id-444' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10496'>
        <var-decl name='h_type' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10528'>
        <var-decl name='h_post' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='h_read_func' type-id='type-id-445' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='h_secret_func' type-id='type-id-446' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='alert_read_func' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='keylog_func' type-id='type-id-448' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='selected_cert_list' type-id='type-id-449' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='selected_cert_list_length' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='selected_key' type-id='type-id-450' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='selected_ocsp' type-id='type-id-451' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='selected_ocsp_length' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='selected_ocsp_func' type-id='type-id-452' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='selected_ocsp_func_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='selected_need_free' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11272'>
        <var-decl name='default_record_version' type-id='type-id-453' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11288'>
        <var-decl name='default_hello_version' type-id='type-id-453' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='user_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11392'>
        <var-decl name='direction' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11400'>
        <var-decl name='ignore_rdn_sequence' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11408'>
        <var-decl name='rsa_pms_version' type-id='type-id-453' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11424'>
        <var-decl name='errnum' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11456'>
        <var-decl name='initial_negotiation_completed' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='post_negotiation_lock' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11584'>
        <var-decl name='transport' type-id='type-id-454' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11648'>
        <var-decl name='dtls' type-id='type-id-379' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12224'>
        <var-decl name='handshake_suspicious_loops' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12256'>
        <var-decl name='handshake_in_progress' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12264'>
        <var-decl name='premaster_set' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12288'>
        <var-decl name='cb_tls_unique_len' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12320'>
        <var-decl name='cb_tls_unique' type-id='type-id-455' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='handshake_start_time' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12736'>
        <var-decl name='handshake_abs_timeout' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12864'>
        <var-decl name='ertt' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12896'>
        <var-decl name='handshake_timeout_ms' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12928'>
        <var-decl name='record_timeout_ms' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12992'>
        <var-decl name='post_handshake_cr_context' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13120'>
        <var-decl name='post_handshake_hash_buffer' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13376'>
        <var-decl name='hsk_flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13440'>
        <var-decl name='last_key_update' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13568'>
        <var-decl name='key_update_count' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13632'>
        <var-decl name='full_client_hello' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13888'>
        <var-decl name='extensions_offset' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13952'>
        <var-decl name='hb_local_data' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14208'>
        <var-decl name='hb_remote_data' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14464'>
        <var-decl name='hb_ping_start' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14592'>
        <var-decl name='hb_ping_sent' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14720'>
        <var-decl name='hb_actual_retrans_timeout_ms' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14752'>
        <var-decl name='hb_retrans_timeout_ms' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14784'>
        <var-decl name='hb_total_timeout_ms' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14816'>
        <var-decl name='ocsp_check_ok' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14848'>
        <var-decl name='hb_state' type-id='type-id-456' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14880'>
        <var-decl name='recv_state' type-id='type-id-457' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14912'>
        <var-decl name='sc_random_set' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14976'>
        <var-decl name='flags' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15040'>
        <var-decl name='verify_callback' type-id='type-id-458' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15104'>
        <var-decl name='vc_data' type-id='type-id-459' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15168'>
        <var-decl name='vc_sdata' type-id='type-id-417' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15360'>
        <var-decl name='vc_elements' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15392'>
        <var-decl name='vc_status' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15424'>
        <var-decl name='additional_verify_flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15456'>
        <var-decl name='cert_hash' type-id='type-id-460' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15712'>
        <var-decl name='cert_hash_set' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15744'>
        <var-decl name='saved_username' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15808'>
        <var-decl name='saved_username_size' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15872'>
        <var-decl name='tfo' type-id='type-id-461' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17088'>
        <var-decl name='rsup' type-id='type-id-462' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17152'>
        <var-decl name='rsup_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17216'>
        <var-decl name='rexts' type-id='type-id-463' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17280'>
        <var-decl name='rexts_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17344'>
        <var-decl name='ext_data' type-id='type-id-464' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29632'>
        <var-decl name='used_exts' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29696'>
        <var-decl name='ext_msg' type-id='type-id-288' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29728'>
        <var-decl name='max_recv_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29760'>
        <var-decl name='cand_ec_group' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29824'>
        <var-decl name='cand_dh_group' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29888'>
        <var-decl name='cand_group' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29952'>
        <var-decl name='hrr_cs' type-id='type-id-453' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29984'>
        <var-decl name='session_ticket_renew' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30016'>
        <var-decl name='tls13_ticket' type-id='type-id-465' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='early_data_received' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33216'>
        <var-decl name='anti_replay' type-id='type-id-466' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33280'>
        <var-decl name='epoch_lock' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33344'>
        <var-decl name='ktls_enabled' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33376'>
        <var-decl name='compress_certificate_method' type-id='type-id-280' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33408'>
        <var-decl name='client_hello_exts' type-id='type-id-325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35456'>
        <var-decl name='client_hello_exts_set' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' hash='1e0571bd6dce7043' id='type-id-467'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mac_entry_st' is-struct='yes' visibility='default' size-in-bits='448' hash='7790487249ce2657' id='type-id-468'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_oid' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='output_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nonce_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='placeholder' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mac_hd_st' is-struct='yes' naming-typedef-id='type-id-469' visibility='default' size-in-bits='576' hash='bd39e64aa671868c' id='type-id-470'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-374' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mac_len' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash' type-id='type-id-375' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='setnonce' type-id='type-id-471' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-376' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit' type-id='type-id-377' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='copy' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='setkey' type-id='type-id-472' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='handle' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mbuffer_head_st' is-struct='yes' visibility='default' size-in-bits='256' hash='57e0990c4a5d107e' id='type-id-473'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-474' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tail' type-id='type-id-474' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='byte_length' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mbuffer_st' is-struct='yes' visibility='default' size-in-bits='640' hash='ff0b3a1344ac532c' id='type-id-475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-476' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-476' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg' type-id='type-id-327' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='maximum_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='uhead_mark' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='type' type-id='type-id-477' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='record_sequence' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='epoch' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='htype' type-id='type-id-294' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='handshake_sequence' type-id='type-id-211' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mod_auth_st_int' is-struct='yes' visibility='default' size-in-bits='832' hash='a859887c2659b6f0' id='type-id-478'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gnutls_generate_server_certificate' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gnutls_generate_client_certificate' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gnutls_generate_server_kx' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='gnutls_generate_client_kx' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gnutls_generate_client_crt_vrfy' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='gnutls_generate_server_crt_request' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='gnutls_process_server_certificate' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='gnutls_process_client_certificate' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='gnutls_process_server_kx' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='gnutls_process_client_kx' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='gnutls_process_client_crt_vrfy' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='gnutls_process_server_crt_request' type-id='type-id-480' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='priority_st' is-struct='yes' naming-typedef-id='type-id-405' visibility='default' size-in-bits='4128' hash='88afb48f524b468d' id='type-id-481'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priorities' type-id='type-id-482' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='num_priorities' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='record_parameters_st' is-struct='yes' visibility='default' size-in-bits='5888' hash='d8fcc8f7ada6f4fd' id='type-id-483'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='epoch' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='initialized' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cipher' type-id='type-id-355' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='etm' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mac' type-id='type-id-374' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dtls_sw_next' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dtls_sw_bits' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dtls_sw_have_recv' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='read' type-id='type-id-484' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='write' type-id='type-id-484' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='usage_cnt' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='record_state_st' is-struct='yes' visibility='default' size-in-bits='2688' hash='b3e9fe389d97a8e7' id='type-id-485'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mac_key' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mac_key_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='iv' type-id='type-id-486' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='iv_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='key' type-id='type-id-460' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='key_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ctx' type-id='type-id-487' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='aead_tag_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='is_aead' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='sequence_number' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='level' type-id='type-id-304' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='security_parameters_st' is-struct='yes' naming-typedef-id='type-id-411' visibility='default' size-in-bits='2048' hash='731e5d894c2461a7' id='type-id-488'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entity' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='epoch_read' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='epoch_write' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epoch_next' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cs' type-id='type-id-489' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prf' type-id='type-id-374' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='master_secret' type-id='type-id-490' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='client_random' type-id='type-id-460' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='server_random' type-id='type-id-460' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='session_id' type-id='type-id-460' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='session_id_size' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='timestamp' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='post_handshake_auth' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='max_record_send_size' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='max_record_recv_size' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1584'>
        <var-decl name='max_user_record_send_size' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='max_user_record_recv_size' type-id='type-id-211' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='max_early_data_size' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='client_ctype' type-id='type-id-277' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='server_ctype' type-id='type-id-277' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='grp' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='server_sign_algo' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='client_sign_algo' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ext_master_secret' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1864'>
        <var-decl name='etm' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1872'>
        <var-decl name='client_auth_type' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1880'>
        <var-decl name='server_auth_type' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='do_recv_supplemental' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='do_send_supplemental' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pversion' type-id='type-id-491' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sign_algo_list_st' is-struct='yes' visibility='default' size-in-bits='8256' hash='14007c942cec4924' id='type-id-492'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='size' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sign_algorithm_st' is-struct='yes' naming-typedef-id='type-id-493' visibility='default' size-in-bits='24' hash='2e9638973f0a767a' id='type-id-494'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-453' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tls_sem' type-id='type-id-209' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' is-struct='yes' visibility='default' size-in-bits='1024' hash='3ad3c646386e818d' id='type-id-495'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-496' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-242' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='tfo_st' is-struct='yes' visibility='default' size-in-bits='1216' hash='e5830794aea1bfe1' id='type-id-497'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='connect_only' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='connect_addr' type-id='type-id-495' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='connect_addrlen' type-id='type-id-498' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' hash='7451f9a3207df4f1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-499' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-154' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='tls13_ticket_st' is-struct='yes' naming-typedef-id='type-id-465' visibility='default' size-in-bits='3136' hash='5e970c8dea5f70b8' id='type-id-500'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arrival_time' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='creation_time' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lifetime' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='age_add' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nonce' type-id='type-id-501' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='nonce_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='prf' type-id='type-id-374' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='resumption_master_secret' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='ticket' type-id='type-id-327' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ub_result' is-struct='yes' visibility='default' size-in-bits='768' hash='6cd10fe0f7ee5923' id='type-id-502'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qname' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qtype' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='qclass' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-503' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='len' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='canonname' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rcode' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='answer_packet' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='answer_len' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='havedata' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nxdomain' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='secure' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bogus' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='why_bogus' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='was_ratelimited' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='ttl' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='version_entry_st' is-struct='yes' naming-typedef-id='type-id-504' visibility='default' size-in-bits='320' hash='b98d63255444aa86' id='type-id-505'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='age' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='major' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='minor' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport' type-id='type-id-454' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supported' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='supported_revertible' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='explicit_iv' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='extensions' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='selectable_sighash' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='selectable_prf' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='obsolete' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='tls13_sem' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='false_start' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='only_extension' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='post_handshake_auth' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='key_shares' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='multi_ocsp' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='tls_sig_sem' type-id='type-id-209' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='576' is-anonymous='yes' hash='097e2ca0c7db311a' id='type-id-506'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srp_key' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srp_g' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srp_p' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='A' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='B' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='u' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='b' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='a' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x' type-id='type-id-236' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' hash='6be4e0e0b1ae83d3#2' id='type-id-507'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priv' type-id='type-id-508' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resumed_priv' type-id='type-id-508' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='resumed_set' type-id='type-id-209' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-507' size-in-bits='12288' hash='6189f9ce5f4fc87c' id='type-id-464'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-326'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='16640' is-anonymous='yes' hash='93a95c33175df534#3' id='type-id-391'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh_params' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='ecdhx_params' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='dh_params' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='kem_params' type-id='type-id-400' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='4224' is-anonymous='yes' hash='409f6b8c17f5e290#4' id='type-id-509'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='client_Y' type-id='type-id-236' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='4416' is-anonymous='yes' hash='62c7070b1e94b9a2#5' id='type-id-510'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='x' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='y' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='raw' type-id='type-id-327' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='9216' is-anonymous='yes' hash='503b5cfef98925b1#6' id='type-id-511'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh' type-id='type-id-510' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='dh' type-id='type-id-509' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='srp' type-id='type-id-506' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' hash='c93b6c1b8aef86ca#7' id='type-id-395'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='last_result' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='was_rotated' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb' type-id='type-id-512' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='4128' is-anonymous='yes' hash='1867c5fa95382d8a#8' id='type-id-513'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='temp_secret' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='temp_secret_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='e_ckey' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='hs_ckey' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='hs_skey' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='ap_ckey' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='ap_skey' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='ap_expkey' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='ap_rms' type-id='type-id-393' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-335' size-in-bits='1728' id='type-id-514'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-7' id='type-id-515'/>
    <typedef-decl name='__int16_t' type-id='type-id-106' size-in-bits='16' hash='6c2352eccdcd3eea' id='type-id-516'/>
    <typedef-decl name='__off64_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-339'/>
    <typedef-decl name='__off_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-164'/>
    <typedef-decl name='__socklen_t' type-id='type-id-3' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-517'/>
    <typedef-decl name='__ssize_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-518'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-154'/>
    <typedef-decl name='__time_t' type-id='type-id-119' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-499'/>
    <typedef-decl name='__uint16_t' type-id='type-id-207' size-in-bits='16' hash='d7723bb93a30b11d' id='type-id-519'/>
    <typedef-decl name='__uint32_t' type-id='type-id-3' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-141'/>
    <typedef-decl name='__uint64_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-343'/>
    <typedef-decl name='__uint8_t' type-id='type-id-121' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-520'/>
    <typedef-decl name='aead_cipher_decrypt_func' type-id='type-id-521' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-359'/>
    <typedef-decl name='aead_cipher_encrypt_func' type-id='type-id-521' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-358'/>
    <typedef-decl name='api_aead_cipher_hd_st' type-id='type-id-344' size-in-bits='768' id='type-id-522'/>
    <typedef-decl name='auth_cipher_hd_st' type-id='type-id-347' size-in-bits='1472' id='type-id-346'/>
    <typedef-decl name='auth_cred_st' type-id='type-id-349' size-in-bits='192' id='type-id-523'/>
    <typedef-decl name='bye_state_t' type-id='type-id-261' size-in-bits='32' alignment-in-bits='32' hash='b589e94b100498f0' id='type-id-427'/>
    <typedef-decl name='cipher_auth_func' type-id='type-id-524' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-360'/>
    <typedef-decl name='cipher_decrypt_func' type-id='type-id-525' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-357'/>
    <typedef-decl name='cipher_deinit_func' type-id='type-id-54' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-365'/>
    <typedef-decl name='cipher_encrypt_func' type-id='type-id-525' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-356'/>
    <typedef-decl name='cipher_entry_st' type-id='type-id-352' size-in-bits='256' id='type-id-526'/>
    <typedef-decl name='cipher_getiv_func' type-id='type-id-524' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-363'/>
    <typedef-decl name='cipher_hd_st' type-id='type-id-354' size-in-bits='768' id='type-id-345'/>
    <typedef-decl name='cipher_setiv_func' type-id='type-id-524' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-362'/>
    <typedef-decl name='cipher_setkey_func' type-id='type-id-524' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-364'/>
    <typedef-decl name='cipher_tag_func' type-id='type-id-527' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-361'/>
    <typedef-decl name='cipher_type_t' type-id='type-id-263' size-in-bits='32' alignment-in-bits='32' hash='b9bbb6a16754b671' id='type-id-262'/>
    <typedef-decl name='ciphersuite_list_st' type-id='type-id-366' size-in-bits='16448' id='type-id-408'/>
    <typedef-decl name='content_type_t' type-id='type-id-264' size-in-bits='32' alignment-in-bits='32' hash='ab63d1d2c704c2b5' id='type-id-477'/>
