<abi-corpus version='2.3' architecture='elf-amd-x86_64' soname='libgnutls.so.30'>
  <elf-needed>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.5'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libhogweed.so.6'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_dsa_generate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_generate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gnutls13_psk_ext_iter_next_binder' version='GNUTLS_PRIVATE_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='UC_CATEGORY_Nl' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_No' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pd' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pe' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pf' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pi' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Po' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Ps' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Sc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Sk' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Sm' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_So' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Zs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='nettle_sha256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='nettle_sha384' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='nettle_sha512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uninorm_nfc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uninorm_nfkc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='asnprintf.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='basename-lgpl.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dirname-lgpl.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fcntl.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fcntl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fcntl'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gl_linkedhash_list.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <var-decl name='gl_linkedhash_list_implementation' type-id='type-id-7' visibility='default'/>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='abort'>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='glthread/lock.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='64' id='type-id-9'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-10' id='type-id-11'/>
    </array-type-def>
    <typedef-decl name='pthread_rwlockattr_t' type-id='type-id-12' id='type-id-13'/>
    <union-decl name='pthread_rwlockattr_t' size-in-bits='64' naming-typedef-id='type-id-13' visibility='default' id='type-id-12'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-14' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-16'/>
    <qualified-type-def type-id='type-id-16' restrict='yes' id='type-id-17'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <qualified-type-def type-id='type-id-20' restrict='yes' id='type-id-21'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-22'/>
    <function-decl name='pthread_once' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_once'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_init'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_init'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_destroy'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_settype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_settype'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlock_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlock_init'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_init'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_destroy'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_setkind_np' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_setkind_np'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-27'>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hash.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-29'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow_preserve.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_set_array_size.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloca.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='memset_explicit.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='printf-parse.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='read-file.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <qualified-type-def type-id='type-id-4' restrict='yes' id='type-id-30'/>
    <function-decl name='fopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setvbuf'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='ftello' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftello'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ferror'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='stripslash.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='vasnprintf.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='1792' id='type-id-36'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-10' id='type-id-37'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='4928' id='type-id-39'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-10' id='type-id-37'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-40'/>
    <enum-decl name='arg_type' naming-typedef-id='type-id-41' id='type-id-42'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='TYPE_NONE' value='0'/>
      <enumerator name='TYPE_SCHAR' value='1'/>
      <enumerator name='TYPE_UCHAR' value='2'/>
      <enumerator name='TYPE_SHORT' value='3'/>
      <enumerator name='TYPE_USHORT' value='4'/>
      <enumerator name='TYPE_INT' value='5'/>
      <enumerator name='TYPE_UINT' value='6'/>
      <enumerator name='TYPE_LONGINT' value='7'/>
      <enumerator name='TYPE_ULONGINT' value='8'/>
      <enumerator name='TYPE_LONGLONGINT' value='9'/>
      <enumerator name='TYPE_ULONGLONGINT' value='10'/>
      <enumerator name='TYPE_DOUBLE' value='11'/>
      <enumerator name='TYPE_LONGDOUBLE' value='12'/>
      <enumerator name='TYPE_CHAR' value='13'/>
      <enumerator name='TYPE_WIDE_CHAR' value='14'/>
      <enumerator name='TYPE_STRING' value='15'/>
      <enumerator name='TYPE_WIDE_STRING' value='16'/>
      <enumerator name='TYPE_POINTER' value='17'/>
      <enumerator name='TYPE_COUNT_SCHAR_POINTER' value='18'/>
      <enumerator name='TYPE_COUNT_SHORT_POINTER' value='19'/>
      <enumerator name='TYPE_COUNT_INT_POINTER' value='20'/>
      <enumerator name='TYPE_COUNT_LONGINT_POINTER' value='21'/>
      <enumerator name='TYPE_COUNT_LONGLONGINT_POINTER' value='22'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='type-id-44'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-45'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-46'/>
    <class-decl name='argument' size-in-bits='256' is-struct='yes' naming-typedef-id='type-id-35' visibility='default' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-48' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='arguments' size-in-bits='1920' is-struct='yes' naming-typedef-id='type-id-49' visibility='default' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='direct_alloc_arg' type-id='type-id-36' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directive' size-in-bits='704' is-struct='yes' naming-typedef-id='type-id-38' visibility='default' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='width_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='width_arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='precision_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='precision_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='precision_arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conversion' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directives' size-in-bits='5184' is-struct='yes' naming-typedef-id='type-id-53' visibility='default' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_width_length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_precision_length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='direct_alloc_dir' type-id='type-id-39' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arg_type' type-id='type-id-42' id='type-id-41'/>
    <typedef-decl name='argument' type-id='type-id-47' id='type-id-35'/>
    <typedef-decl name='arguments' type-id='type-id-50' id='type-id-49'/>
    <typedef-decl name='char_directive' type-id='type-id-52' id='type-id-38'/>
    <typedef-decl name='char_directives' type-id='type-id-54' id='type-id-53'/>
    <typedef-decl name='wchar_t' type-id='type-id-6' id='type-id-56'/>
    <typedef-decl name='wint_t' type-id='type-id-57' id='type-id-58'/>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-48'>
      <data-member access='public'>
        <var-decl name='a_schar' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uchar' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_short' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ushort' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longint' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulongint' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longlongint' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulonglongint' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_float' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_double' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longdouble' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_char' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_char' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_string' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_string' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_pointer' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_schar_pointer' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_short_pointer' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_pointer' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longint_pointer' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longlongint_pointer' type-id='type-id-68' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-70'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-71'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-64'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-65'/>
    <function-decl name='snprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='AES_KEY' size-in-bits='2080' is-struct='yes' naming-typedef-id='type-id-73' visibility='default' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rd_key' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='rounds' type-id='type-id-76' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AES_KEY' type-id='type-id-74' id='type-id-73'/>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='2048' id='type-id-75'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-10' id='type-id-77'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-78'/>
    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-79'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-80'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-81'/>
    <var-decl name='_gnutls_log_level' type-id='type-id-6' visibility='default'/>
    <var-decl name='gnutls_calloc' type-id='type-id-82' visibility='default'/>
    <var-decl name='gnutls_free' type-id='type-id-83' visibility='default'/>
    <var-decl name='_gnutls_aesni_x86' type-id='type-id-84' visibility='default'/>
    <function-type size-in-bits='64' id='type-id-85'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-87'>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-89'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-90'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-91'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-93'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_ssse3' type-id='type-id-84' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-ccm-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <typedef-decl name='nettle_cipher_func' type-id='type-id-95' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <var-decl name='_gnutls_aes_ccm_x86_aesni' type-id='type-id-84' visibility='default'/>
    <function-decl name='nettle_ccm_encrypt_message' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_ccm_encrypt_message'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_ccm_decrypt_message' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_ccm_decrypt_message'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-95'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-100' size-in-bits='32768' id='type-id-101'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-10' id='type-id-102'/>
    </array-type-def>
    <class-decl name='gcm_ctx' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctr' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth_size' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='data_size' type-id='type-id-104' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gcm_key' size-in-bits='32768' is-struct='yes' visibility='default' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h' type-id='type-id-101' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='padlock_cipher_data' size-in-bits='2336' is-struct='yes' visibility='default' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cword' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ks' type-id='type-id-73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rounds' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dgst' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='align' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='ciphr' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='keygen' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='interm' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='encdec' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='ksize' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='128' id='type-id-110'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-10' id='type-id-111'/>
    </array-type-def>
    <union-decl name='nettle_block16' size-in-bits='128' visibility='default' id='type-id-100'>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='w' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u64' type-id='type-id-110' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-108'>
      <data-member access='public'>
        <var-decl name='pad' type-id='type-id-114' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-109' visibility='default'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-57' size-in-bits='128' id='type-id-114'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-10' id='type-id-115'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='128' id='type-id-113'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-10' id='type-id-111'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-105' const='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-120'/>
    <var-decl name='_gnutls_aes_gcm_padlock' type-id='type-id-84' visibility='default'/>
    <function-decl name='nettle_gcm_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_set_key'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-97'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_set_iv'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_gcm_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_update'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_gcm_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_encrypt'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_gcm_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_decrypt'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_gcm_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_digest'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_x86_aesni' type-id='type-id-84' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul-avx.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='u128' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-121' visibility='default' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hi' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lo' type-id='type-id-104' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u128' type-id='type-id-122' id='type-id-121'/>
    <qualified-type-def type-id='type-id-121' const='yes' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <qualified-type-def type-id='type-id-104' const='yes' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-128'/>
    <var-decl name='_gnutls_aes_gcm_pclmul_avx' type-id='type-id-84' visibility='default'/>
    <function-decl name='nettle_memxor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_memxor'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_pclmul' type-id='type-id-84' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_x86_ssse3' type-id='type-id-84' visibility='default'/>
    <function-decl name='__assert_fail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__assert_fail'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='aes192_ctx' size-in-bits='1664' is-struct='yes' visibility='default' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-130' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='aes256_ctx' size-in-bits='1920' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-132' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='1664' id='type-id-130'>
      <subrange length='52' lower-bound='0' upper-bound='51' type-id='type-id-10' id='type-id-133'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='1920' id='type-id-132'>
      <subrange length='60' lower-bound='0' upper-bound='59' type-id='type-id-10' id='type-id-134'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-136'/>
    <var-decl name='_gnutls_aes_padlock' type-id='type-id-84' visibility='default'/>
    <function-decl name='nettle_aes192_set_encrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes192_set_encrypt_key'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_aes192_set_decrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes192_set_decrypt_key'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_encrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes256_set_encrypt_key'>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_decrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes256_set_decrypt_key'>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-xts-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_xts_x86_aesni' type-id='type-id-84' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='nettle_hash' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context_size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='digest_size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='block_size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init' type-id='type-id-138' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='digest' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha1_ctx' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='count' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='index' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='block' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha256_ctx' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='count' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='index' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha512_ctx' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='count_low' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='count_high' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='index' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='block' type-id='type-id-148' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nettle_hash_digest_func' type-id='type-id-149' id='type-id-150'/>
    <typedef-decl name='nettle_hash_init_func' type-id='type-id-92' id='type-id-151'/>
    <typedef-decl name='nettle_hash_update_func' type-id='type-id-152' id='type-id-153'/>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='160' id='type-id-142'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-10' id='type-id-154'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='256' id='type-id-145'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-10' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='512' id='type-id-147'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-10' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-155' size-in-bits='1024' id='type-id-148'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-10' id='type-id-156'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-137' const='yes' id='type-id-157'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-161'/>
    <var-decl name='gnutls_malloc' type-id='type-id-162' visibility='default'/>
    <var-decl name='_gnutls_hmac_sha_padlock_oneshot' type-id='type-id-163' visibility='default'/>
    <var-decl name='padlock_sha1' type-id='type-id-157' visibility='default'/>
    <var-decl name='padlock_sha224' type-id='type-id-157' visibility='default'/>
    <var-decl name='padlock_sha256' type-id='type-id-157' visibility='default'/>
    <var-decl name='padlock_sha384' type-id='type-id-157' visibility='default'/>
    <var-decl name='padlock_sha512' type-id='type-id-157' visibility='default'/>
    <var-decl name='_gnutls_hmac_sha_padlock' type-id='type-id-163' visibility='default'/>
    <function-decl name='nettle_hmac_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_hmac_set_key'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_hmac_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_hmac_digest'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-152'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-149'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-169'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='x86_sha1' type-id='type-id-157' visibility='default'/>
    <var-decl name='x86_sha224' type-id='type-id-157' visibility='default'/>
    <var-decl name='x86_sha256' type-id='type-id-157' visibility='default'/>
    <var-decl name='x86_sha384' type-id='type-id-157' visibility='default'/>
    <var-decl name='x86_sha512' type-id='type-id-157' visibility='default'/>
    <var-decl name='_gnutls_hmac_sha_x86_ssse3' type-id='type-id-163' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='sha-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_sha_padlock_oneshot' type-id='type-id-170' visibility='default'/>
    <var-decl name='_gnutls_sha_padlock' type-id='type-id-170' visibility='default'/>
    <function-decl name='nettle_sha1_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha1_init'>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha256_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha256_init'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha224_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha224_init'>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha512_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha512_init'>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha384_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha384_init'>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-171'>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='sha-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_sha_x86_ssse3' type-id='type-id-170' visibility='default'/>
    <function-decl name='nettle_sha1_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha1_update'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha1_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha1_digest'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha256_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha256_update'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha256_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha256_digest'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha224_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha224_digest'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha512_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha512_update'>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha512_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha512_digest'>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nettle_sha384_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha384_digest'>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-99'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='x86-common.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='strtol' mangled-name='__isoc23_strtol' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtol'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-175'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='secure_getenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='secure_getenv'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='alert.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_alert_get_name' mangled-name='gnutls_alert_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-176' name='alert'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_strname' mangled-name='gnutls_alert_get_strname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_strname@@GNUTLS_3_4'>
      <parameter type-id='type-id-176' name='alert'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_alert_send' mangled-name='gnutls_alert_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-178' name='level'/>
      <parameter type-id='type-id-176' name='desc'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_error_to_alert' mangled-name='gnutls_error_to_alert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_to_alert@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='err'/>
      <parameter type-id='type-id-5' name='level'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_alert_send_appropriate' mangled-name='gnutls_alert_send_appropriate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send_appropriate@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-6' name='err'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_alert_get' mangled-name='gnutls_alert_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-176'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dcgettext'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-72'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert_types.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <function-decl name='gnutls_certificate_type_get_name' mangled-name='gnutls_certificate_type_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-179' name='type'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get_id' mangled-name='gnutls_certificate_type_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_list' mangled-name='gnutls_certificate_type_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_list@@GNUTLS_3_4'>
      <return type-id='type-id-181'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphers.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <function-decl name='_gnutls_cipher_to_entry' mangled-name='_gnutls_cipher_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_cipher_to_entry@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-86' name='c'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_block_size' mangled-name='gnutls_cipher_get_block_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_block_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_tag_size' mangled-name='gnutls_cipher_get_tag_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_tag_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_iv_size' mangled-name='gnutls_cipher_get_iv_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_iv_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_key_size' mangled-name='gnutls_cipher_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_key_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_name' mangled-name='gnutls_cipher_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_id' mangled-name='gnutls_cipher_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='gnutls_cipher_list' mangled-name='gnutls_cipher_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_list@@GNUTLS_3_4'>
      <return type-id='type-id-183'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphersuites.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-190'/>
    <function-decl name='gnutls_cipher_suite_get_name' mangled-name='gnutls_cipher_suite_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-186' name='kx_algorithm'/>
      <parameter type-id='type-id-86' name='cipher_algorithm'/>
      <parameter type-id='type-id-165' name='mac_algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_info' mangled-name='gnutls_cipher_suite_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_info@@GNUTLS_3_4'>
      <parameter type-id='type-id-2' name='idx'/>
      <parameter type-id='type-id-191' name='cs_id'/>
      <parameter type-id='type-id-187' name='kx'/>
      <parameter type-id='type-id-185' name='cipher'/>
      <parameter type-id='type-id-192' name='mac'/>
      <parameter type-id='type-id-189' name='min_version'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_priority_get_cipher_suite_index' mangled-name='gnutls_priority_get_cipher_suite_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_get_cipher_suite_index@@GNUTLS_3_4'>
      <parameter type-id='type-id-193' name='pcache'/>
      <parameter type-id='type-id-57' name='idx'/>
      <parameter type-id='type-id-194' name='sidx'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ecc.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-196'/>
    <var-decl name='_gnutls_pk_ops' type-id='type-id-197' visibility='default'/>
    <function-decl name='gnutls_ecc_curve_list' mangled-name='gnutls_ecc_curve_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_list@@GNUTLS_3_4'>
      <return type-id='type-id-196'/>
    </function-decl>
    <function-decl name='_gnutls_ecc_curve_is_supported' mangled-name='_gnutls_ecc_curve_is_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_ecc_curve_is_supported@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-198' name='curve'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_ecc_curve' mangled-name='gnutls_oid_to_ecc_curve' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_ecc_curve@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-198'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_id' mangled-name='gnutls_ecc_curve_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-198'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_name' mangled-name='gnutls_ecc_curve_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-198' name='curve'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_oid' mangled-name='gnutls_ecc_curve_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-198' name='curve'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_size' mangled-name='gnutls_ecc_curve_get_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-198' name='curve'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_pk' mangled-name='gnutls_ecc_curve_get_pk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_pk@@GNUTLS_3_4'>
      <parameter type-id='type-id-198' name='curve'/>
      <return type-id='type-id-199'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='groups.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-201'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <var-decl name='gnutls_ffdhe_8192_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_8192_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_8192_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_8192_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_ffdhe_6144_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_6144_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_6144_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_6144_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_ffdhe_4096_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_4096_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_4096_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_4096_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_ffdhe_3072_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_3072_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_3072_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_3072_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_ffdhe_2048_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_2048_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_2048_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_ffdhe_2048_key_bits' type-id='type-id-204' visibility='default'/>
    <function-decl name='gnutls_group_list' mangled-name='gnutls_group_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_list@@GNUTLS_3_6_0'>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='gnutls_group_get_id' mangled-name='gnutls_group_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_id@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='gnutls_group_get_name' mangled-name='gnutls_group_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_name@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-200' name='group'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='kx.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-205'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <var-decl name='rsa_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='dhe_rsa_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='ecdhe_rsa_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='ecdhe_psk_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='ecdhe_ecdsa_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='dhe_dss_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='anon_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='anon_ecdh_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='psk_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='dhe_psk_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='rsa_psk_auth_struct' type-id='type-id-207' visibility='default'/>
    <var-decl name='vko_gost_auth_struct' type-id='type-id-207' visibility='default'/>
    <function-decl name='gnutls_kx_get_name' mangled-name='gnutls_kx_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-186' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_kx_get_id' mangled-name='gnutls_kx_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='gnutls_kx_list' mangled-name='gnutls_kx_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_list@@GNUTLS_3_4'>
      <return type-id='type-id-206'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mac.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-172' const='yes' id='type-id-208'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <qualified-type-def type-id='type-id-165' const='yes' id='type-id-210'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <function-decl name='_gnutls_mac_to_entry' mangled-name='_gnutls_mac_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_mac_to_entry@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-165' name='c'/>
      <return type-id='type-id-212'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_name' mangled-name='gnutls_mac_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-165' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_name' mangled-name='gnutls_digest_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-172' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_id' mangled-name='gnutls_digest_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-172'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_id' mangled-name='gnutls_mac_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-165'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_key_size' mangled-name='gnutls_mac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_key_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-165' name='algorithm'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_nonce_size' mangled-name='gnutls_mac_get_nonce_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_nonce_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-165' name='algorithm'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_mac_list' mangled-name='gnutls_mac_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_list@@GNUTLS_3_4'>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='gnutls_digest_list' mangled-name='gnutls_digest_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_list@@GNUTLS_3_4'>
      <return type-id='type-id-209'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_digest' mangled-name='gnutls_oid_to_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_digest@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-172'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_mac' mangled-name='gnutls_oid_to_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_mac@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-165'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_oid' mangled-name='gnutls_digest_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-172' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='protocols.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-213'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <function-decl name='_gnutls_version_to_entry' mangled-name='_gnutls_version_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_version_to_entry@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-188' name='version'/>
      <return type-id='type-id-215'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_name' mangled-name='gnutls_protocol_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-188' name='version'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_id' mangled-name='gnutls_protocol_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-188'/>
    </function-decl>
    <function-decl name='gnutls_protocol_list' mangled-name='gnutls_protocol_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_list@@GNUTLS_3_4'>
      <return type-id='type-id-214'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='publickey.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_pk_algorithm_get_name' mangled-name='gnutls_pk_algorithm_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_algorithm_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_pk_list' mangled-name='gnutls_pk_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_list@@GNUTLS_3_4'>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_id' mangled-name='gnutls_pk_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-199'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_name' mangled-name='gnutls_pk_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_pk' mangled-name='gnutls_oid_to_pk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_pk@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-199'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_oid' mangled-name='gnutls_pk_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='secparams.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_sec_param_to_pk_bits' mangled-name='gnutls_sec_param_to_pk_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_to_pk_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='algo'/>
      <parameter type-id='type-id-217' name='param'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_sec_param_to_symmetric_bits' mangled-name='gnutls_sec_param_to_symmetric_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_to_symmetric_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-217' name='param'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_sec_param_get_name' mangled-name='gnutls_sec_param_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-217' name='param'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_pk_bits_to_sec_param' mangled-name='gnutls_pk_bits_to_sec_param' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_bits_to_sec_param@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='algo'/>
      <parameter type-id='type-id-57' name='bits'/>
      <return type-id='type-id-217'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sign.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-219'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-220'/>
    <function-decl name='gnutls_sign_get_name' mangled-name='gnutls_sign_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-218' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_sign_is_secure' mangled-name='gnutls_sign_is_secure' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_is_secure@@GNUTLS_3_4'>
      <parameter type-id='type-id-218' name='algorithm'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_sign_is_secure2' mangled-name='gnutls_sign_is_secure2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_is_secure2@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-218' name='algorithm'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_sign_list' mangled-name='gnutls_sign_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_list@@GNUTLS_3_4'>
      <return type-id='type-id-220'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_id' mangled-name='gnutls_sign_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_sign' mangled-name='gnutls_oid_to_sign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_sign@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='gnutls_pk_to_sign' mangled-name='gnutls_pk_to_sign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_to_sign@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='pk'/>
      <parameter type-id='type-id-172' name='hash'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_oid' mangled-name='gnutls_sign_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-218' name='sign'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_hash_algorithm' mangled-name='gnutls_sign_get_hash_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_hash_algorithm@@GNUTLS_3_4'>
      <parameter type-id='type-id-218' name='sign'/>
      <return type-id='type-id-172'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_pk_algorithm' mangled-name='gnutls_sign_get_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_pk_algorithm@@GNUTLS_3_4'>
      <parameter type-id='type-id-218' name='sign'/>
      <return type-id='type-id-199'/>
    </function-decl>
    <function-decl name='gnutls_sign_supports_pk_algorithm' mangled-name='gnutls_sign_supports_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_supports_pk_algorithm@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-218' name='sign'/>
      <parameter type-id='type-id-199' name='pk'/>
      <return type-id='type-id-57'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon_cred.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_anon_client_credentials_st' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_anon_server_credentials_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dh_params' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='deinit_dh_params' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dh_sec_param' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='params_func' type-id='type-id-224' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_anon_client_credentials_t' type-id='type-id-225' id='type-id-226'/>
    <typedef-decl name='gnutls_anon_server_credentials_t' type-id='type-id-227' id='type-id-228'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-230'/>
    <class-decl name='gnutls_x509_privkey_int' size-in-bits='4288' is-struct='yes' visibility='default' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='expanded' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='flags' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='key' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='pin' type-id='type-id-234' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_anon_free_server_credentials' mangled-name='gnutls_anon_free_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-228' name='sc'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_server_credentials' mangled-name='gnutls_anon_allocate_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-230' name='sc'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_anon_free_client_credentials' mangled-name='gnutls_anon_free_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-226' name='sc'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_client_credentials' mangled-name='gnutls_anon_allocate_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-229' name='sc'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_dh_params' mangled-name='gnutls_anon_set_server_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-228' name='res'/>
      <parameter type-id='type-id-223' name='dh_params'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_known_dh_params' mangled-name='gnutls_anon_set_server_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_known_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-228' name='res'/>
      <parameter type-id='type-id-217' name='sec_param'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_params_function' mangled-name='gnutls_anon_set_server_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_params_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-228' name='res'/>
      <parameter type-id='type-id-224' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <var-decl name='_gnutls_mpi_ops' type-id='type-id-235' visibility='default'/>
    <function-type size-in-bits='64' id='type-id-236'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='atfork.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='__register_atfork' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__register_atfork'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='__dso_handle' type-id='type-id-4' visibility='default'/>
    <var-decl name='_gnutls_forkid' type-id='type-id-57' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='auth.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='dh_info_st' size-in-bits='448' is-struct='yes' naming-typedef-id='type-id-239' visibility='default' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret_bits' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prime' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generator' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='public_key' type-id='type-id-241' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dh_info_st' type-id='type-id-240' id='type-id-239'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-242'/>
    <function-decl name='gnutls_credentials_clear' mangled-name='gnutls_credentials_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_clear@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' mangled-name='gnutls_credentials_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-243' name='type'/>
      <parameter type-id='type-id-4' name='cred'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_credentials_get' mangled-name='gnutls_credentials_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-243' name='type'/>
      <parameter type-id='type-id-88' name='cred'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_auth_get_type' mangled-name='gnutls_auth_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='gnutls_auth_server_get_type' mangled-name='gnutls_auth_server_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_server_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='gnutls_auth_client_get_type' mangled-name='gnutls_auth_client_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_client_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-243'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='anon_ecdh.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='cert.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <enum-decl name='encipher_type' id='type-id-244'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='CIPHER_ENCRYPT' value='0'/>
      <enumerator name='CIPHER_SIGN' value='1'/>
      <enumerator name='CIPHER_IGN' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <qualified-type-def type-id='type-id-249' const='yes' id='type-id-251'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp'>
      <return type-id='type-id-3'/>
    </function-decl>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-253'/>
    <var-decl name='_gnutls_pkix1_asn' type-id='type-id-247' visibility='default'/>
    <typedef-decl name='asn1_node_st' type-id='type-id-253' id='type-id-249'/>
    <typedef-decl name='asn1_node' type-id='type-id-250' id='type-id-247'/>
    <typedef-decl name='asn1_node_const' type-id='type-id-252' id='type-id-254'/>
    <function-decl name='asn1_create_element' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_create_element'>
      <parameter type-id='type-id-254'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_delete_structure' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_delete_structure'>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_der_decoding' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_der_decoding'>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_der_decoding_startEnd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_der_decoding_startEnd'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh_common.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-255'/>
  </abi-instr>
  <abi-instr address-size='64' path='dhe.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='dhe_psk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <qualified-type-def type-id='type-id-256' const='yes' id='type-id-257'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
  </abi-instr>
  <abi-instr address-size='64' path='ecdhe.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-259'/>
  </abi-instr>
  <abi-instr address-size='64' path='psk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-260'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-263'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='psk_passwd.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <class-decl name='gnutls_anti_replay_st' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='window' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start_time' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='db_add_func' type-id='type-id-268' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='db_ptr' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_privkey_st' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-270' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pk_algorithm' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-271' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='flags' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pin' type-id='type-id-234' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_supplemental_entry_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='supp_recv_func' type-id='type-id-274' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supp_send_func' type-id='type-id-275' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_x509_crl_int' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crl' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expanded' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rcache' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rcache_idx' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='use_extensions' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='der' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='raw_issuer_dn' type-id='type-id-241' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_x509_crt_int' size-in-bits='1088' is-struct='yes' visibility='default' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cert' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_extensions' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='expanded' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='modified' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flags' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pin' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='raw_dn' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='raw_issuer_dn' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='raw_spki' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='der' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='san' type-id='type-id-278' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ian' type-id='type-id-278' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dn' type-id='type-id-279' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='idn' type-id='type-id-279' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='hello_ext_entry_st' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_struct' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tls_id' type-id='type-id-281' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gid' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='client_parse_point' type-id='type-id-282' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='server_parse_point' type-id='type-id-282' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='validity' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recv_func' type-id='type-id-283' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_func' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='deinit_func' type-id='type-id-285' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pack_func' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unpack_func' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cannot_be_overriden' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-288'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-289'/>
    <function-decl name='__getdelim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__getdelim'>
      <parameter type-id='type-id-175'/>
      <parameter type-id='type-id-290'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-291'/>
    </function-decl>
    <function-decl name='strncmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strchr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-292'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-241'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-293'>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-294'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-296'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-178'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-298'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-300'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-301'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-302'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-303'>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-305'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-306'>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-307'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-309'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-310'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-311'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-312'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-313'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-309'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='rsa.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <class-decl name='gnutls_pkcs11_privkey_st' size-in-bits='3392' is-struct='yes' visibility='default' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk_algorithm' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_ok' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uinfo' type-id='type-id-315' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='url' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sinfo' type-id='type-id-316' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='ref' type-id='type-id-317' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='reauth' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='mutex' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='pin' type-id='type-id-234' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-318'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-319'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-320'/>
    <function-type size-in-bits='64' id='type-id-321'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-323'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-324'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-325'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-326'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-328'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='rsa_psk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-329'/>
  </abi-instr>
  <abi-instr address-size='64' path='srp_kx.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <var-decl name='gnutls_srp_8192_group_prime' type-id='type-id-203' mangled-name='gnutls_srp_8192_group_prime' visibility='default' elf-symbol-id='gnutls_srp_8192_group_prime@@GNUTLS_3_6_2'/>
    <var-decl name='gnutls_srp_8192_group_generator' type-id='type-id-203' mangled-name='gnutls_srp_8192_group_generator' visibility='default' elf-symbol-id='gnutls_srp_8192_group_generator@@GNUTLS_3_6_2'/>
    <var-decl name='gnutls_srp_4096_group_prime' type-id='type-id-203' mangled-name='gnutls_srp_4096_group_prime' visibility='default' elf-symbol-id='gnutls_srp_4096_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_4096_group_generator' type-id='type-id-203' mangled-name='gnutls_srp_4096_group_generator' visibility='default' elf-symbol-id='gnutls_srp_4096_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_prime' type-id='type-id-203' mangled-name='gnutls_srp_3072_group_prime' visibility='default' elf-symbol-id='gnutls_srp_3072_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_generator' type-id='type-id-203' mangled-name='gnutls_srp_3072_group_generator' visibility='default' elf-symbol-id='gnutls_srp_3072_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_prime' type-id='type-id-203' mangled-name='gnutls_srp_2048_group_prime' visibility='default' elf-symbol-id='gnutls_srp_2048_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_generator' type-id='type-id-203' mangled-name='gnutls_srp_2048_group_generator' visibility='default' elf-symbol-id='gnutls_srp_2048_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_prime' type-id='type-id-203' mangled-name='gnutls_srp_1536_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1536_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_generator' type-id='type-id-203' mangled-name='gnutls_srp_1536_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1536_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1024_group_prime' type-id='type-id-203' mangled-name='gnutls_srp_1024_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1024_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1024_group_generator' type-id='type-id-203' mangled-name='gnutls_srp_1024_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1024_group_generator@@GNUTLS_3_4'/>
  </abi-instr>
  <abi-instr address-size='64' path='srp_sb64.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='gnutls_srp_base64_encode' mangled-name='gnutls_srp_base64_encode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode@@GNUTLS_3_4'>
      <parameter type-id='type-id-295' name='data'/>
      <parameter type-id='type-id-72' name='result'/>
      <parameter type-id='type-id-330' name='result_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srp_base64_encode2' mangled-name='gnutls_srp_base64_encode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode2@@GNUTLS_3_4'>
      <parameter type-id='type-id-295' name='data'/>
      <parameter type-id='type-id-262' name='result'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vko_gost.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-333'/>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-335'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-334' id='type-id-331'/>
    <function-decl name='asn1_get_length_der' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_get_length_der'>
      <parameter type-id='type-id-336'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='asn1_length_der' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_length_der'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='auto-verify.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_session_set_verify_cert' mangled-name='gnutls_session_set_verify_cert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-1' name='hostname'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_cert2' mangled-name='gnutls_session_set_verify_cert2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert2@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-337' name='data'/>
      <parameter type-id='type-id-57' name='elements'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_session_get_verify_cert_status' mangled-name='gnutls_session_get_verify_cert_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_verify_cert_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='buffers.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='__compar_fn_t' type-id='type-id-338' id='type-id-339'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-338'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-341'/>
    <function-decl name='gnutls_record_check_pending' mangled-name='gnutls_record_check_pending' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_pending@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_record_check_corked' mangled-name='gnutls_record_check_corked' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_corked@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <var-decl name='gnutls_gettime' type-id='type-id-342' visibility='default'/>
    <function-decl name='qsort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='qsort'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-339'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nanosleep' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nanosleep'>
      <parameter type-id='type-id-343'/>
      <parameter type-id='type-id-344'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-340'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-345'>
      <parameter type-id='type-id-344'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-rawpk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_certificate_set_rawpk_key_mem' mangled-name='gnutls_certificate_set_rawpk_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_mem@@GNUTLS_3_6_6'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-295' name='spki'/>
      <parameter type-id='type-id-295' name='pkey'/>
      <parameter type-id='type-id-347' name='format'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-57' name='key_usage'/>
      <parameter type-id='type-id-348' name='names'/>
      <parameter type-id='type-id-57' name='names_length'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_rawpk_key_file' mangled-name='gnutls_certificate_set_rawpk_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_file@@GNUTLS_3_6_6'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-1' name='rawpkfile'/>
      <parameter type-id='type-id-1' name='privkeyfile'/>
      <parameter type-id='type-id-347' name='format'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-57' name='key_usage'/>
      <parameter type-id='type-id-348' name='names'/>
      <parameter type-id='type-id-57' name='names_length'/>
      <parameter type-id='type-id-57' name='privkey_flags'/>
      <parameter type-id='type-id-57' name='pkcs11_flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-x509.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_pkcs12_int' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-349'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pkcs12' type-id='type-id-350' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expanded' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_pkcs12_t' type-id='type-id-351' id='type-id-352'/>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-353'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-361'/>
    <class-decl name='gnutls_x509_trust_list_st' size-in-bits='704' is-struct='yes' visibility='default' id='type-id-362'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='node' type-id='type-id-363' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x509_rdn_sequence' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='distrusted' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='distrusted_size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='keep_certs' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='keep_certs_size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pkcs11_token' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='issuer_callback' type-id='type-id-365' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='usr_ptr' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem' mangled-name='gnutls_certificate_set_x509_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-295' name='cert'/>
      <parameter type-id='type-id-295' name='key'/>
      <parameter type-id='type-id-347' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem2' mangled-name='gnutls_certificate_set_x509_key_mem2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem2@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-295' name='cert'/>
      <parameter type-id='type-id-295' name='key'/>
      <parameter type-id='type-id-347' name='type'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key' mangled-name='gnutls_certificate_set_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-364' name='cert_list'/>
      <parameter type-id='type-id-6' name='cert_list_size'/>
      <parameter type-id='type-id-366' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_key' mangled-name='gnutls_certificate_get_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-57' name='index'/>
      <parameter type-id='type-id-367' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_crt' mangled-name='gnutls_certificate_get_x509_crt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_crt@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-57' name='index'/>
      <parameter type-id='type-id-368' name='crt_list'/>
      <parameter type-id='type-id-194' name='crt_list_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_trust_list' mangled-name='gnutls_certificate_set_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_trust_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-369' name='tlist'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_trust_list' mangled-name='gnutls_certificate_get_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_trust_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-370' name='tlist'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file' mangled-name='gnutls_certificate_set_x509_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-1' name='certfile'/>
      <parameter type-id='type-id-1' name='keyfile'/>
      <parameter type-id='type-id-347' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file2' mangled-name='gnutls_certificate_set_x509_key_file2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file2@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-1' name='certfile'/>
      <parameter type-id='type-id-1' name='keyfile'/>
      <parameter type-id='type-id-347' name='type'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_mem' mangled-name='gnutls_certificate_set_x509_trust_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-295' name='ca'/>
      <parameter type-id='type-id-347' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust' mangled-name='gnutls_certificate_set_x509_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-364' name='ca_list'/>
      <parameter type-id='type-id-6' name='ca_list_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_file' mangled-name='gnutls_certificate_set_x509_trust_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-1' name='cafile'/>
      <parameter type-id='type-id-347' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_dir' mangled-name='gnutls_certificate_set_x509_trust_dir' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_dir@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-1' name='ca_dir'/>
      <parameter type-id='type-id-347' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_system_trust' mangled-name='gnutls_certificate_set_x509_system_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_system_trust@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='cred'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_mem' mangled-name='gnutls_certificate_set_x509_crl_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-295' name='CRL'/>
      <parameter type-id='type-id-347' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl' mangled-name='gnutls_certificate_set_x509_crl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-358' name='crl_list'/>
      <parameter type-id='type-id-6' name='crl_list_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_file' mangled-name='gnutls_certificate_set_x509_crl_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-1' name='crlfile'/>
      <parameter type-id='type-id-347' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_file' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-1' name='pkcs12file'/>
      <parameter type-id='type-id-347' name='type'/>
      <parameter type-id='type-id-1' name='password'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_mem' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-295' name='p12blob'/>
      <parameter type-id='type-id-347' name='type'/>
      <parameter type-id='type-id-1' name='password'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_crls' mangled-name='gnutls_certificate_free_crls' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_crls@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='sc'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_pin_function' mangled-name='gnutls_certificate_set_pin_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_pin_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-371' name='fn'/>
      <parameter type-id='type-id-4' name='userdata'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='asn1_node_st' type-id='type-id-361' id='type-id-359'/>
    <typedef-decl name='asn1_node' type-id='type-id-360' id='type-id-350'/>
    <function-decl name='memmem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmem'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-372'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='gnutls_x509_trust_list_getissuer_function' type-id='type-id-373' id='type-id-374'/>
    <qualified-type-def type-id='type-id-304' const='yes' id='type-id-355'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-363'/>
    <class-decl name='node_st' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-378'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trusted_cas' type-id='type-id-364' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trusted_ca_size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='named_certs' type-id='type-id-379' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='named_cert_size' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='crls' type-id='type-id-358' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='crl_size' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_certificate_set_key' mangled-name='gnutls_certificate_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-348' name='names'/>
      <parameter type-id='type-id-6' name='names_size'/>
      <parameter type-id='type-id-380' name='pcert_list'/>
      <parameter type-id='type-id-6' name='pcert_list_size'/>
      <parameter type-id='type-id-322' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_keys' mangled-name='gnutls_certificate_free_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_keys@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='sc'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_cas' mangled-name='gnutls_certificate_free_cas' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_cas@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='sc'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_issuer' mangled-name='gnutls_certificate_get_issuer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_issuer@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='sc'/>
      <parameter type-id='type-id-304' name='cert'/>
      <parameter type-id='type-id-364' name='issuer'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_crt_raw' mangled-name='gnutls_certificate_get_crt_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_crt_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='sc'/>
      <parameter type-id='type-id-57' name='idx1'/>
      <parameter type-id='type-id-57' name='idx2'/>
      <parameter type-id='type-id-262' name='cert'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_ca_names' mangled-name='gnutls_certificate_free_ca_names' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_ca_names@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='sc'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_credentials' mangled-name='gnutls_certificate_free_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='sc'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_allocate_credentials' mangled-name='gnutls_certificate_allocate_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_allocate_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-375' name='res'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_server_set_request' mangled-name='gnutls_certificate_server_set_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_server_set_request@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-381' name='req'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function' mangled-name='gnutls_certificate_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-382' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function2' mangled-name='gnutls_certificate_set_retrieve_function2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function2@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-383' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function3' mangled-name='gnutls_certificate_set_retrieve_function3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function3@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-384' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_function' mangled-name='gnutls_certificate_set_verify_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='cred'/>
      <parameter type-id='type-id-385' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_getissuer_function' mangled-name='gnutls_x509_trust_list_set_getissuer_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_getissuer_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-369' name='tlist'/>
      <parameter type-id='type-id-365' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_ptr' mangled-name='gnutls_x509_trust_list_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_ptr@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-369' name='tlist'/>
      <parameter type-id='type-id-4' name='ptr'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_get_ptr' mangled-name='gnutls_x509_trust_list_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_get_ptr@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-369' name='tlist'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_output_function' mangled-name='gnutls_session_set_verify_output_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_output_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-386' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verification_status_print' mangled-name='gnutls_certificate_verification_status_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verification_status_print@@GNUTLS_3_4'>
      <parameter type-id='type-id-57' name='status'/>
      <parameter type-id='type-id-179' name='type'/>
      <parameter type-id='type-id-262' name='out'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_dh_params' mangled-name='gnutls_certificate_set_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-223' name='dh_params'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_known_dh_params' mangled-name='gnutls_certificate_set_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_known_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-217' name='sec_param'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-373'>
      <parameter type-id='type-id-369'/>
      <parameter type-id='type-id-355'/>
      <parameter type-id='type-id-368'/>
      <parameter type-id='type-id-194'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-387'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-388'/>
      <parameter type-id='type-id-389'/>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-390'/>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-391'/>
      <parameter type-id='type-id-194'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-392'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-389'/>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-391'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-393'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-394'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-session.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_ocsp_verify_reason_t' id='type-id-395'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_NOT_FOUND' value='1'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_KEYUSAGE_ERROR' value='2'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_UNTRUSTED_SIGNER' value='4'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_INSECURE_ALGORITHM' value='8'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNATURE_FAILURE' value='16'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_NOT_ACTIVATED' value='32'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_EXPIRED' value='64'/>
    </enum-decl>
    <class-decl name='gnutls_x509_tlsfeatures_st' size-in-bits='1056' is-struct='yes' visibility='default' id='type-id-396'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='feature' type-id='type-id-397' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='size' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_ocsp_resp_const_t' type-id='type-id-398' id='type-id-399'/>
    <typedef-decl name='gnutls_ocsp_resp_t' type-id='type-id-400' id='type-id-401'/>
    <typedef-decl name='gnutls_ocsp_verify_reason_t' type-id='type-id-395' id='type-id-402'/>
    <typedef-decl name='gnutls_x509_tlsfeatures_t' type-id='type-id-403' id='type-id-404'/>
    <array-type-def dimensions='1' type-id='type-id-281' size-in-bits='1024' id='type-id-397'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-10' id='type-id-77'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-405' const='yes' id='type-id-406'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-400'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-403'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-408'/>
    <class-decl name='gnutls_ocsp_resp_int' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-405'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resp' type-id='type-id-409' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response_type_oid' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='basicresp' type-id='type-id-409' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='der' type-id='type-id-241' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_certificate_get_ours' mangled-name='gnutls_certificate_get_ours' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_ours@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-295'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_peers' mangled-name='gnutls_certificate_get_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-194' name='list_size'/>
      <return type-id='type-id-295'/>
    </function-decl>
    <function-decl name='gnutls_certificate_client_get_request_status' mangled-name='gnutls_certificate_client_get_request_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_client_get_request_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_params_function' mangled-name='gnutls_certificate_set_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_params_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-224' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_flags' mangled-name='gnutls_certificate_set_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_flags' mangled-name='gnutls_certificate_set_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_verify_flags' mangled-name='gnutls_certificate_get_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_verify_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_limits' mangled-name='gnutls_certificate_set_verify_limits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_limits@@GNUTLS_3_4'>
      <parameter type-id='type-id-346' name='res'/>
      <parameter type-id='type-id-57' name='max_bits'/>
      <parameter type-id='type-id-57' name='max_depth'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers2' mangled-name='gnutls_certificate_verify_peers2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers2@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-194' name='status'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers3' mangled-name='gnutls_certificate_verify_peers3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers3@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-1' name='hostname'/>
      <parameter type-id='type-id-194' name='status'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers' mangled-name='gnutls_certificate_verify_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-337' name='data'/>
      <parameter type-id='type-id-57' name='elements'/>
      <parameter type-id='type-id-194' name='status'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_expiration_time_peers' mangled-name='gnutls_certificate_expiration_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_expiration_time_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-410'/>
    </function-decl>
    <function-decl name='gnutls_certificate_activation_time_peers' mangled-name='gnutls_certificate_activation_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_activation_time_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-410'/>
    </function-decl>
    <var-decl name='gnutls_time' type-id='type-id-411' visibility='default'/>
    <function-type size-in-bits='64' id='type-id-412'>
      <parameter type-id='type-id-413'/>
      <return type-id='type-id-410'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cipher-cbc.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='cipher.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_rnd_level' id='type-id-414'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_RND_NONCE' value='0'/>
      <enumerator name='GNUTLS_RND_RANDOM' value='1'/>
      <enumerator name='GNUTLS_RND_KEY' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_aead_cipher_hd_t' type-id='type-id-415' id='type-id-416'/>
    <typedef-decl name='gnutls_calloc_function' type-id='type-id-417' id='type-id-82'/>
    <typedef-decl name='gnutls_rnd_level_t' type-id='type-id-414' id='type-id-418'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-417'/>
  </abi-instr>
  <abi-instr address-size='64' path='cipher_int.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_crypto_cipher_st' size-in-bits='768' is-struct='yes' naming-typedef-id='type-id-422' visibility='default' id='type-id-423'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init' type-id='type-id-424' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='setkey' type-id='type-id-425' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='setiv' type-id='type-id-426' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='getiv' type-id='type-id-427' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='encrypt' type-id='type-id-428' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='decrypt' type-id='type-id-429' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='aead_encrypt' type-id='type-id-430' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='aead_decrypt' type-id='type-id-431' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='deinit' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='auth' type-id='type-id-433' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tag' type-id='type-id-434' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='exists' type-id='type-id-435' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_aead_decrypt_func' type-id='type-id-436' id='type-id-431'/>
    <typedef-decl name='gnutls_cipher_aead_encrypt_func' type-id='type-id-436' id='type-id-430'/>
    <typedef-decl name='gnutls_cipher_auth_func' type-id='type-id-437' id='type-id-433'/>
    <typedef-decl name='gnutls_cipher_decrypt_func' type-id='type-id-438' id='type-id-429'/>
    <typedef-decl name='gnutls_cipher_deinit_func' type-id='type-id-439' id='type-id-432'/>
    <typedef-decl name='gnutls_cipher_encrypt_func' type-id='type-id-438' id='type-id-428'/>
    <typedef-decl name='gnutls_cipher_getiv_func' type-id='type-id-437' id='type-id-427'/>
    <typedef-decl name='gnutls_cipher_init_func' type-id='type-id-440' id='type-id-424'/>
    <typedef-decl name='gnutls_cipher_setiv_func' type-id='type-id-437' id='type-id-426'/>
    <typedef-decl name='gnutls_cipher_setkey_func' type-id='type-id-437' id='type-id-425'/>
    <typedef-decl name='gnutls_cipher_tag_func' type-id='type-id-441' id='type-id-434'/>
    <typedef-decl name='gnutls_crypto_cipher_st' type-id='type-id-423' id='type-id-422'/>
    <qualified-type-def type-id='type-id-422' const='yes' id='type-id-84'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-444'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-440'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-446'/>
    <var-decl name='_gnutls_cipher_ops' type-id='type-id-422' visibility='default'/>
    <var-decl name='_gnutls_lib_state' type-id='type-id-57' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='compress.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-1' restrict='yes' id='type-id-29'/>
    <qualified-type-def type-id='type-id-447' const='yes' id='type-id-448'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <qualified-type-def type-id='type-id-4' restrict='yes' id='type-id-450'/>
    <function-decl name='gnutls_compression_get_name' mangled-name='gnutls_compression_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-447' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_compression_get_id' mangled-name='gnutls_compression_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-447'/>
    </function-decl>
    <function-decl name='gnutls_compression_list' mangled-name='gnutls_compression_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_list@@GNUTLS_3_4'>
      <return type-id='type-id-449'/>
    </function-decl>
    <function-decl name='dlopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dlclose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlclose'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dlsym' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlsym'>
      <parameter type-id='type-id-450'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strcasecmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcasecmp'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='constate.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-452'/>
    <function-decl name='gnutls_handshake_set_secret_function' mangled-name='gnutls_handshake_set_secret_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_set_secret_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-453' name='func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <var-decl name='gnutls_mutex_lock' type-id='type-id-454' visibility='default'/>
    <var-decl name='gnutls_mutex_unlock' type-id='type-id-455' visibility='default'/>
    <function-type size-in-bits='64' id='type-id-456'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-api.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='api_cipher_hd_st' size-in-bits='1536' is-struct='yes' visibility='default' id='type-id-457'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-451' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctx_dec' type-id='type-id-451' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_crypto_kdf_st' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-458' visibility='default' id='type-id-459'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hkdf_extract' type-id='type-id-460' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hkdf_expand' type-id='type-id-461' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pbkdf2' type-id='type-id-462' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iov_iter_st' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-463'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iov_offset' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='block' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='block_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='block_offset' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_hd_t' type-id='type-id-464' id='type-id-465'/>
    <typedef-decl name='gnutls_crypto_kdf_st' type-id='type-id-459' id='type-id-458'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-467'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-469'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-470'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-472' size-in-bits='64' id='type-id-460'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-461'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-475'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <pointer-type-def type-id='type-id-480' size-in-bits='64' id='type-id-481'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-480'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-482'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-481' id='type-id-476'/>
    <typedef-decl name='gnutls_hmac_hd_t' type-id='type-id-483' id='type-id-478'/>
    <var-decl name='gnutls_realloc' type-id='type-id-484' visibility='default'/>
    <function-decl name='gnutls_cipher_init' mangled-name='gnutls_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-470' name='handle'/>
      <parameter type-id='type-id-86' name='cipher'/>
      <parameter type-id='type-id-295' name='key'/>
      <parameter type-id='type-id-295' name='iv'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_tag' mangled-name='gnutls_cipher_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_tag@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='tag'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_add_auth' mangled-name='gnutls_cipher_add_auth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_add_auth@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_set_iv' mangled-name='gnutls_cipher_set_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_set_iv@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='iv'/>
      <parameter type-id='type-id-2' name='ivlen'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_gnutls_cipher_get_iv' mangled-name='_gnutls_cipher_get_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_cipher_get_iv@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='iv'/>
      <parameter type-id='type-id-2' name='ivlen'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt' mangled-name='gnutls_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt' mangled-name='gnutls_cipher_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt2' mangled-name='gnutls_cipher_encrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt2@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt2' mangled-name='gnutls_cipher_decrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt2@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt3' mangled-name='gnutls_cipher_encrypt3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt3@@GNUTLS_3_7_7'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-330' name='ctext_len'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt3' mangled-name='gnutls_cipher_decrypt3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt3@@GNUTLS_3_7_7'>
      <parameter type-id='type-id-465' name='handle'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-330' name='ptext_len'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_deinit' mangled-name='gnutls_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-465' name='handle'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hmac_init' mangled-name='gnutls_hmac_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-479' name='dig'/>
      <parameter type-id='type-id-165' name='algorithm'/>
      <parameter type-id='type-id-4' name='key'/>
      <parameter type-id='type-id-2' name='keylen'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hmac_set_nonce' mangled-name='gnutls_hmac_set_nonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_set_nonce@@GNUTLS_3_4'>
      <parameter type-id='type-id-478' name='handle'/>
      <parameter type-id='type-id-4' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hmac' mangled-name='gnutls_hmac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac@@GNUTLS_3_4'>
      <parameter type-id='type-id-478' name='handle'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hmac_output' mangled-name='gnutls_hmac_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_output@@GNUTLS_3_4'>
      <parameter type-id='type-id-478' name='handle'/>
      <parameter type-id='type-id-4' name='digest'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hmac_deinit' mangled-name='gnutls_hmac_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-478' name='handle'/>
      <parameter type-id='type-id-4' name='digest'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_len' mangled-name='gnutls_hmac_get_len' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_len@@GNUTLS_3_4'>
      <parameter type-id='type-id-165' name='algorithm'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_key_size' mangled-name='gnutls_hmac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_key_size@@GNUTLS_3_6_12'>
      <parameter type-id='type-id-165' name='algorithm'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_hmac_fast' mangled-name='gnutls_hmac_fast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_fast@@GNUTLS_3_4'>
      <parameter type-id='type-id-165' name='algorithm'/>
      <parameter type-id='type-id-4' name='key'/>
      <parameter type-id='type-id-2' name='keylen'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <parameter type-id='type-id-4' name='digest'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hmac_copy' mangled-name='gnutls_hmac_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_copy@@GNUTLS_3_6_9'>
      <parameter type-id='type-id-478' name='handle'/>
      <return type-id='type-id-478'/>
    </function-decl>
    <function-decl name='gnutls_hash_init' mangled-name='gnutls_hash_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-477' name='dig'/>
      <parameter type-id='type-id-172' name='algorithm'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hash' mangled-name='gnutls_hash' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash@@GNUTLS_3_4'>
      <parameter type-id='type-id-476' name='handle'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hash_output' mangled-name='gnutls_hash_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_output@@GNUTLS_3_4'>
      <parameter type-id='type-id-476' name='handle'/>
      <parameter type-id='type-id-4' name='digest'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hash_deinit' mangled-name='gnutls_hash_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-476' name='handle'/>
      <parameter type-id='type-id-4' name='digest'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hash_fast' mangled-name='gnutls_hash_fast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_fast@@GNUTLS_3_4'>
      <parameter type-id='type-id-172' name='algorithm'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <parameter type-id='type-id-4' name='digest'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hash_copy' mangled-name='gnutls_hash_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_copy@@GNUTLS_3_6_9'>
      <parameter type-id='type-id-476' name='handle'/>
      <return type-id='type-id-476'/>
    </function-decl>
    <function-decl name='gnutls_hash_squeeze' mangled-name='gnutls_hash_squeeze' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_squeeze@@GNUTLS_3_8_6'>
      <parameter type-id='type-id-476' name='handle'/>
      <parameter type-id='type-id-4' name='output'/>
      <parameter type-id='type-id-2' name='length'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_key_generate' mangled-name='gnutls_key_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_key_generate@@GNUTLS_3_4'>
      <parameter type-id='type-id-262' name='key'/>
      <parameter type-id='type-id-57' name='key_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_init' mangled-name='gnutls_aead_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-469' name='handle'/>
      <parameter type-id='type-id-86' name='cipher'/>
      <parameter type-id='type-id-295' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_set_key' mangled-name='gnutls_aead_cipher_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_set_key@@GNUTLS_3_7_5'>
      <parameter type-id='type-id-416' name='handle'/>
      <parameter type-id='type-id-295' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decrypt' mangled-name='gnutls_aead_cipher_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_decrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-416' name='handle'/>
      <parameter type-id='type-id-4' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <parameter type-id='type-id-4' name='auth'/>
      <parameter type-id='type-id-2' name='auth_len'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-330' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encrypt' mangled-name='gnutls_aead_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-416' name='handle'/>
      <parameter type-id='type-id-4' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <parameter type-id='type-id-4' name='auth'/>
      <parameter type-id='type-id-2' name='auth_len'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <parameter type-id='type-id-4' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-330' name='ctext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv' mangled-name='gnutls_aead_cipher_encryptv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encryptv@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-416' name='handle'/>
      <parameter type-id='type-id-4' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <parameter type-id='type-id-308' name='auth_iov'/>
      <parameter type-id='type-id-6' name='auth_iovcnt'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <parameter type-id='type-id-308' name='iov'/>
      <parameter type-id='type-id-6' name='iovcnt'/>
      <parameter type-id='type-id-4' name='ctext'/>
      <parameter type-id='type-id-330' name='ctext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv2' mangled-name='gnutls_aead_cipher_encryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encryptv2@@GNUTLS_3_6_10'>
      <parameter type-id='type-id-416' name='handle'/>
      <parameter type-id='type-id-4' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <parameter type-id='type-id-308' name='auth_iov'/>
      <parameter type-id='type-id-6' name='auth_iovcnt'/>
      <parameter type-id='type-id-308' name='iov'/>
      <parameter type-id='type-id-6' name='iovcnt'/>
      <parameter type-id='type-id-4' name='tag'/>
      <parameter type-id='type-id-330' name='tag_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decryptv2' mangled-name='gnutls_aead_cipher_decryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_decryptv2@@GNUTLS_3_6_10'>
      <parameter type-id='type-id-416' name='handle'/>
      <parameter type-id='type-id-4' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <parameter type-id='type-id-308' name='auth_iov'/>
      <parameter type-id='type-id-6' name='auth_iovcnt'/>
      <parameter type-id='type-id-308' name='iov'/>
      <parameter type-id='type-id-6' name='iovcnt'/>
      <parameter type-id='type-id-4' name='tag'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_deinit' mangled-name='gnutls_aead_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-416' name='handle'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <var-decl name='_gnutls_kdf_ops' type-id='type-id-458' visibility='default'/>
    <function-decl name='gnutls_hkdf_extract' mangled-name='gnutls_hkdf_extract' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_extract@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-165' name='mac'/>
      <parameter type-id='type-id-295' name='key'/>
      <parameter type-id='type-id-295' name='salt'/>
      <parameter type-id='type-id-4' name='output'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_expand' mangled-name='gnutls_hkdf_expand' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_expand@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-165' name='mac'/>
      <parameter type-id='type-id-295' name='key'/>
      <parameter type-id='type-id-295' name='info'/>
      <parameter type-id='type-id-4' name='output'/>
      <parameter type-id='type-id-2' name='length'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pbkdf2' mangled-name='gnutls_pbkdf2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pbkdf2@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-165' name='mac'/>
      <parameter type-id='type-id-295' name='key'/>
      <parameter type-id='type-id-295' name='salt'/>
      <parameter type-id='type-id-57' name='iter_count'/>
      <parameter type-id='type-id-4' name='output'/>
      <parameter type-id='type-id-2' name='length'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-471'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-472'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-473'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-485'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-backend.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <var-decl name='crypto_cipher_prio' type-id='type-id-6' visibility='default'/>
    <function-decl name='gnutls_crypto_register_cipher' mangled-name='gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_cipher@@GNUTLS_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-424' name='init'/>
      <parameter type-id='type-id-425' name='setkey'/>
      <parameter type-id='type-id-426' name='setiv'/>
      <parameter type-id='type-id-428' name='encrypt'/>
      <parameter type-id='type-id-429' name='decrypt'/>
      <parameter type-id='type-id-432' name='deinit'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_crypto_register_cipher' mangled-name='_gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_crypto_register_cipher@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-424' name='init'/>
      <parameter type-id='type-id-425' name='setkey'/>
      <parameter type-id='type-id-426' name='setiv'/>
      <parameter type-id='type-id-428' name='encrypt'/>
      <parameter type-id='type-id-429' name='decrypt'/>
      <parameter type-id='type-id-432' name='deinit'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_aead_cipher' mangled-name='gnutls_crypto_register_aead_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_aead_cipher@@GNUTLS_3_4'>
      <parameter type-id='type-id-86' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-424' name='init'/>
      <parameter type-id='type-id-425' name='setkey'/>
      <parameter type-id='type-id-430' name='aead_encrypt'/>
      <parameter type-id='type-id-431' name='aead_decrypt'/>
      <parameter type-id='type-id-432' name='deinit'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_mac' mangled-name='gnutls_crypto_register_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_mac@@GNUTLS_3_4'>
      <parameter type-id='type-id-165' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-486' name='init'/>
      <parameter type-id='type-id-487' name='setkey'/>
      <parameter type-id='type-id-488' name='setnonce'/>
      <parameter type-id='type-id-489' name='hash'/>
      <parameter type-id='type-id-490' name='output'/>
      <parameter type-id='type-id-491' name='deinit'/>
      <parameter type-id='type-id-492' name='hash_fast'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_digest' mangled-name='gnutls_crypto_register_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_digest@@GNUTLS_3_4'>
      <parameter type-id='type-id-172' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-493' name='init'/>
      <parameter type-id='type-id-494' name='hash'/>
      <parameter type-id='type-id-495' name='output'/>
      <parameter type-id='type-id-496' name='deinit'/>
      <parameter type-id='type-id-497' name='hash_fast'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='crypto_mac_prio' type-id='type-id-6' visibility='default'/>
    <var-decl name='crypto_digest_prio' type-id='type-id-6' visibility='default'/>
    <var-decl name='crypto_rnd_prio' type-id='type-id-6' visibility='default'/>
    <var-decl name='_gnutls_rnd_ops' type-id='type-id-498' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests-pk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <class-decl name='gnutls_pubkey_st' size-in-bits='4288' is-struct='yes' visibility='default' id='type-id-501'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='params' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='key_usage' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='pin' type-id='type-id-234' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-502'/>
    <function-decl name='gnutls_pk_self_test' mangled-name='gnutls_pk_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-57' name='flags'/>
      <parameter type-id='type-id-199' name='pk'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-465' const='yes' id='type-id-503'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-507'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-511'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-508'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-510'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-509' id='type-id-504'/>
    <typedef-decl name='gnutls_hmac_hd_t' type-id='type-id-511' id='type-id-506'/>
    <function-decl name='gnutls_cipher_self_test' mangled-name='gnutls_cipher_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-57' name='flags'/>
      <parameter type-id='type-id-86' name='cipher'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_mac_self_test' mangled-name='gnutls_mac_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-57' name='flags'/>
      <parameter type-id='type-id-165' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_digest_self_test' mangled-name='gnutls_digest_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-57' name='flags'/>
      <parameter type-id='type-id-172' name='digest'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_self_test' mangled-name='gnutls_hkdf_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-57' name='flags'/>
      <parameter type-id='type-id-165' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pbkdf2_self_test' mangled-name='gnutls_pbkdf2_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pbkdf2_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-57' name='flags'/>
      <parameter type-id='type-id-165' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_tlsprf_self_test' mangled-name='gnutls_tlsprf_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_tlsprf_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-57' name='flags'/>
      <parameter type-id='type-id-165' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='datum.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='db.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_db_set_retrieve_function' mangled-name='gnutls_db_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_retrieve_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-512' name='retr_func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_db_set_remove_function' mangled-name='gnutls_db_set_remove_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_remove_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-513' name='rem_func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_db_set_store_function' mangled-name='gnutls_db_set_store_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_store_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-514' name='store_func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_db_set_ptr' mangled-name='gnutls_db_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-4' name='ptr'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_db_get_ptr' mangled-name='gnutls_db_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_db_set_cache_expiration' mangled-name='gnutls_db_set_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_cache_expiration@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-6' name='seconds'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_db_get_default_cache_expiration' mangled-name='gnutls_db_get_default_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_default_cache_expiration@@GNUTLS_3_4'>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry' mangled-name='gnutls_db_check_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-241' name='session_entry'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_time' mangled-name='gnutls_db_check_entry_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_time@@GNUTLS_3_4'>
      <parameter type-id='type-id-262' name='entry'/>
      <return type-id='type-id-410'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_expire_time' mangled-name='gnutls_db_check_entry_expire_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_expire_time@@GNUTLS_3_6_5'>
      <parameter type-id='type-id-262' name='entry'/>
      <return type-id='type-id-410'/>
    </function-decl>
    <function-decl name='gnutls_db_remove_session' mangled-name='gnutls_db_remove_session' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_remove_session@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <var-decl name='_gnutls_global_version' type-id='type-id-57' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='debug.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_handshake_description_get_name' mangled-name='gnutls_handshake_description_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_description_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-299' name='type'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh-primes.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <var-decl name='gnutls_modp_8192_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_8192_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_8192_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_8192_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_modp_6144_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_6144_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_6144_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_6144_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_modp_4096_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_4096_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_4096_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_4096_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_modp_3072_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_3072_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_3072_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_3072_key_bits' type-id='type-id-204' visibility='default'/>
    <var-decl name='gnutls_modp_2048_group_prime' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_2048_group_q' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_2048_group_generator' type-id='type-id-203' visibility='default'/>
    <var-decl name='gnutls_modp_2048_key_bits' type-id='type-id-204' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='dh-session.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-515'/>
    <function-decl name='gnutls_dh_set_prime_bits' mangled-name='gnutls_dh_set_prime_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_set_prime_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='bits'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_group' mangled-name='gnutls_dh_get_group' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_group@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-262' name='raw_gen'/>
      <parameter type-id='type-id-262' name='raw_prime'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_pubkey' mangled-name='gnutls_dh_get_pubkey' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_pubkey@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-262' name='raw_key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_secret_bits' mangled-name='gnutls_dh_get_secret_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_secret_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_prime_bits' mangled-name='gnutls_dh_get_prime_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_prime_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_peers_public_bits' mangled-name='gnutls_dh_get_peers_public_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_peers_public_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_direction_t' naming-typedef-id='type-id-516' id='type-id-517'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_IMPORT' value='0'/>
      <enumerator name='GNUTLS_EXPORT' value='1'/>
    </enum-decl>
    <enum-decl name='gnutls_x509_crt_fmt_t' naming-typedef-id='type-id-347' id='type-id-518'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <class-decl name='gnutls_crypto_pk' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-519'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encrypt' type-id='type-id-520' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='decrypt' type-id='type-id-520' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='decrypt2' type-id='type-id-521' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sign' type-id='type-id-522' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='verify' type-id='type-id-523' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='verify_priv_params' type-id='type-id-524' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='verify_pub_params' type-id='type-id-524' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='generate_keys' type-id='type-id-525' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='generate_params' type-id='type-id-526' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pk_fixup_private_params' type-id='type-id-527' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='derive' type-id='type-id-528' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curve_exists' type-id='type-id-529' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pk_exists' type-id='type-id-530' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='sign_exists' type-id='type-id-531' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_crypto_pk_st' type-id='type-id-519' id='type-id-197'/>
    <typedef-decl name='gnutls_direction_t' type-id='type-id-517' id='type-id-516'/>
    <typedef-decl name='gnutls_x509_crt_fmt_t' type-id='type-id-518' id='type-id-347'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-532'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <qualified-type-def type-id='type-id-534' const='yes' id='type-id-535'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-537'/>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-529'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-530'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' id='type-id-523'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-521'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' id='type-id-524'/>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' id='type-id-520'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-522'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-528'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-527'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-526'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-531'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-551'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-553'/>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-554'/>
    <pointer-type-def type-id='type-id-554' size-in-bits='64' id='type-id-555'/>
    <qualified-type-def type-id='type-id-556' const='yes' id='type-id-557'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-558'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-559'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-560'/>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-556'/>
    <function-decl name='gnutls_dh_params_import_raw' mangled-name='gnutls_dh_params_import_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='dh_params'/>
      <parameter type-id='type-id-295' name='prime'/>
      <parameter type-id='type-id-295' name='generator'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_dsa' mangled-name='gnutls_dh_params_import_dsa' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_dsa@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='dh_params'/>
      <parameter type-id='type-id-366' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw2' mangled-name='gnutls_dh_params_import_raw2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw2@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='dh_params'/>
      <parameter type-id='type-id-295' name='prime'/>
      <parameter type-id='type-id-295' name='generator'/>
      <parameter type-id='type-id-57' name='key_bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw3' mangled-name='gnutls_dh_params_import_raw3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw3@@GNUTLS_3_6_8'>
      <parameter type-id='type-id-223' name='dh_params'/>
      <parameter type-id='type-id-295' name='prime'/>
      <parameter type-id='type-id-295' name='q'/>
      <parameter type-id='type-id-295' name='generator'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_init' mangled-name='gnutls_dh_params_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-537' name='dh_params'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_deinit' mangled-name='gnutls_dh_params_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='dh_params'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_cpy' mangled-name='gnutls_dh_params_cpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_cpy@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='dst'/>
      <parameter type-id='type-id-223' name='src'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_generate2' mangled-name='gnutls_dh_params_generate2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_generate2@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='dparams'/>
      <parameter type-id='type-id-57' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_pkcs3' mangled-name='gnutls_dh_params_import_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='params'/>
      <parameter type-id='type-id-295' name='pkcs3_params'/>
      <parameter type-id='type-id-347' name='format'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export_pkcs3' mangled-name='gnutls_dh_params_export_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='params'/>
      <parameter type-id='type-id-347' name='format'/>
      <parameter type-id='type-id-191' name='params_data'/>
      <parameter type-id='type-id-330' name='params_data_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export2_pkcs3' mangled-name='gnutls_dh_params_export2_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export2_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='params'/>
      <parameter type-id='type-id-347' name='format'/>
      <parameter type-id='type-id-262' name='out'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export_raw' mangled-name='gnutls_dh_params_export_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-223' name='params'/>
      <parameter type-id='type-id-262' name='prime'/>
      <parameter type-id='type-id-262' name='generator'/>
      <parameter type-id='type-id-194' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='_gnutls_gnutls_asn' type-id='type-id-550' visibility='default'/>
    <typedef-decl name='asn1_node_st' type-id='type-id-558' id='type-id-552'/>
    <typedef-decl name='asn1_node' type-id='type-id-553' id='type-id-550'/>
    <typedef-decl name='asn1_node_const' type-id='type-id-555' id='type-id-561'/>
    <function-decl name='asn1_write_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_write_value'>
      <parameter type-id='type-id-550'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-538'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-539'>
      <parameter type-id='type-id-199'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-540'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-533'/>
      <parameter type-id='type-id-536'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-541'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-533'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-542'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-533'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-543'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-533'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-544'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-533'/>
      <parameter type-id='type-id-536'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-545'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-533'/>
      <parameter type-id='type-id-533'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-546'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-516'/>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-547'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-548'>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-549'>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dtls-sw.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='dtls.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_dtls_prestate_st' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-562' visibility='default' id='type-id-563'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_seq' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hsk_read_seq' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hsk_write_seq' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_dtls_prestate_st' type-id='type-id-563' id='type-id-562'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-564'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-565'/>
    <function-decl name='gnutls_dtls_set_timeouts' mangled-name='gnutls_dtls_set_timeouts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_timeouts@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='retrans_timeout'/>
      <parameter type-id='type-id-57' name='total_timeout'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_mtu' mangled-name='gnutls_dtls_set_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_mtu@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='mtu'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_gnutls_record_overhead' mangled-name='_gnutls_record_overhead' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_record_overhead@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-215' name='ver'/>
      <parameter type-id='type-id-184' name='cipher'/>
      <parameter type-id='type-id-212' name='mac'/>
      <parameter type-id='type-id-57' name='max'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_est_record_overhead_size' mangled-name='gnutls_est_record_overhead_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_est_record_overhead_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-188' name='version'/>
      <parameter type-id='type-id-86' name='cipher'/>
      <parameter type-id='type-id-165' name='mac'/>
      <parameter type-id='type-id-447' name='comp'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_record_overhead_size' mangled-name='gnutls_record_overhead_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_overhead_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_data_mtu' mangled-name='gnutls_dtls_get_data_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_get_data_mtu@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_data_mtu' mangled-name='gnutls_dtls_set_data_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_data_mtu@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='mtu'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_mtu' mangled-name='gnutls_dtls_get_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_get_mtu@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_timeout' mangled-name='gnutls_dtls_get_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_get_timeout@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_dtls_cookie_send' mangled-name='gnutls_dtls_cookie_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_cookie_send@@GNUTLS_3_4'>
      <parameter type-id='type-id-262' name='key'/>
      <parameter type-id='type-id-4' name='client_data'/>
      <parameter type-id='type-id-2' name='client_data_size'/>
      <parameter type-id='type-id-564' name='prestate'/>
      <parameter type-id='type-id-565' name='ptr'/>
      <parameter type-id='type-id-566' name='push_func'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dtls_cookie_verify' mangled-name='gnutls_dtls_cookie_verify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_cookie_verify@@GNUTLS_3_4'>
      <parameter type-id='type-id-262' name='key'/>
      <parameter type-id='type-id-4' name='client_data'/>
      <parameter type-id='type-id-2' name='client_data_size'/>
      <parameter type-id='type-id-4' name='_msg'/>
      <parameter type-id='type-id-2' name='msg_size'/>
      <parameter type-id='type-id-564' name='prestate'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dtls_prestate_set' mangled-name='gnutls_dtls_prestate_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_prestate_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-564' name='prestate'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_record_get_discarded' mangled-name='gnutls_record_get_discarded' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_get_discarded@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ecc.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-567'/>
  </abi-instr>
  <abi-instr address-size='64' path='errors.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='8' id='type-id-568'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-10' id='type-id-569'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='160' id='type-id-570'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-10' id='type-id-571'/>
    </array-type-def>
    <enum-decl name='gnutls_bigint_format_t' naming-typedef-id='type-id-572' id='type-id-573'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_MPI_FORMAT_USG' value='0'/>
      <enumerator name='GNUTLS_MPI_FORMAT_STD' value='1'/>
      <enumerator name='GNUTLS_MPI_FORMAT_ULE' value='2'/>
    </enum-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-59'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-574'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-575' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-576' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-568' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-577' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-578' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-579' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-580' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-576' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-570' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-581'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_crypto_bigint' size-in-bits='1600' is-struct='yes' visibility='default' id='type-id-582'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bigint_init' type-id='type-id-583' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bigint_init_multi' type-id='type-id-584' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bigint_release' type-id='type-id-439' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bigint_clear' type-id='type-id-439' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bigint_cmp' type-id='type-id-585' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bigint_cmp_ui' type-id='type-id-586' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bigint_modm' type-id='type-id-587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bigint_set' type-id='type-id-588' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bigint_copy' type-id='type-id-589' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bigint_set_ui' type-id='type-id-590' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bigint_get_nbits' type-id='type-id-591' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bigint_powm' type-id='type-id-592' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bigint_addm' type-id='type-id-592' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bigint_subm' type-id='type-id-592' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bigint_mulm' type-id='type-id-592' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='bigint_add' type-id='type-id-587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bigint_sub' type-id='type-id-587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='bigint_mul' type-id='type-id-587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bigint_add_ui' type-id='type-id-593' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='bigint_sub_ui' type-id='type-id-593' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='bigint_mul_ui' type-id='type-id-593' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bigint_div' type-id='type-id-587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='bigint_prime_check' type-id='type-id-594' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='bigint_scan' type-id='type-id-595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='bigint_print' type-id='type-id-596' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-574' id='type-id-597'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-3' id='type-id-598'/>
    <typedef-decl name='__off64_t' type-id='type-id-14' id='type-id-578'/>
    <typedef-decl name='gnutls_audit_log_func' type-id='type-id-599' id='type-id-600'/>
    <typedef-decl name='gnutls_bigint_format_t' type-id='type-id-573' id='type-id-572'/>
    <typedef-decl name='gnutls_crypto_bigint_st' type-id='type-id-582' id='type-id-235'/>
    <typedef-decl name='gnutls_log_func' type-id='type-id-601' id='type-id-602'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-31'/>
    <qualified-type-def type-id='type-id-31' restrict='yes' id='type-id-28'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-576'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-603'/>
    <pointer-type-def type-id='type-id-604' size-in-bits='64' id='type-id-589'/>
    <pointer-type-def type-id='type-id-605' size-in-bits='64' id='type-id-606'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-261'/>
    <qualified-type-def type-id='type-id-261' restrict='yes' id='type-id-175'/>
    <pointer-type-def type-id='type-id-607' size-in-bits='64' id='type-id-583'/>
    <pointer-type-def type-id='type-id-608' size-in-bits='64' id='type-id-584'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-588'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-587'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' id='type-id-592'/>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' id='type-id-593'/>
    <pointer-type-def type-id='type-id-613' size-in-bits='64' id='type-id-590'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-595'/>
    <pointer-type-def type-id='type-id-615' size-in-bits='64' id='type-id-594'/>
    <pointer-type-def type-id='type-id-616' size-in-bits='64' id='type-id-585'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-586'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-596'/>
    <pointer-type-def type-id='type-id-619' size-in-bits='64' id='type-id-591'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-599'/>
    <pointer-type-def type-id='type-id-621' size-in-bits='64' id='type-id-601'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-579'/>
    <pointer-type-def type-id='type-id-598' size-in-bits='64' id='type-id-577'/>
    <pointer-type-def type-id='type-id-623' size-in-bits='64' id='type-id-575'/>
    <pointer-type-def type-id='type-id-624' size-in-bits='64' id='type-id-580'/>
    <qualified-type-def type-id='type-id-605' const='yes' id='type-id-625'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-622'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-623'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-624'/>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-605'/>
    <function-decl name='gnutls_error_is_fatal' mangled-name='gnutls_error_is_fatal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_is_fatal@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='error'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_perror' mangled-name='gnutls_perror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_perror@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='error'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_strerror' mangled-name='gnutls_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='error'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_strerror_name' mangled-name='gnutls_strerror_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='error'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_log' mangled-name='_gnutls_mpi_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_mpi_log@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-1' name='prefix'/>
      <parameter type-id='type-id-605' name='a'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_gnutls_log' mangled-name='_gnutls_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_log@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-6' name='level'/>
      <parameter type-id='type-id-1' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <var-decl name='_gnutls_log_func' type-id='type-id-602' visibility='default'/>
    <var-decl name='_gnutls_audit_log_func' type-id='type-id-600' visibility='default'/>
    <var-decl name='stderr' type-id='type-id-31' visibility='default' elf-symbol-id='stderr'/>
    <function-decl name='vasprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf'>
      <parameter type-id='type-id-175'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-603'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-607'>
      <parameter type-id='type-id-606'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-608'>
      <parameter type-id='type-id-606'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-615'>
      <parameter type-id='type-id-625'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-616'>
      <parameter type-id='type-id-625'/>
      <parameter type-id='type-id-625'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-617'>
      <parameter type-id='type-id-625'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-618'>
      <parameter type-id='type-id-625'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-572'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-609'>
      <parameter type-id='type-id-605'/>
      <parameter type-id='type-id-625'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-610'>
      <parameter type-id='type-id-605'/>
      <parameter type-id='type-id-625'/>
      <parameter type-id='type-id-625'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-611'>
      <parameter type-id='type-id-605'/>
      <parameter type-id='type-id-625'/>
      <parameter type-id='type-id-625'/>
      <parameter type-id='type-id-625'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-612'>
      <parameter type-id='type-id-605'/>
      <parameter type-id='type-id-625'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-613'>
      <parameter type-id='type-id-605'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-614'>
      <parameter type-id='type-id-605'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-572'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-619'>
      <parameter type-id='type-id-625'/>
      <return type-id='type-id-57'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-620'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-621'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-604'>
      <parameter type-id='type-id-625'/>
      <return type-id='type-id-605'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='alpn.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_alpn' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-627'/>
    <function-decl name='gnutls_alpn_get_selected_protocol' mangled-name='gnutls_alpn_get_selected_protocol' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alpn_get_selected_protocol@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-262' name='protocol'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_alpn_set_protocols' mangled-name='gnutls_alpn_set_protocols' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alpn_set_protocols@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-295' name='protocols'/>
      <parameter type-id='type-id-57' name='protocols_size'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='client_cert_type.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_client_cert_type' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-628'/>
  </abi-instr>
  <abi-instr address-size='64' path='compress_certificate.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_compress_certificate' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-629'/>
    <function-decl name='gnutls_compress_certificate_get_selected_method' mangled-name='gnutls_compress_certificate_get_selected_method' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compress_certificate_get_selected_method@@GNUTLS_3_7_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-447'/>
    </function-decl>
    <function-decl name='gnutls_compress_certificate_set_methods' mangled-name='gnutls_compress_certificate_set_methods' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compress_certificate_set_methods@@GNUTLS_3_7_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-449' name='methods'/>
      <parameter type-id='type-id-2' name='methods_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cookie.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_cookie' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-630'/>
  </abi-instr>
  <abi-instr address-size='64' path='dumbfw.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_dumbfw' type-id='type-id-626' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='early_data.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_early_data' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-631'/>
    <function-decl name='gnutls_record_get_max_early_data_size' mangled-name='gnutls_record_get_max_early_data_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_get_max_early_data_size@@GNUTLS_3_6_5'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_record_set_max_early_data_size' mangled-name='gnutls_record_set_max_early_data_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_set_max_early_data_size@@GNUTLS_3_6_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-2' name='size'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ec_point_formats.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_supported_ec_point_formats' type-id='type-id-626' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='etm.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_etm' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-632'/>
    <function-decl name='gnutls_session_etm_status' mangled-name='gnutls_session_etm_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_etm_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ext_master_secret.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_ext_master_secret' type-id='type-id-626' visibility='default'/>
    <function-decl name='gnutls_session_ext_master_secret_status' mangled-name='gnutls_session_ext_master_secret_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ext_master_secret_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='heartbeat.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <function-decl name='gnutls_heartbeat_enable' mangled-name='gnutls_heartbeat_enable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_enable@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='type'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_allowed' mangled-name='gnutls_heartbeat_allowed' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_allowed@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='type'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_ping' mangled-name='gnutls_heartbeat_ping' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_ping@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-2' name='data_size'/>
      <parameter type-id='type-id-57' name='max_tries'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_pong' mangled-name='gnutls_heartbeat_pong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_pong@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_get_timeout' mangled-name='gnutls_heartbeat_get_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_get_timeout@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_set_timeouts' mangled-name='gnutls_heartbeat_set_timeouts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_set_timeouts@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-57' name='retrans_timeout'/>
      <parameter type-id='type-id-57' name='total_timeout'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='key_share.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-633'/>
  </abi-instr>
  <abi-instr address-size='64' path='max_record.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_max_record_size' type-id='type-id-626' visibility='default'/>
    <function-decl name='gnutls_record_get_max_size' mangled-name='gnutls_record_get_max_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_get_max_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_record_set_max_size' mangled-name='gnutls_record_set_max_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_set_max_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-2' name='size'/>
      <return type-id='type-id-309'/>
    </function-decl>
    <function-decl name='gnutls_record_set_max_recv_size' mangled-name='gnutls_record_set_max_recv_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_set_max_recv_size@@GNUTLS_3_6_8'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-2' name='size'/>
      <return type-id='type-id-309'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='post_handshake.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_post_handshake' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-634'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-635'/>
  </abi-instr>
  <abi-instr address-size='64' path='pre_shared_key.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <pointer-type-def type-id='type-id-636' size-in-bits='64' id='type-id-637'/>
    <typedef-decl name='bigint_t' type-id='type-id-4' id='type-id-638'/>
    <var-decl name='ext_mod_pre_shared_key' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-639'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-640'/>
    <function-decl name='gnutls_psk_format_imported_identity' mangled-name='gnutls_psk_format_imported_identity' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_psk_format_imported_identity@@GNUTLS_3_8_1'>
      <parameter type-id='type-id-295' name='identity'/>
      <parameter type-id='type-id-295' name='context'/>
      <parameter type-id='type-id-188' name='version'/>
      <parameter type-id='type-id-172' name='hash'/>
      <parameter type-id='type-id-262' name='imported_identity'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-641'>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='psk_ke_modes.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_psk_ke_modes' type-id='type-id-626' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='record_size_limit.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_record_size_limit' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-642'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-643'/>
  </abi-instr>
  <abi-instr address-size='64' path='safe_renegotiation.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_sr' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-644'/>
    <function-decl name='gnutls_safe_renegotiation_status' mangled-name='gnutls_safe_renegotiation_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_safe_renegotiation_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-57'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='server_cert_type.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_server_cert_type' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-645'/>
  </abi-instr>
  <abi-instr address-size='64' path='server_name.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <enum-decl name='gnutls_server_name_type_t' naming-typedef-id='type-id-646' id='type-id-647'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_NAME_DNS' value='1'/>
    </enum-decl>
    <typedef-decl name='gnutls_server_name_type_t' type-id='type-id-647' id='type-id-646'/>
    <var-decl name='ext_mod_server_name' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-648'/>
    <function-decl name='gnutls_server_name_get' mangled-name='gnutls_server_name_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_server_name_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-4' name='data'/>
      <parameter type-id='type-id-330' name='data_length'/>
      <parameter type-id='type-id-194' name='type'/>
      <parameter type-id='type-id-57' name='indx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_server_name_set_raw' mangled-name='_gnutls_server_name_set_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_server_name_set_raw@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-646' name='type'/>
      <parameter type-id='type-id-4' name='name'/>
      <parameter type-id='type-id-2' name='name_length'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_server_name_set' mangled-name='gnutls_server_name_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_server_name_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-646' name='type'/>
      <parameter type-id='type-id-4' name='name'/>
      <parameter type-id='type-id-2' name='name_length'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='session_ticket.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_session_ticket' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-649'/>
    <function-decl name='gnutls_session_ticket_key_generate' mangled-name='gnutls_session_ticket_key_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ticket_key_generate@@GNUTLS_3_4'>
      <parameter type-id='type-id-262' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_session_ticket_enable_client' mangled-name='gnutls_session_ticket_enable_client' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ticket_enable_client@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_session_ticket_enable_server' mangled-name='gnutls_session_ticket_enable_server' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ticket_enable_server@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-295' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_session_ticket_disable_server' mangled-name='_gnutls_session_ticket_disable_server' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_session_ticket_disable_server@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='signature.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_sig' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-4' id='type-id-650'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-651'/>
    <function-decl name='gnutls_sign_algorithm_get_requested' mangled-name='gnutls_sign_algorithm_get_requested' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_algorithm_get_requested@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-2' name='indx'/>
      <parameter type-id='type-id-652' name='algo'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_sign_algorithm_get' mangled-name='gnutls_sign_algorithm_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_algorithm_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_sign_algorithm_get_client' mangled-name='gnutls_sign_algorithm_get_client' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_algorithm_get_client@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='srtp.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <enum-decl name='gnutls_srtp_profile_t' naming-typedef-id='type-id-653' id='type-id-654'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_SRTP_AES128_CM_HMAC_SHA1_80' value='1'/>
      <enumerator name='GNUTLS_SRTP_AES128_CM_HMAC_SHA1_32' value='2'/>
      <enumerator name='GNUTLS_SRTP_NULL_HMAC_SHA1_80' value='5'/>
      <enumerator name='GNUTLS_SRTP_NULL_HMAC_SHA1_32' value='6'/>
      <enumerator name='GNUTLS_SRTP_AEAD_AES_128_GCM' value='7'/>
      <enumerator name='GNUTLS_SRTP_AEAD_AES_256_GCM' value='8'/>
    </enum-decl>
    <typedef-decl name='gnutls_srtp_profile_t' type-id='type-id-654' id='type-id-653'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-655'/>
    <var-decl name='ext_mod_srtp' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-656'/>
    <function-decl name='gnutls_srtp_get_profile_id' mangled-name='gnutls_srtp_get_profile_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_profile_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='name'/>
      <parameter type-id='type-id-655' name='profile'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_profile_name' mangled-name='gnutls_srtp_get_profile_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_profile_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-653' name='profile'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_selected_profile' mangled-name='gnutls_srtp_get_selected_profile' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_selected_profile@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-655' name='profile'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_mki' mangled-name='gnutls_srtp_get_mki' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_mki@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-262' name='mki'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_set_mki' mangled-name='gnutls_srtp_set_mki' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_set_mki@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-295' name='mki'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_set_profile' mangled-name='gnutls_srtp_set_profile' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_set_profile@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-653' name='profile'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_set_profile_direct' mangled-name='gnutls_srtp_set_profile_direct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_set_profile_direct@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-1' name='profiles'/>
      <parameter type-id='type-id-348' name='err_pos'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_keys' mangled-name='gnutls_srtp_get_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_keys@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-4' name='key_material'/>
      <parameter type-id='type-id-57' name='key_material_size'/>
      <parameter type-id='type-id-262' name='client_key'/>
      <parameter type-id='type-id-262' name='client_salt'/>
      <parameter type-id='type-id-262' name='server_key'/>
      <parameter type-id='type-id-262' name='server_salt'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='status_request.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_status_request' type-id='type-id-626' visibility='default'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-4' id='type-id-657'/>
    <function-decl name='gnutls_ocsp_status_request_enable_client' mangled-name='gnutls_ocsp_status_request_enable_client' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_status_request_enable_client@@GNUTLS_3_4'>
      <parameter type-id='type-id-177' name='session'/>
      <parameter type-id='type-id-262' name='responder_id'/>
      <parameter type-id='type-id-2' name='responder_id_size'/>
      <parameter type-id='type-id-262' name='extensions'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='supported_groups.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_supported_groups' type-id='type-id-626' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='supported_versions.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_supported_versions' type-id='type-id-626' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='randomart.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/extras' language='LANG_C11'>
    <function-decl name='__builtin_strlen' mangled-name='strlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen'>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='extv.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_ext_raw_parse' mangled-name='gnutls_ext_raw_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ext_raw_parse@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-4' name='ctx'/>
      <parameter type-id='type-id-658' name='cb'/>
      <parameter type-id='type-id-295' name='data'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-659'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-336'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='file.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_load_file' mangled-name='gnutls_load_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_load_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='filename'/>
      <parameter type-id='type-id-262' name='data'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fingerprint.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_fingerprint' mangled-name='gnutls_fingerprint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fingerprint@@GNUTLS_3_4'>
      <parameter type-id='type-id-172' name='algo'/>
      <parameter type-id='type-id-295' name='data'/>
      <parameter type-id='type-id-4' name='result'/>
      <parameter type-id='type-id-330' name='result_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fips.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_fips_mode_t' id='type-id-660'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_FIPS140_DISABLED' value='0'/>
      <enumerator name='GNUTLS_FIPS140_STRICT' value='1'/>
      <enumerator name='GNUTLS_FIPS140_SELFTESTS' value='2'/>
      <enumerator name='GNUTLS_FIPS140_LAX' value='3'/>
      <enumerator name='GNUTLS_FIPS140_LOG' value='4'/>
    </enum-decl>
    <class-decl name='gnutls_fips140_context_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-661'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-662' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-663' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_fips140_context_t' type-id='type-id-663' id='type-id-664'/>
    <typedef-decl name='gnutls_fips_mode_t' type-id='type-id-660' id='type-id-665'/>
    <pointer-type-def type-id='type-id-661' size-in-bits='64' id='type-id-663'/>
    <pointer-type-def type-id='type-id-664' size-in-bits='64' id='type-id-666'/>
    <function-decl name='gnutls_fips140_mode_enabled' mangled-name='gnutls_fips140_mode_enabled' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_mode_enabled@@GNUTLS_3_4'>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='gnutls_fips140_set_mode' mangled-name='gnutls_fips140_set_mode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_set_mode@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-665' name='mode'/>
      <parameter type-id='type-id-57' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_gnutls_lib_simulate_error' mangled-name='_gnutls_lib_simulate_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_lib_simulate_error@@GNUTLS_PRIVATE_3_4'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_gnutls_lib_force_operational' mangled-name='_gnutls_lib_force_operational' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_lib_force_operational@@GNUTLS_PRIVATE_3_4'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_fips140_context_init' mangled-name='gnutls_fips140_context_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_context_init@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-666' name='context'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_fips140_context_deinit' mangled-name='gnutls_fips140_context_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_context_deinit@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-664' name='context'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_fips140_get_operation_state' mangled-name='gnutls_fips140_get_operation_state' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_get_operation_state@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-664' name='context'/>
      <return type-id='type-id-662'/>
    </function-decl>
    <function-decl name='gnutls_fips140_push_context' mangled-name='gnutls_fips140_push_context' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_push_context@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-664' name='context'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_fips140_pop_context' mangled-name='gnutls_fips140_pop_context' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_pop_context@@GNUTLS_3_7_3'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_fips140_run_self_tests' mangled-name='gnutls_fips140_run_self_tests' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_run_self_tests@@GNUTLS_3_7_7'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='global.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-667' size-in-bits='unknown' id='type-id-668'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-669'/>
    </array-type-def>
    <class-decl name='asn1_static_node_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-670'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_library_config_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-671'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='asn1_static_node' type-id='type-id-670' id='type-id-672'/>
    <typedef-decl name='gnutls_is_secure_function' type-id='type-id-673' id='type-id-674'/>
    <typedef-decl name='gnutls_library_config_st' type-id='type-id-671' id='type-id-675'/>
    <typedef-decl name='gnutls_realloc_function' type-id='type-id-676' id='type-id-484'/>
    <qualified-type-def type-id='type-id-672' const='yes' id='type-id-667'/>
    <pointer-type-def type-id='type-id-667' size-in-bits='64' id='type-id-677'/>
    <qualified-type-def type-id='type-id-675' const='yes' id='type-id-678'/>
    <pointer-type-def type-id='type-id-678' size-in-bits='64' id='type-id-679'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-676'/>
    <pointer-type-def type-id='type-id-680' size-in-bits='64' id='type-id-681'/>
    <pointer-type-def type-id='type-id-682' size-in-bits='64' id='type-id-683'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-684'/>
    <function-decl name='_gnutls_global_init_skip' mangled-name='_gnutls_global_init_skip' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_global_init_skip@@GNUTLS_3_4'>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='gnutls_asn1_tab' type-id='type-id-668' visibility='default'/>
    <var-decl name='pkix_asn1_tab' type-id='type-id-668' visibility='default'/>
    <function-decl name='gnutls_global_set_log_function' mangled-name='gnutls_global_set_log_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_log_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-602' name='log_func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_global_set_audit_log_function' mangled-name='gnutls_global_set_audit_log_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_audit_log_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-600' name='log_func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_global_set_time_function' mangled-name='gnutls_global_set_time_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_time_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-411' name='time_func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_global_set_log_level' mangled-name='gnutls_global_set_log_level' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_log_level@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='level'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_global_set_mem_functions' mangled-name='gnutls_global_set_mem_functions' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_mem_functions@@GNUTLS_3_4'>
      <parameter type-id='type-id-162' name='alloc_func'/>
      <parameter type-id='type-id-162' name='secure_alloc_func'/>
      <parameter type-id='type-id-674' name='is_secure_func'/>
      <parameter type-id='type-id-484' name='realloc_func'/>
      <parameter type-id='type-id-83' name='free_func'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_global_init' mangled-name='gnutls_global_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_init@@GNUTLS_3_4'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_global_deinit' mangled-name='gnutls_global_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_deinit@@GNUTLS_3_4'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_check_version' mangled-name='gnutls_check_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_check_version@@GNUTLS_3_4'>
      <parameter type-id='type-id-1' name='req_version'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_get_library_config' mangled-name='gnutls_get_library_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_get_library_config@@GNUTLS_3_7_3'>
      <return type-id='type-id-679'/>
    </function-decl>
    <function-decl name='bindtextdomain' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bindtextdomain'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <typedef-decl name='asn1_node_st' type-id='type-id-684' id='type-id-682'/>
    <typedef-decl name='asn1_node' type-id='type-id-683' id='type-id-680'/>
    <function-decl name='asn1_array2tree' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_array2tree'>
      <parameter type-id='type-id-677'/>
      <parameter type-id='type-id-681'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_check_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_check_version'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_lock'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_unlock'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strverscmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strverscmp'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='handshake-checks.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='handshake-tls13.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_privkey_type_t' naming-typedef-id='type-id-270' id='type-id-685'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='GNUTLS_PRIVKEY_X509' value='0'/>
      <enumerator name='GNUTLS_PRIVKEY_OPENPGP' value='1'/>
      <enumerator name='GNUTLS_PRIVKEY_PKCS11' value='2'/>
      <enumerator name='GNUTLS_PRIVKEY_EXT' value='3'/>
    </enum-decl>
    <enum-decl name='hs_stage_t' id='type-id-686'>
      <underlying-type type-id='type-id-43'/>
      <enumerator name='STAGE_HS' value='0'/>
      <enumerator name='STAGE_APP' value='1'/>
      <enumerator name='STAGE_UPD_OURS' value='2'/>
      <enumerator name='STAGE_UPD_PEERS' value='3'/>
      <enumerator name='STAGE_EARLY' value='4'/>
    </enum-decl>
    <class-decl name='gnutls_x509_dn_st' size-in-bits='64' is-struct='yes' visibility='default' id='type-id-687'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='asn' type-id='type-id-233' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pin_info_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb' type-id='type-id-371' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-688'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sign_func' type-id='type-id-689' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sign_data_func' type-id='type-id-690' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sign_hash_func' type-id='type-id-691' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt_func' type-id='type-id-692' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='decrypt_func2' type-id='type-id-693' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit_func' type-id='type-id-694' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='info_func' type-id='type-id-695' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pk_params_func' type-id='type-id-696' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='userdata' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bits' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
