<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libgnutls.so.30'>
  <elf-needed>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.5'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libhogweed.so.6'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_dsa_generate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_generate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gnutls13_psk_ext_iter_next_binder' version='GNUTLS_PRIVATE_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='UC_CATEGORY_Nl' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_No' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pd' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pe' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pf' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Pi' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Po' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Ps' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Sc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Sk' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Sm' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_So' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='UC_CATEGORY_Zs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='nettle_sha256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='nettle_sha384' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='nettle_sha512' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uninorm_nfc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uninorm_nfkc' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='asnprintf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='basename-lgpl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isalnum.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswalnum' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswalnum' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isalpha.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswalpha' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswalpha' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isblank.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswblank' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswblank' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32iscntrl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswcntrl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswcntrl' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isdigit.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswdigit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswdigit' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isgraph.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswgraph' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswgraph' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32islower.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswlower' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswlower' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isprint.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswprint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswprint' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32ispunct.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswpunct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswpunct' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isspace.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswspace' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswspace' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isupper.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswupper' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswupper' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32isxdigit.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='iswxdigit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iswxdigit' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32tolower.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='wint_t' type-id='type-id-3' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-5'/>
    <function-decl name='towlower' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='towlower' hash='0389e499374a3f97'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='c32width.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='wchar_t' type-id='type-id-4' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-6'/>
    <function-decl name='wcwidth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcwidth' hash='d628501fd2223339'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dirname-lgpl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' hash='bac6a89264ba699c' id='type-id-10'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-12'>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='fcntl.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fcntl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fcntl' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-4'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gl_array_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='realloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='abort' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-14'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='gl_linkedhash_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc' hash='91495cdf6321a116'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gl_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-18'/>
    <class-decl name='gl_list_impl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-15'/>
    <class-decl name='gl_list_node_impl' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-17'/>
    <typedef-decl name='gl_list_t' type-id='type-id-16' size-in-bits='64' id='type-id-19'/>
    <typedef-decl name='gl_list_node_t' type-id='type-id-18' size-in-bits='64' id='type-id-20'/>
    <function-type size-in-bits='64' hash='7e544b18f5e89a62' id='type-id-21'>
      <parameter type-id='type-id-19' name='list'/>
      <parameter type-id='type-id-2' name='position'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-23'>
      <parameter type-id='type-id-19' name='list'/>
      <parameter type-id='type-id-2' name='position'/>
      <parameter type-id='type-id-9' name='elt'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-24'>
      <parameter type-id='type-id-19' name='list'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-25'>
      <parameter type-id='type-id-19' name='list'/>
      <parameter type-id='type-id-2' name='position'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='gl_rbtree_list.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='glthread/lock.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='pthread_rwlockattr_t' type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <union-decl name='pthread_rwlockattr_t' naming-typedef-id='type-id-27' visibility='default' size-in-bits='64' hash='18249e50f761d107' id='type-id-26'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-29' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-27' const='yes' hash='1e74626014079ce8' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' hash='5424a0f7dcf0ba3f' id='type-id-31'/>
    <qualified-type-def type-id='type-id-31' restrict='yes' hash='9c58f3d608f57ade' id='type-id-32'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='936e3ba559212412' id='type-id-34'/>
    <qualified-type-def type-id='type-id-35' restrict='yes' hash='2b23232a329750be' id='type-id-36'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' hash='718ed2a23424c188' id='type-id-37'/>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_init' hash='f616842fe991fad1'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_init' hash='a3a0b292219abea7'>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_destroy' hash='a3a0b292219abea7'>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_settype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutexattr_settype' hash='b4332199ac7eb1fc'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlock_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlock_init' hash='4bcf5136088d0ab8'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_init' hash='8fcb2361c566050c'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_destroy' hash='8fcb2361c566050c'>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_setkind_np' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_rwlockattr_setkind_np' hash='1c6722e4cb2fbef0'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='glthread/once.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='pthread_once' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_once' hash='022106852535817c'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hard-locale.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='strcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='localcharset.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <typedef-decl name='nl_item' type-id='type-id-4' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-42'/>
    <function-decl name='nl_langinfo' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nl_langinfo' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow_preserve.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_set_array_size.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloca.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='mbchar.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='mbiterf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <class-decl name='__mbstate_t' is-struct='yes' naming-typedef-id='type-id-43' visibility='default' size-in-bits='64' hash='e97fe294ce223fec' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-45' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-44' size-in-bits='64' id='type-id-43'/>
    <typedef-decl name='__uint_least32_t' type-id='type-id-46' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-47'/>
    <typedef-decl name='char32_t' type-id='type-id-47' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-48'/>
    <typedef-decl name='mbstate_t' type-id='type-id-43' size-in-bits='64' id='type-id-49'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' hash='6e3d8c55e57b583a#10' id='type-id-45'>
      <data-member access='public'>
        <var-decl name='__wch' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__wchb' type-id='type-id-50' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' hash='fc96de23e5520f6c' id='type-id-51'/>
    <qualified-type-def type-id='type-id-49' const='yes' hash='a328f2686e4dcc6e' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='965b139f91617649' id='type-id-53'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' hash='18fb85b101e2cd25' id='type-id-54'/>
    <function-decl name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='__assert_fail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__assert_fail' hash='f20e7a25b596c040'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='mbsinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mbsinit' hash='aefbffd326e575e4'>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbrtoc32.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <qualified-type-def type-id='type-id-51' restrict='yes' hash='fd941aad4ee15c1e' id='type-id-55'/>
    <qualified-type-def type-id='type-id-54' restrict='yes' hash='42a15c82a35f0371' id='type-id-56'/>
    <function-decl name='mbrtoc32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mbrtoc32' hash='485b3b6f3fd8f469'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbrtowc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='4c855c998d0c713a' id='type-id-58'/>
    <qualified-type-def type-id='type-id-58' restrict='yes' hash='0a4c1e4c3cbe993c' id='type-id-59'/>
    <function-decl name='mbrtowc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mbrtowc' hash='802359caacf592bb'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbsnlen.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__ctype_get_mb_cur_max' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_get_mb_cur_max' hash='e0055d99adb0e173'>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbszero.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='memeq.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='memset_explicit.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='printf-args.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='printf-parse.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='read-file.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-60'/>
    <function-decl name='fopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen' hash='ce3a19dab827954e'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setvbuf' hash='d6d5b7fa8675939e'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread' hash='b41d7fe688a81bb5'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='ftello' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftello' hash='eb0e1ae48e8b4470'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ferror' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat' hash='5227d00433989f9c'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='realloc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='setlocale_null-unlocked.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <function-decl name='setlocale' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setlocale' hash='63f13efed1e26e48'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='setlocale_null.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='streq.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='stripslash.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='strnul.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='uniwidth/width.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='vasnprintf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='1792' hash='c5bf4b10be185261' id='type-id-67'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='type-id-68'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-69' size-in-bits='4928' hash='b993512e5f5336ac' id='type-id-70'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='type-id-68'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-71'/>
    <enum-decl name='arg_type' naming-typedef-id='type-id-72' size-in-bits='32' alignment-in-bits='32' hash='30907e2cb385ab3c' id='type-id-73'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='TYPE_NONE' value='0'/>
      <enumerator name='TYPE_SCHAR' value='1'/>
      <enumerator name='TYPE_UCHAR' value='2'/>
      <enumerator name='TYPE_SHORT' value='3'/>
      <enumerator name='TYPE_USHORT' value='4'/>
      <enumerator name='TYPE_INT' value='5'/>
      <enumerator name='TYPE_UINT' value='6'/>
      <enumerator name='TYPE_LONGINT' value='7'/>
      <enumerator name='TYPE_ULONGINT' value='8'/>
      <enumerator name='TYPE_LONGLONGINT' value='9'/>
      <enumerator name='TYPE_ULONGLONGINT' value='10'/>
      <enumerator name='TYPE_INT8_T' value='11'/>
      <enumerator name='TYPE_UINT8_T' value='12'/>
      <enumerator name='TYPE_INT16_T' value='13'/>
      <enumerator name='TYPE_UINT16_T' value='14'/>
      <enumerator name='TYPE_INT32_T' value='15'/>
      <enumerator name='TYPE_UINT32_T' value='16'/>
      <enumerator name='TYPE_INT64_T' value='17'/>
      <enumerator name='TYPE_UINT64_T' value='18'/>
      <enumerator name='TYPE_INT_FAST8_T' value='19'/>
      <enumerator name='TYPE_UINT_FAST8_T' value='20'/>
      <enumerator name='TYPE_INT_FAST16_T' value='21'/>
      <enumerator name='TYPE_UINT_FAST16_T' value='22'/>
      <enumerator name='TYPE_INT_FAST32_T' value='23'/>
      <enumerator name='TYPE_UINT_FAST32_T' value='24'/>
      <enumerator name='TYPE_INT_FAST64_T' value='25'/>
      <enumerator name='TYPE_UINT_FAST64_T' value='26'/>
      <enumerator name='TYPE_DOUBLE' value='27'/>
      <enumerator name='TYPE_LONGDOUBLE' value='28'/>
      <enumerator name='TYPE_CHAR' value='29'/>
      <enumerator name='TYPE_WIDE_CHAR' value='30'/>
      <enumerator name='TYPE_STRING' value='31'/>
      <enumerator name='TYPE_WIDE_STRING' value='32'/>
      <enumerator name='TYPE_POINTER' value='33'/>
      <enumerator name='TYPE_COUNT_SCHAR_POINTER' value='34'/>
      <enumerator name='TYPE_COUNT_SHORT_POINTER' value='35'/>
      <enumerator name='TYPE_COUNT_INT_POINTER' value='36'/>
      <enumerator name='TYPE_COUNT_LONGINT_POINTER' value='37'/>
      <enumerator name='TYPE_COUNT_LONGLONGINT_POINTER' value='38'/>
      <enumerator name='TYPE_COUNT_INT8_T_POINTER' value='39'/>
      <enumerator name='TYPE_COUNT_INT16_T_POINTER' value='40'/>
      <enumerator name='TYPE_COUNT_INT32_T_POINTER' value='41'/>
      <enumerator name='TYPE_COUNT_INT64_T_POINTER' value='42'/>
      <enumerator name='TYPE_COUNT_INT_FAST8_T_POINTER' value='43'/>
      <enumerator name='TYPE_COUNT_INT_FAST16_T_POINTER' value='44'/>
      <enumerator name='TYPE_COUNT_INT_FAST32_T_POINTER' value='45'/>
      <enumerator name='TYPE_COUNT_INT_FAST64_T_POINTER' value='46'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-75'/>
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-76'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='type-id-77'/>
    <class-decl name='argument' is-struct='yes' naming-typedef-id='type-id-66' visibility='default' size-in-bits='256' hash='ac606fb3b977dc34' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-79' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='arguments' is-struct='yes' naming-typedef-id='type-id-80' visibility='default' size-in-bits='1920' hash='095971d7baa9e5a2' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='direct_alloc_arg' type-id='type-id-67' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directive' is-struct='yes' naming-typedef-id='type-id-69' visibility='default' size-in-bits='704' hash='8a4832b9ca8847e2' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='width_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='width_arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='precision_start' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='precision_end' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='precision_arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conversion' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arg_index' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directives' is-struct='yes' naming-typedef-id='type-id-85' visibility='default' size-in-bits='5184' hash='eda54347339c46a6' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_width_length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_precision_length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='direct_alloc_dir' type-id='type-id-70' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-4' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-88'/>
    <typedef-decl name='__int64_t' type-id='type-id-29' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-89'/>
    <typedef-decl name='__int8_t' type-id='type-id-90' size-in-bits='8' hash='3c595c3350588f18' id='type-id-91'/>
    <typedef-decl name='arg_type' type-id='type-id-73' size-in-bits='32' alignment-in-bits='32' hash='30907e2cb385ab3c' id='type-id-72'/>
    <typedef-decl name='argument' type-id='type-id-78' size-in-bits='256' id='type-id-66'/>
    <typedef-decl name='arguments' type-id='type-id-81' size-in-bits='1920' id='type-id-80'/>
    <typedef-decl name='char_directive' type-id='type-id-83' size-in-bits='704' id='type-id-69'/>
    <typedef-decl name='char_directives' type-id='type-id-86' size-in-bits='5184' id='type-id-85'/>
    <typedef-decl name='int32_t' type-id='type-id-88' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-92'/>
    <typedef-decl name='int64_t' type-id='type-id-89' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-93'/>
    <typedef-decl name='int8_t' type-id='type-id-91' size-in-bits='8' hash='3c595c3350588f18' id='type-id-94'/>
    <typedef-decl name='int_fast16_t' type-id='type-id-29' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-95'/>
    <typedef-decl name='int_fast32_t' type-id='type-id-29' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-96'/>
    <typedef-decl name='int_fast64_t' type-id='type-id-29' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-97'/>
    <typedef-decl name='int_fast8_t' type-id='type-id-90' size-in-bits='8' hash='3c595c3350588f18' id='type-id-98'/>
    <typedef-decl name='uint_fast16_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-99'/>
    <typedef-decl name='uint_fast32_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-100'/>
    <typedef-decl name='uint_fast64_t' type-id='type-id-8' size-in-bits='64' hash='8fdc5eea2983a729' id='type-id-101'/>
    <typedef-decl name='uint_fast8_t' type-id='type-id-102' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-103'/>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='128' is-anonymous='yes' hash='54ba289bd7480d14#6' id='type-id-79'>
      <data-member access='public'>
        <var-decl name='a_schar' type-id='type-id-90' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uchar' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_short' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ushort' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longint' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulongint' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longlongint' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulonglongint' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int8_t' type-id='type-id-94' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint8_t' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int16_t' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint16_t' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int32_t' type-id='type-id-92' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint32_t' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int64_t' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint64_t' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast8_t' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast8_t' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast16_t' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast16_t' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast32_t' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast32_t' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int_fast64_t' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint_fast64_t' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_float' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_double' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longdouble' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_char' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_char' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_string' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_string' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_pointer' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_schar_pointer' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_short_pointer' type-id='type-id-114' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_pointer' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longint_pointer' type-id='type-id-115' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longlongint_pointer' type-id='type-id-116' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int8_t_pointer' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int16_t_pointer' type-id='type-id-118' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int32_t_pointer' type-id='type-id-119' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int64_t_pointer' type-id='type-id-120' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast8_t_pointer' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast16_t_pointer' type-id='type-id-122' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast32_t_pointer' type-id='type-id-123' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_fast64_t_pointer' type-id='type-id-124' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-106'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' hash='a5ee0afd5ff6d40b' id='type-id-82'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='1a72c30a4a116ed3' id='type-id-125'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='86710da2ca66920d' id='type-id-87'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='267f2642a7e40b33' id='type-id-126'/>
    <qualified-type-def type-id='type-id-6' const='yes' hash='ec486fb00a2b9a49' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' hash='7ae0d48e9d921c08' id='type-id-112'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' hash='e1c556b63d77e5a5' id='type-id-118'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='eed3dd419640fb3b' id='type-id-119'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' hash='e24def43c7e4b3b5' id='type-id-120'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' hash='a214be57f5aa79fe' id='type-id-117'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' hash='b9094866e36835fe' id='type-id-122'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' hash='d5867fa403ca227d' id='type-id-123'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' hash='cc35e81c901ca583' id='type-id-124'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' hash='c142d9c660922ab7' id='type-id-121'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' hash='9525b6affe75cc9d#2' id='type-id-115'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' hash='77d6ad71d7d08df8#3' id='type-id-116'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' hash='ccc99a75f65fca1e#4' id='type-id-114'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='759f00c63d08adc8' id='type-id-113'/>
    <function-decl name='snprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf' hash='9e970561a213ee08'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strnlen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strnlen' hash='e62a7a46b2904b02'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='wcslen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcslen' hash='3df1bfc94027e171'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='wcrtomb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcrtomb' hash='5537d0fc51348515'>
      <parameter type-id='type-id-63'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vsnzprintf.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='xsize.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-aesni.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='AES_KEY' is-struct='yes' naming-typedef-id='type-id-128' visibility='default' size-in-bits='2080' hash='2e517134c85ccfd5' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rd_key' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='rounds' type-id='type-id-110' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AES_KEY' type-id='type-id-129' size-in-bits='2080' id='type-id-128'/>
    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='2048' hash='fb5f1a9133e2e542' id='type-id-130'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-131'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' hash='16c66a26edbca940' id='type-id-132'/>
    <qualified-type-def type-id='type-id-128' const='yes' hash='5ba5a354d29df293' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='6f8f5a2c0b8a8407' id='type-id-134'/>
    <qualified-type-def type-id='type-id-4' const='yes' hash='8cef8df4b6728924' id='type-id-135'/>
    <function-type size-in-bits='64' hash='2a5ad78b5636b88c' id='type-id-136'>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='553590cb300023bb' id='type-id-138'>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b6a97d07f8261bc0' id='type-id-140'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='ccc0e5595ea688d4' id='type-id-141'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='9d19f01ed7a4ba18' id='type-id-142'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-143'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='91495cdf6321a116' id='type-id-144'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-ssse3.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='aes-ccm-x86-aesni.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <typedef-decl name='nettle_cipher_func' type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' hash='44cd4864a6b14d80' id='type-id-147'/>
    <function-decl name='nettle_ccm_encrypt_message' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_ccm_encrypt_message' hash='09cbb3d3fc3e6651'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_ccm_decrypt_message' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_ccm_decrypt_message' hash='63aee00b262db8ab'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='57b238f0e6b90453' id='type-id-145'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-padlock.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-150' size-in-bits='32768' hash='665d3d29f3180da2' id='type-id-151'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-152'/>
    </array-type-def>
    <class-decl name='gcm_ctx' is-struct='yes' visibility='default' size-in-bits='512' hash='8f5a38c23fbfe260' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctr' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth_size' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='data_size' type-id='type-id-111' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gcm_key' is-struct='yes' visibility='default' size-in-bits='32768' hash='134bcb546d82747d' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h' type-id='type-id-151' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='padlock_cipher_data' is-struct='yes' visibility='default' size-in-bits='2336' hash='af69eda8bb0e506e' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cword' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ks' type-id='type-id-128' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' hash='941ea5f6ac5dd67e#12' id='type-id-158'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rounds' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dgst' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='align' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='ciphr' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='keygen' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='interm' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='encdec' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='ksize' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-111' size-in-bits='128' hash='cedf16acf4bd1010' id='type-id-159'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-160'/>
    </array-type-def>
    <union-decl name='nettle_block16' visibility='default' size-in-bits='128' hash='177b2981706e0d1b' id='type-id-150'>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-161' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='w' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u64' type-id='type-id-159' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' hash='3b1c04012fd840e3#11' id='type-id-157'>
      <data-member access='public'>
        <var-decl name='pad' type-id='type-id-163' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-158' visibility='default'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='128' hash='42086985110cb09a' id='type-id-163'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-164'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='128' hash='4cad2ae558674cda' id='type-id-162'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-160'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-154' const='yes' hash='f4eccda9724da6a6' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' hash='d6774ddbe4a881e5' id='type-id-166'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' hash='e078dd388110c889' id='type-id-167'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' hash='c6d13c46659f69db' id='type-id-168'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' hash='bd3094f3657e67d9' id='type-id-169'/>
    <function-decl name='nettle_gcm_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_set_key' hash='a82dde1efa0368fe'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_set_iv' hash='539f81de226e4773'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_gcm_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_update' hash='539f81de226e4773'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_gcm_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_encrypt' hash='613faecd75e883fb'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_gcm_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_decrypt' hash='613faecd75e883fb'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_gcm_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_gcm_digest' hash='e3e8b5009dfd1fb7'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-aesni.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul-avx.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='u128' is-struct='yes' naming-typedef-id='type-id-170' visibility='default' size-in-bits='128' hash='c612d11c98eb86a3' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hi' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lo' type-id='type-id-111' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u128' type-id='type-id-171' size-in-bits='128' id='type-id-170'/>
    <qualified-type-def type-id='type-id-170' const='yes' hash='225f525756c5dcf6' id='type-id-172'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' hash='0831541e14fd9a5c' id='type-id-173'/>
    <qualified-type-def type-id='type-id-111' const='yes' hash='e9dc20ae58508001' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' hash='3a7fed834a37fdf4' id='type-id-175'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' hash='ab6119f09e42e59d' id='type-id-176'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' hash='a7b536d51360d693' id='type-id-177'/>
    <function-decl name='nettle_memxor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_memxor' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-ssse3.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='aes-padlock.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='aes192_ctx' is-struct='yes' visibility='default' size-in-bits='1664' hash='b26455021045c3be' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-179' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='aes256_ctx' is-struct='yes' visibility='default' size-in-bits='1920' hash='fb54d1a2e3e20f61' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-181' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='1664' hash='147cda6a5d4f83ba' id='type-id-179'>
      <subrange length='52' lower-bound='0' upper-bound='51' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='3cf2cd1128d9d2d1' id='type-id-182'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='1920' hash='2d0a7fda2fbb029e' id='type-id-181'>
      <subrange length='60' lower-bound='0' upper-bound='59' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='077f0c0ee387abdb' id='type-id-183'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' hash='0d74bc7c89bb5cc8' id='type-id-184'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' hash='86bb7001343309d2' id='type-id-185'/>
    <function-decl name='nettle_aes192_set_encrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes192_set_encrypt_key' hash='a4d604257e040b54'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_aes192_set_decrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes192_set_decrypt_key' hash='a4d604257e040b54'>
      <parameter type-id='type-id-184'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_encrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes256_set_encrypt_key' hash='4048415d86217dfe'>
      <parameter type-id='type-id-185'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_decrypt_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_aes256_set_decrypt_key' hash='4048415d86217dfe'>
      <parameter type-id='type-id-185'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-xts-x86-aesni.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-padlock.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='nettle_hash' is-struct='yes' visibility='default' size-in-bits='384' hash='e9c906511dfd15bf' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='digest_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='block_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update' type-id='type-id-188' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='digest' type-id='type-id-189' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha1_ctx' is-struct='yes' visibility='default' size-in-bits='832' hash='7db0a6e75bf09885' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-191' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='count' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='index' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='block' type-id='type-id-192' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha256_ctx' is-struct='yes' visibility='default' size-in-bits='896' hash='9292581c0a402f2b' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='count' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='index' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block' type-id='type-id-192' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha512_ctx' is-struct='yes' visibility='default' size-in-bits='1728' hash='a926e96bce8ff63c' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='count_low' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='count_high' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='index' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='block' type-id='type-id-197' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nettle_hash_digest_func' type-id='type-id-198' size-in-bits='64' id='type-id-199'/>
    <typedef-decl name='nettle_hash_init_func' type-id='type-id-14' size-in-bits='64' id='type-id-200'/>
    <typedef-decl name='nettle_hash_update_func' type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='160' hash='4489ed3a0d625cab' id='type-id-191'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-203'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='256' hash='abb4af35f87308ba' id='type-id-194'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-204'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-111' size-in-bits='512' hash='dc3cf60b27392b4f' id='type-id-196'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-204'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-107' size-in-bits='1024' hash='d146d941c673b418' id='type-id-197'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-205'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-186' const='yes' hash='c936633e45f51d79' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' hash='fa10ba629ba22ab0' id='type-id-207'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' hash='63354788ec20c1ea' id='type-id-189'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='b9d746fbdb7bbcc8' id='type-id-187'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' hash='98ce08a2cfb72806' id='type-id-188'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='b07349bd7335f741' id='type-id-208'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' hash='2f03b6e0341b6c1c' id='type-id-209'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' hash='74da511f0aa7c0e5' id='type-id-210'/>
    <function-decl name='nettle_hmac_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_hmac_set_key' hash='951a97bc494fe8b5'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_hmac_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_hmac_digest' hash='7242e4172b78d126'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='0e2d44cb3e69abdd' id='type-id-201'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='b6c4028b63092bfb' id='type-id-198'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='1fac5d49c2e3738d' id='type-id-211'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='3fe84ae876414e71' id='type-id-213'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b6eefdc1ddb6c4a9' id='type-id-215'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b3c79690b2805221' id='type-id-216'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-217'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-218'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-x86-ssse3.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='sha-padlock.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='nettle_sha1_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha1_init' hash='b87337f5637bcd36'>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha256_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha256_init' hash='03454db9aeaa3fbe'>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha224_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha224_init' hash='03454db9aeaa3fbe'>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha512_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha512_init' hash='ac37fc7c0e242a21'>
      <parameter type-id='type-id-210'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha384_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha384_init' hash='ac37fc7c0e242a21'>
      <parameter type-id='type-id-210'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='744b0d6a323696fe' id='type-id-219'>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='cef432d3e9f0eee3' id='type-id-220'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='sha-x86-ssse3.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='nettle_sha1_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha1_update' hash='0fe142dc28963fb4'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha1_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha1_digest' hash='1faf2b408af9d1ec'>
      <parameter type-id='type-id-208'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha256_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha256_update' hash='1e745c7180a62f40'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha256_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha256_digest' hash='0e89881aedb7f1e6'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha224_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha224_digest' hash='0e89881aedb7f1e6'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha512_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha512_update' hash='15764cffffb91d2f'>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha512_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha512_digest' hash='8966805fed7b6179'>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_sha384_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_sha384_digest' hash='8966805fed7b6179'>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='x86-common.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='strtol' mangled-name='__isoc23_strtol' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtol' hash='52efcc9e902b4c3e'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='secure_getenv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='secure_getenv' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='alert.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <function-decl name='gnutls_alert_get_name' mangled-name='gnutls_alert_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_name@@GNUTLS_3_4' hash='154b5031065dfc5f'>
      <parameter type-id='type-id-222' name='alert'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_strname' mangled-name='gnutls_alert_get_strname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_strname@@GNUTLS_3_4' hash='154b5031065dfc5f'>
      <parameter type-id='type-id-222' name='alert'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_alert_send' mangled-name='gnutls_alert_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send@@GNUTLS_3_4' hash='98ef40c580b49f9f'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-224' name='level'/>
      <parameter type-id='type-id-222' name='desc'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_error_to_alert' mangled-name='gnutls_error_to_alert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_to_alert@@GNUTLS_3_4' hash='72112b17e1d575e7'>
      <parameter type-id='type-id-4' name='err'/>
      <parameter type-id='type-id-13' name='level'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_alert_send_appropriate' mangled-name='gnutls_alert_send_appropriate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send_appropriate@@GNUTLS_3_4' hash='ebbf9e2276087285'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-4' name='err'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_alert_get' mangled-name='gnutls_alert_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get@@GNUTLS_3_4' hash='ad860125f6703eec'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-222'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dcgettext' hash='f0cb0c0d760b1174'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert_types.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-225' const='yes' hash='a5d57c0b23dd5c78' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' hash='a0c2ff744842de41' id='type-id-227'/>
    <function-decl name='gnutls_certificate_type_get_name' mangled-name='gnutls_certificate_type_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_get_name@@GNUTLS_3_4' hash='611118e27dfa889c'>
      <parameter type-id='type-id-225' name='type'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get_id' mangled-name='gnutls_certificate_type_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_get_id@@GNUTLS_3_4' hash='e08b17548033f0b6'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_list' mangled-name='gnutls_certificate_type_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_list@@GNUTLS_3_4' hash='627da3418cd1b2c1'>
      <return type-id='type-id-227'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphers.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-137' const='yes' hash='f5027ddeba1ba0c9' id='type-id-228'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' hash='bc723142bd1ba7af' id='type-id-229'/>
    <function-decl name='_gnutls_cipher_to_entry' mangled-name='_gnutls_cipher_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_cipher_to_entry@@GNUTLS_PRIVATE_3_4' hash='0d28c2d0242203a2'>
      <parameter type-id='type-id-137' name='c'/>
      <return type-id='type-id-230'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_block_size' mangled-name='gnutls_cipher_get_block_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_block_size@@GNUTLS_3_4' hash='277afc0d11aaf37a'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_tag_size' mangled-name='gnutls_cipher_get_tag_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_tag_size@@GNUTLS_3_4' hash='277afc0d11aaf37a'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_iv_size' mangled-name='gnutls_cipher_get_iv_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_iv_size@@GNUTLS_3_4' hash='277afc0d11aaf37a'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_key_size' mangled-name='gnutls_cipher_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_key_size@@GNUTLS_3_4' hash='ed41dd506390bbe6'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_name' mangled-name='gnutls_cipher_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_name@@GNUTLS_3_4' hash='a540b9384d5ed258'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_id' mangled-name='gnutls_cipher_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_id@@GNUTLS_3_4' hash='de24a27946136b4b'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='gnutls_cipher_list' mangled-name='gnutls_cipher_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_list@@GNUTLS_3_4' hash='debedddd7c9e7038'>
      <return type-id='type-id-229'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphersuites.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' hash='9e92784c72465ed8' id='type-id-231'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' hash='72cc508ec0baac8c' id='type-id-233'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' hash='32b8db243863df50' id='type-id-235'/>
    <function-decl name='gnutls_cipher_suite_get_name' mangled-name='gnutls_cipher_suite_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_get_name@@GNUTLS_3_4' hash='f41e152a51049d21'>
      <parameter type-id='type-id-232' name='kx_algorithm'/>
      <parameter type-id='type-id-137' name='cipher_algorithm'/>
      <parameter type-id='type-id-214' name='mac_algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_info' mangled-name='gnutls_cipher_suite_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_info@@GNUTLS_3_4' hash='de548a81bdeaf1b0'>
      <parameter type-id='type-id-2' name='idx'/>
      <parameter type-id='type-id-236' name='cs_id'/>
      <parameter type-id='type-id-233' name='kx'/>
      <parameter type-id='type-id-231' name='cipher'/>
      <parameter type-id='type-id-237' name='mac'/>
      <parameter type-id='type-id-235' name='min_version'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_priority_get_cipher_suite_index' mangled-name='gnutls_priority_get_cipher_suite_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_get_cipher_suite_index@@GNUTLS_3_4' hash='1a082b26e9026430'>
      <parameter type-id='type-id-238' name='pcache'/>
      <parameter type-id='type-id-3' name='idx'/>
      <parameter type-id='type-id-239' name='sidx'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-9' id='type-id-240'/>
  </abi-instr>
  <abi-instr address-size='64' path='ecc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' hash='e90c3a537ef36395' id='type-id-242'/>
    <function-decl name='gnutls_ecc_curve_list' mangled-name='gnutls_ecc_curve_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_list@@GNUTLS_3_4' hash='6b3a3ac460cb201a'>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='_gnutls_ecc_curve_is_supported' mangled-name='_gnutls_ecc_curve_is_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_ecc_curve_is_supported@@GNUTLS_PRIVATE_3_4' hash='762fe81377b11bc1'>
      <parameter type-id='type-id-243' name='curve'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_ecc_curve' mangled-name='gnutls_oid_to_ecc_curve' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_ecc_curve@@GNUTLS_3_4' hash='aaa29aa825a2b7f3'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_id' mangled-name='gnutls_ecc_curve_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_id@@GNUTLS_3_4' hash='aaa29aa825a2b7f3'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-243'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_name' mangled-name='gnutls_ecc_curve_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_name@@GNUTLS_3_4' hash='7cd0f55a087eb217'>
      <parameter type-id='type-id-243' name='curve'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_oid' mangled-name='gnutls_ecc_curve_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_oid@@GNUTLS_3_4' hash='7cd0f55a087eb217'>
      <parameter type-id='type-id-243' name='curve'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_size' mangled-name='gnutls_ecc_curve_get_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_size@@GNUTLS_3_4' hash='f3e9263ecfd79f8e'>
      <parameter type-id='type-id-243' name='curve'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_pk' mangled-name='gnutls_ecc_curve_get_pk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_pk@@GNUTLS_3_4' hash='2d2c4be56f5cee29'>
      <parameter type-id='type-id-243' name='curve'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-type size-in-bits='64' hash='f3e9263ecfd79f8e' id='type-id-245'>
      <parameter type-id='type-id-243' name='curve'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='groups.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-246' const='yes' hash='f8236485b869a7a2' id='type-id-247'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' hash='74fe4710f4830d39' id='type-id-248'/>
    <function-decl name='gnutls_group_list' mangled-name='gnutls_group_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_list@@GNUTLS_3_6_0' hash='dfd610290ae5bbed'>
      <return type-id='type-id-248'/>
    </function-decl>
    <function-decl name='gnutls_group_get_id' mangled-name='gnutls_group_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_id@@GNUTLS_3_6_0' hash='10f19ab254077edd'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-246'/>
    </function-decl>
    <function-decl name='gnutls_group_get_name' mangled-name='gnutls_group_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_name@@GNUTLS_3_6_0' hash='51651228dc246160'>
      <parameter type-id='type-id-246' name='group'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='kx.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-232' const='yes' hash='302a0f9be6f5e7f4' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' hash='ccf6903a0e080595' id='type-id-250'/>
    <function-decl name='gnutls_kx_get_name' mangled-name='gnutls_kx_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_get_name@@GNUTLS_3_4' hash='34e2597967ed62b0'>
      <parameter type-id='type-id-232' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_kx_get_id' mangled-name='gnutls_kx_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_get_id@@GNUTLS_3_4' hash='31443b63ed8d6f66'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-232'/>
    </function-decl>
    <function-decl name='gnutls_kx_list' mangled-name='gnutls_kx_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_list@@GNUTLS_3_4' hash='49236f68ffe3ba50'>
      <return type-id='type-id-250'/>
    </function-decl>
    <function-type size-in-bits='64' hash='3a4bb4746da568d9' id='type-id-251'>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='mac.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-212' const='yes' hash='33dec9baee11e104' id='type-id-252'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' hash='0f22b1560095e28e' id='type-id-253'/>
    <qualified-type-def type-id='type-id-214' const='yes' hash='f9d6f242f326d47f' id='type-id-254'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' hash='9d8e7eaf2dc80c24' id='type-id-255'/>
    <function-decl name='_gnutls_mac_to_entry' mangled-name='_gnutls_mac_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_mac_to_entry@@GNUTLS_PRIVATE_3_4' hash='592bccd545ca0ed7'>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-256'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_name' mangled-name='gnutls_mac_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_name@@GNUTLS_3_4' hash='ea1201fd8d609f6b'>
      <parameter type-id='type-id-214' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_name' mangled-name='gnutls_digest_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_name@@GNUTLS_3_4' hash='360325cdf91dbaeb'>
      <parameter type-id='type-id-212' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_id' mangled-name='gnutls_digest_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_id@@GNUTLS_3_4' hash='374a648c98a4ca55'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-212'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_id' mangled-name='gnutls_mac_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_id@@GNUTLS_3_4' hash='52540b9b48c93159'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-214'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_key_size' mangled-name='gnutls_mac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_key_size@@GNUTLS_3_4' hash='fe8b05ef89fd28a7'>
      <parameter type-id='type-id-214' name='algorithm'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_nonce_size' mangled-name='gnutls_mac_get_nonce_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_nonce_size@@GNUTLS_3_4' hash='fe8b05ef89fd28a7'>
      <parameter type-id='type-id-214' name='algorithm'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_mac_list' mangled-name='gnutls_mac_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_list@@GNUTLS_3_4' hash='ff4b2a9f30cc26da'>
      <return type-id='type-id-255'/>
    </function-decl>
    <function-decl name='gnutls_digest_list' mangled-name='gnutls_digest_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_list@@GNUTLS_3_4' hash='7138a4cd76294954'>
      <return type-id='type-id-253'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_digest' mangled-name='gnutls_oid_to_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_digest@@GNUTLS_3_4' hash='374a648c98a4ca55'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-212'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_mac' mangled-name='gnutls_oid_to_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_mac@@GNUTLS_3_4' hash='52540b9b48c93159'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-214'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_oid' mangled-name='gnutls_digest_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_oid@@GNUTLS_3_4' hash='360325cdf91dbaeb'>
      <parameter type-id='type-id-212' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='protocols.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-234' const='yes' hash='d92535c1926c5855' id='type-id-257'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' hash='de15bc514687547f' id='type-id-258'/>
    <function-decl name='_gnutls_version_to_entry' mangled-name='_gnutls_version_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_version_to_entry@@GNUTLS_PRIVATE_3_4' hash='4f158f10e16408d8'>
      <parameter type-id='type-id-234' name='version'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_name' mangled-name='gnutls_protocol_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_get_name@@GNUTLS_3_4' hash='8f6c47854be2347c'>
      <parameter type-id='type-id-234' name='version'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_id' mangled-name='gnutls_protocol_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_get_id@@GNUTLS_3_4' hash='32d0870089a0b9c6'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-234'/>
    </function-decl>
    <function-decl name='gnutls_protocol_list' mangled-name='gnutls_protocol_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_list@@GNUTLS_3_4' hash='0e34545d77509bde'>
      <return type-id='type-id-258'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='publickey.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_pk_algorithm_get_name' mangled-name='gnutls_pk_algorithm_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_algorithm_get_name@@GNUTLS_3_4' hash='8a4cafc7c68d3b6a'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_pk_list' mangled-name='gnutls_pk_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_list@@GNUTLS_3_4' hash='db1d46798ab678dc'>
      <return type-id='type-id-260'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_id' mangled-name='gnutls_pk_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_id@@GNUTLS_3_4' hash='36e8ee85cf2e537e'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_name' mangled-name='gnutls_pk_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_name@@GNUTLS_3_4' hash='8a4cafc7c68d3b6a'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_pk' mangled-name='gnutls_oid_to_pk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_pk@@GNUTLS_3_4' hash='36e8ee85cf2e537e'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_oid' mangled-name='gnutls_pk_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_oid@@GNUTLS_3_4' hash='8a4cafc7c68d3b6a'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='secparams.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_sec_param_to_pk_bits' mangled-name='gnutls_sec_param_to_pk_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_to_pk_bits@@GNUTLS_3_4' hash='2ed9b0c4bd15bc77'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_sec_param_to_symmetric_bits' mangled-name='gnutls_sec_param_to_symmetric_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_to_symmetric_bits@@GNUTLS_3_4' hash='b3f66667c87330c2'>
      <parameter type-id='type-id-261' name='param'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_sec_param_get_name' mangled-name='gnutls_sec_param_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_get_name@@GNUTLS_3_4' hash='808104d25799152f'>
      <parameter type-id='type-id-261' name='param'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_pk_bits_to_sec_param' mangled-name='gnutls_pk_bits_to_sec_param' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_bits_to_sec_param@@GNUTLS_3_4' hash='c492f3c3625b3a50'>
      <parameter type-id='type-id-244' name='algo'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-261'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sign.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-262' const='yes' hash='f5c9200b80e83320' id='type-id-263'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' hash='605a59e09ee0b903' id='type-id-264'/>
    <function-decl name='gnutls_sign_get_name' mangled-name='gnutls_sign_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_name@@GNUTLS_3_4' hash='1a968710c2925726'>
      <parameter type-id='type-id-262' name='sign'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_sign_is_secure' mangled-name='gnutls_sign_is_secure' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_is_secure@@GNUTLS_3_4' hash='f15a3633bb7f5b1f'>
      <parameter type-id='type-id-262' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_sign_is_secure2' mangled-name='gnutls_sign_is_secure2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_is_secure2@@GNUTLS_3_6_0' hash='ea0a8caec1749377'>
      <parameter type-id='type-id-262' name='algorithm'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_sign_list' mangled-name='gnutls_sign_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_list@@GNUTLS_3_4' hash='235426b619bc261e'>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_id' mangled-name='gnutls_sign_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_id@@GNUTLS_3_4' hash='0941e3358dabcc90'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-262'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_sign' mangled-name='gnutls_oid_to_sign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_sign@@GNUTLS_3_4' hash='0941e3358dabcc90'>
      <parameter type-id='type-id-1' name='oid'/>
      <return type-id='type-id-262'/>
    </function-decl>
    <function-decl name='gnutls_pk_to_sign' mangled-name='gnutls_pk_to_sign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_to_sign@@GNUTLS_3_4' hash='40ac85127e5054ca'>
      <parameter type-id='type-id-244' name='pk'/>
      <parameter type-id='type-id-212' name='hash'/>
      <return type-id='type-id-262'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_oid' mangled-name='gnutls_sign_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_oid@@GNUTLS_3_4' hash='1a968710c2925726'>
      <parameter type-id='type-id-262' name='sign'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_hash_algorithm' mangled-name='gnutls_sign_get_hash_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_hash_algorithm@@GNUTLS_3_4' hash='19372428d9c13b59'>
      <parameter type-id='type-id-262' name='sign'/>
      <return type-id='type-id-212'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_pk_algorithm' mangled-name='gnutls_sign_get_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_pk_algorithm@@GNUTLS_3_4' hash='40f8d9812303f83e'>
      <parameter type-id='type-id-262' name='sign'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='gnutls_sign_supports_pk_algorithm' mangled-name='gnutls_sign_supports_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_supports_pk_algorithm@@GNUTLS_3_6_0' hash='a10cddc7cbfb8925'>
      <parameter type-id='type-id-262' name='sign'/>
      <parameter type-id='type-id-244' name='pk'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon_cred.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <class-decl name='gnutls_anon_client_credentials_st' is-struct='yes' visibility='default' size-in-bits='32' hash='9a7abcc6cd01a92e' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_anon_server_credentials_st' is-struct='yes' visibility='default' size-in-bits='192' hash='14b3a70aec69616f' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dh_params' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='deinit_dh_params' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dh_sec_param' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='params_func' type-id='type-id-268' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_anon_client_credentials_t' type-id='type-id-269' size-in-bits='64' hash='80012f382a1c1b8e' id='type-id-270'/>
    <typedef-decl name='gnutls_anon_server_credentials_t' type-id='type-id-271' size-in-bits='64' hash='b6fc0ebd4377795f' id='type-id-272'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' hash='80012f382a1c1b8e' id='type-id-269'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' hash='ee7c4e048322ff1e' id='type-id-273'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' hash='b6fc0ebd4377795f' id='type-id-271'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' hash='4f1eef63a77364af' id='type-id-274'/>
    <class-decl name='gnutls_x509_privkey_int' is-struct='yes' visibility='default' size-in-bits='4416' hash='453d22ef56bd7fdb' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-276' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='expanded' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='key' type-id='type-id-277' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='pin' type-id='type-id-278' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_anon_free_server_credentials' mangled-name='gnutls_anon_free_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_server_credentials@@GNUTLS_3_4' hash='6d9088a4a015e472'>
      <parameter type-id='type-id-272' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_server_credentials' mangled-name='gnutls_anon_allocate_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_server_credentials@@GNUTLS_3_4' hash='acda7c5edead5b72'>
      <parameter type-id='type-id-274' name='sc'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_anon_free_client_credentials' mangled-name='gnutls_anon_free_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_client_credentials@@GNUTLS_3_4' hash='bba617123510566c'>
      <parameter type-id='type-id-270' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_client_credentials' mangled-name='gnutls_anon_allocate_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_client_credentials@@GNUTLS_3_4' hash='b4981b8c2e05058a'>
      <parameter type-id='type-id-273' name='sc'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_dh_params' mangled-name='gnutls_anon_set_server_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_dh_params@@GNUTLS_3_4' hash='1f5e65bd707597fe'>
      <parameter type-id='type-id-272' name='res'/>
      <parameter type-id='type-id-267' name='dh_params'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_known_dh_params' mangled-name='gnutls_anon_set_server_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_known_dh_params@@GNUTLS_3_4' hash='2c31ab436864e549'>
      <parameter type-id='type-id-272' name='res'/>
      <parameter type-id='type-id-261' name='sec_param'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_params_function' mangled-name='gnutls_anon_set_server_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_params_function@@GNUTLS_3_4' hash='929d0566a82a2a3f'>
      <parameter type-id='type-id-272' name='res'/>
      <parameter type-id='type-id-268' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='9c99882ded447f09' id='type-id-279'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='atfork.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <function-decl name='__register_atfork' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__register_atfork' hash='827f946a531506e2'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='audit.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-29' size-in-bits='512' hash='8e4c722572470e23' id='type-id-282'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-204'/>
    </array-type-def>
    <class-decl name='crau_context_stack_st' is-struct='yes' visibility='default' size-in-bits='576' hash='c471753139074930' id='type-id-283'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stack' type-id='type-id-282' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='top' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' hash='991751c43ac0f7e4' id='type-id-284'/>
    <function-decl name='gnutls_audit_push_context' mangled-name='gnutls_audit_push_context' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_audit_push_context@@GNUTLS_3_8_11' hash='52c0efb08d2aa513#2'>
      <parameter type-id='type-id-29' name='context'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_audit_pop_context' mangled-name='gnutls_audit_pop_context' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_audit_pop_context@@GNUTLS_3_8_11' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_audit_current_context' mangled-name='gnutls_audit_current_context' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_audit_current_context@@GNUTLS_3_8_11' hash='52c0efb08d2aa513#2'>
      <return type-id='type-id-29'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='auth.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <class-decl name='dh_info_st' is-struct='yes' naming-typedef-id='type-id-285' visibility='default' size-in-bits='448' hash='72cc4e8938a45a60' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret_bits' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prime' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generator' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='public_key' type-id='type-id-287' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dh_info_st' type-id='type-id-286' size-in-bits='448' id='type-id-285'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' hash='b31c6904e8969309' id='type-id-288'/>
    <function-decl name='gnutls_credentials_clear' mangled-name='gnutls_credentials_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_clear@@GNUTLS_3_4' hash='5da33de99a09b407'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' mangled-name='gnutls_credentials_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_set@@GNUTLS_3_4' hash='112396499b22c0c1'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-289' name='type'/>
      <parameter type-id='type-id-9' name='cred'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_credentials_get' mangled-name='gnutls_credentials_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_get@@GNUTLS_3_4' hash='65ea5c22828ba151'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-289' name='type'/>
      <parameter type-id='type-id-139' name='cred'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_auth_get_type' mangled-name='gnutls_auth_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_get_type@@GNUTLS_3_4' hash='4fd82c31cd00a170'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-289'/>
    </function-decl>
    <function-decl name='gnutls_auth_server_get_type' mangled-name='gnutls_auth_server_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_server_get_type@@GNUTLS_3_4' hash='4fd82c31cd00a170'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-289'/>
    </function-decl>
    <function-decl name='gnutls_auth_client_get_type' mangled-name='gnutls_auth_client_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_client_get_type@@GNUTLS_3_4' hash='4fd82c31cd00a170'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-289'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <function-type size-in-bits='64' hash='a54f0ded8142b5da' id='type-id-290'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='5d6ca3b591b9b3b3' id='type-id-292'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='anon_ecdh.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='cert.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <enum-decl name='encipher_type' size-in-bits='32' alignment-in-bits='32' hash='3d57ea759aeb26ae' id='type-id-293'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='CIPHER_ENCRYPT' value='0'/>
      <enumerator name='CIPHER_SIGN' value='1'/>
      <enumerator name='CIPHER_IGN' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' hash='20f48f67d968b04b' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-302'/>
    <typedef-decl name='asn1_node_st' type-id='type-id-302' id='type-id-298'/>
    <typedef-decl name='asn1_node' type-id='type-id-299' size-in-bits='64' id='type-id-296'/>
    <typedef-decl name='asn1_node_const' type-id='type-id-301' size-in-bits='64' id='type-id-303'/>
    <function-decl name='asn1_create_element' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_create_element' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='asn1_delete_structure' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_delete_structure' hash='388da3fa973fde78'>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='asn1_der_decoding' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_der_decoding' hash='302b1c359411de9b'>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='asn1_der_decoding_startEnd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_der_decoding_startEnd' hash='b935f3e5a9e36f5d'>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh_common.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-304'/>
    <function-type size-in-bits='64' hash='8b0f9efe608ef9be' id='type-id-305'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dhe.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='dhe_psk.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <qualified-type-def type-id='type-id-307' const='yes' hash='e7f4cab70f548408' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' hash='96a12d1073200749' id='type-id-309'/>
  </abi-instr>
  <abi-instr address-size='64' path='ecdhe.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-310'/>
  </abi-instr>
  <abi-instr address-size='64' path='psk.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='fe95816286dca0ec' id='type-id-311'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='a2ade0c14fa06a4c' id='type-id-313'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-314'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='psk_passwd.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <function-decl name='strncmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__getdelim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__getdelim' hash='7b71dd4ebc9153f9'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-315'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-316'/>
    </function-decl>
    <function-decl name='strchr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='rsa.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-317'/>
  </abi-instr>
  <abi-instr address-size='64' path='rsa_psk.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-318'/>
  </abi-instr>
  <abi-instr address-size='64' path='srp_kx.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <var-decl name='gnutls_srp_1024_group_prime' type-id='type-id-319' mangled-name='gnutls_srp_1024_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1024_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1024_group_generator' type-id='type-id-319' mangled-name='gnutls_srp_1024_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1024_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_prime' type-id='type-id-319' mangled-name='gnutls_srp_1536_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1536_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_generator' type-id='type-id-319' mangled-name='gnutls_srp_1536_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1536_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_prime' type-id='type-id-319' mangled-name='gnutls_srp_2048_group_prime' visibility='default' elf-symbol-id='gnutls_srp_2048_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_generator' type-id='type-id-319' mangled-name='gnutls_srp_2048_group_generator' visibility='default' elf-symbol-id='gnutls_srp_2048_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_generator' type-id='type-id-319' mangled-name='gnutls_srp_3072_group_generator' visibility='default' elf-symbol-id='gnutls_srp_3072_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_prime' type-id='type-id-319' mangled-name='gnutls_srp_3072_group_prime' visibility='default' elf-symbol-id='gnutls_srp_3072_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_4096_group_generator' type-id='type-id-319' mangled-name='gnutls_srp_4096_group_generator' visibility='default' elf-symbol-id='gnutls_srp_4096_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_4096_group_prime' type-id='type-id-319' mangled-name='gnutls_srp_4096_group_prime' visibility='default' elf-symbol-id='gnutls_srp_4096_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_8192_group_prime' type-id='type-id-319' mangled-name='gnutls_srp_8192_group_prime' visibility='default' elf-symbol-id='gnutls_srp_8192_group_prime@@GNUTLS_3_6_2'/>
    <var-decl name='gnutls_srp_8192_group_generator' type-id='type-id-319' mangled-name='gnutls_srp_8192_group_generator' visibility='default' elf-symbol-id='gnutls_srp_8192_group_generator@@GNUTLS_3_6_2'/>
  </abi-instr>
  <abi-instr address-size='64' path='srp_sb64.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <function-decl name='gnutls_srp_base64_encode' mangled-name='gnutls_srp_base64_encode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode@@GNUTLS_3_4' hash='3879923815fe87a1'>
      <parameter type-id='type-id-320' name='data'/>
      <parameter type-id='type-id-11' name='result'/>
      <parameter type-id='type-id-321' name='result_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_srp_base64_encode2' mangled-name='gnutls_srp_base64_encode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode2@@GNUTLS_3_4' hash='a0b599347322591e'>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vko_gost.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/auth' language='LANG_C11'>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-325'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-324'/>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-326'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-325' size-in-bits='64' id='type-id-322'/>
    <function-decl name='asn1_get_length_der' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_get_length_der' hash='685e6e5d860b2326'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='asn1_length_der' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_length_der' hash='93d85b8fa98d64c1'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='auto-verify.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <function-decl name='gnutls_session_set_verify_cert' mangled-name='gnutls_session_set_verify_cert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert@@GNUTLS_3_4' hash='73138550b7b8fc99'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-1' name='hostname'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_cert2' mangled-name='gnutls_session_set_verify_cert2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert2@@GNUTLS_3_4' hash='5a445b1bf697ba9e'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-328' name='data'/>
      <parameter type-id='type-id-3' name='elements'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_session_get_verify_cert_status' mangled-name='gnutls_session_get_verify_cert_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_verify_cert_status@@GNUTLS_3_4' hash='511e44bd8c71dde2'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='buffers.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-330'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-332'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-9' id='type-id-333'/>
    <function-decl name='gnutls_record_check_pending' mangled-name='gnutls_record_check_pending' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_pending@@GNUTLS_3_4' hash='b76fca20ae81f949'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_record_check_corked' mangled-name='gnutls_record_check_corked' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_corked@@GNUTLS_3_4' hash='b76fca20ae81f949'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='qsort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='qsort' hash='3aa907ea60dd12ba'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-332'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='nanosleep' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nanosleep' hash='24fa78417dbe0814'>
      <parameter type-id='type-id-334'/>
      <parameter type-id='type-id-335'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='6645373101ed756d' id='type-id-329'>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-331'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='6668baab5275d4c5' id='type-id-336'>
      <parameter type-id='type-id-333'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='c013aa17bfe204e4' id='type-id-337'>
      <parameter type-id='type-id-333'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-338'/>
    </function-type>
    <function-type size-in-bits='64' hash='ab6e934b439d66a0' id='type-id-339'>
      <parameter type-id='type-id-335'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-rawpk.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <function-decl name='gnutls_certificate_set_rawpk_key_mem' mangled-name='gnutls_certificate_set_rawpk_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_mem@@GNUTLS_3_6_6' hash='2a68260bb5a10fb4'>
      <parameter type-id='type-id-340' name='cred'/>
      <parameter type-id='type-id-320' name='spki'/>
      <parameter type-id='type-id-320' name='pkey'/>
      <parameter type-id='type-id-341' name='format'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-3' name='key_usage'/>
      <parameter type-id='type-id-342' name='names'/>
      <parameter type-id='type-id-3' name='names_length'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_rawpk_key_file' mangled-name='gnutls_certificate_set_rawpk_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_file@@GNUTLS_3_6_6' hash='4cdd5ba38818cfa6'>
      <parameter type-id='type-id-340' name='cred'/>
      <parameter type-id='type-id-1' name='rawpkfile'/>
      <parameter type-id='type-id-1' name='privkeyfile'/>
      <parameter type-id='type-id-341' name='format'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-3' name='key_usage'/>
      <parameter type-id='type-id-342' name='names'/>
      <parameter type-id='type-id-3' name='names_length'/>
      <parameter type-id='type-id-3' name='privkey_flags'/>
      <parameter type-id='type-id-3' name='pkcs11_flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='a9a1a97e1c86638f' id='type-id-343'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-x509.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <class-decl name='gnutls_pkcs12_int' is-struct='yes' visibility='default' size-in-bits='128' hash='0cb99a5dd46d7321' id='type-id-345'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pkcs12' type-id='type-id-346' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expanded' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_pkcs12_t' type-id='type-id-347' size-in-bits='64' hash='7ad1a3559642f6ff' id='type-id-348'/>
    <qualified-type-def type-id='type-id-349' const='yes' hash='3678b77232660d9d' id='type-id-350'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' hash='d564c564543b8b19' id='type-id-351'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' hash='eefadbea8a8d5b6b' id='type-id-353'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' hash='7ad1a3559642f6ff' id='type-id-347'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' hash='e0c317f80f2a42e3' id='type-id-354'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' hash='998e33d2ad915f0a' id='type-id-355'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-358'/>
    <class-decl name='gnutls_x509_trust_list_st' is-struct='yes' visibility='default' size-in-bits='704' hash='ddbff3faa7de1268' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='node' type-id='type-id-360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x509_rdn_sequence' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='distrusted' type-id='type-id-361' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='distrusted_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='keep_certs' type-id='type-id-361' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='keep_certs_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pkcs11_token' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='issuer_callback' type-id='type-id-362' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='usr_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem' mangled-name='gnutls_certificate_set_x509_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem@@GNUTLS_3_4' hash='b8c54ba15a5d6a3b'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-320' name='cert'/>
      <parameter type-id='type-id-320' name='key'/>
      <parameter type-id='type-id-341' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem2' mangled-name='gnutls_certificate_set_x509_key_mem2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem2@@GNUTLS_3_4' hash='e54786806492574c'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-320' name='cert'/>
      <parameter type-id='type-id-320' name='key'/>
      <parameter type-id='type-id-341' name='type'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key' mangled-name='gnutls_certificate_set_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key@@GNUTLS_3_4' hash='0a23ad665eedac4b'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-361' name='cert_list'/>
      <parameter type-id='type-id-4' name='cert_list_size'/>
      <parameter type-id='type-id-363' name='key'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_key' mangled-name='gnutls_certificate_get_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_key@@GNUTLS_3_4' hash='c633a7b67833b8d1'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-3' name='index'/>
      <parameter type-id='type-id-364' name='key'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_crt' mangled-name='gnutls_certificate_get_x509_crt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_crt@@GNUTLS_3_4' hash='217401737a91223c'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-3' name='index'/>
      <parameter type-id='type-id-365' name='crt_list'/>
      <parameter type-id='type-id-239' name='crt_list_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_trust_list' mangled-name='gnutls_certificate_set_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_trust_list@@GNUTLS_3_4' hash='57ae28efad5fd7bb'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-366' name='tlist'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_trust_list' mangled-name='gnutls_certificate_get_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_trust_list@@GNUTLS_3_4' hash='bd477ec8428ff143'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-367' name='tlist'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file' mangled-name='gnutls_certificate_set_x509_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file@@GNUTLS_3_4' hash='c744b848c17fa8c5'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-1' name='certfile'/>
      <parameter type-id='type-id-1' name='keyfile'/>
      <parameter type-id='type-id-341' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file2' mangled-name='gnutls_certificate_set_x509_key_file2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file2@@GNUTLS_3_4' hash='aa2cb8c2160b00e6'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-1' name='certfile'/>
      <parameter type-id='type-id-1' name='keyfile'/>
      <parameter type-id='type-id-341' name='type'/>
      <parameter type-id='type-id-1' name='pass'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_mem' mangled-name='gnutls_certificate_set_x509_trust_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_mem@@GNUTLS_3_4' hash='af2d40eb6f45d7f7'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-320' name='CRL'/>
      <parameter type-id='type-id-341' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust' mangled-name='gnutls_certificate_set_x509_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust@@GNUTLS_3_4' hash='c9f2b0cc5858260d'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-361' name='ca_list'/>
      <parameter type-id='type-id-4' name='ca_list_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_file' mangled-name='gnutls_certificate_set_x509_trust_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_file@@GNUTLS_3_4' hash='0e4bf159c3548f7d'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-1' name='crlfile'/>
      <parameter type-id='type-id-341' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_dir' mangled-name='gnutls_certificate_set_x509_trust_dir' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_dir@@GNUTLS_3_4' hash='0e4bf159c3548f7d'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-1' name='crlfile'/>
      <parameter type-id='type-id-341' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_system_trust' mangled-name='gnutls_certificate_set_x509_system_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_system_trust@@GNUTLS_3_4' hash='6a019862fe88c36a'>
      <parameter type-id='type-id-340'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_mem' mangled-name='gnutls_certificate_set_x509_crl_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_mem@@GNUTLS_3_4' hash='af2d40eb6f45d7f7'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-320' name='CRL'/>
      <parameter type-id='type-id-341' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl' mangled-name='gnutls_certificate_set_x509_crl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl@@GNUTLS_3_4' hash='c8d2e2e72cbd6d58'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-355' name='crl_list'/>
      <parameter type-id='type-id-4' name='crl_list_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_file' mangled-name='gnutls_certificate_set_x509_crl_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_file@@GNUTLS_3_4' hash='0e4bf159c3548f7d'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-1' name='crlfile'/>
      <parameter type-id='type-id-341' name='type'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_file' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_file@@GNUTLS_3_4' hash='283175e46cee1b02'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-1' name='pkcs12file'/>
      <parameter type-id='type-id-341' name='type'/>
      <parameter type-id='type-id-1' name='password'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_mem' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_mem@@GNUTLS_3_4' hash='9c8c5fc2ffd138d6'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-320' name='p12blob'/>
      <parameter type-id='type-id-341' name='type'/>
      <parameter type-id='type-id-1' name='password'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_crls' mangled-name='gnutls_certificate_free_crls' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_crls@@GNUTLS_3_4' hash='e4c5e6f13ae7cc91'>
      <parameter type-id='type-id-340' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_pin_function' mangled-name='gnutls_certificate_set_pin_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_pin_function@@GNUTLS_3_4' hash='f7cc443a2fa176d5'>
      <parameter type-id='type-id-340' name='cred'/>
      <parameter type-id='type-id-368' name='fn'/>
      <parameter type-id='type-id-9' name='userdata'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='asn1_node_st' type-id='type-id-358' id='type-id-356'/>
    <typedef-decl name='asn1_node' type-id='type-id-357' size-in-bits='64' id='type-id-346'/>
    <function-decl name='memmem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmem' hash='91495cdf6321a116'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' hash='4d27b725a092dee9' id='type-id-369'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-370'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='099f7db076f5b688' id='type-id-371'>
      <parameter type-id='type-id-372'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='97a0ca1cd595c19b' id='type-id-373'>
      <parameter type-id='type-id-370'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b373145b305b8d81' id='type-id-374'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='91495cdf6321a116' id='type-id-375'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <class-decl name='gnutls_certificate_credentials_st' is-struct='yes' visibility='default' size-in-bits='3200' hash='1e36581cae5af8b6' id='type-id-376'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dh_params' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='deinit_dh_params' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dh_sec_param' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='params_func' type-id='type-id-268' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='certs' type-id='type-id-377' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ncerts' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sorted_cert_idx' type-id='type-id-239' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tlist' type-id='type-id-366' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='verify_flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='verify_depth' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='verify_bits' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='legacy_cert_cb1' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='legacy_cert_cb2' type-id='type-id-379' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='get_cert_callback3' type-id='type-id-380' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='verify_callback' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pin' type-id='type-id-278' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pin_tmp' type-id='type-id-382' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='glob_ocsp_func' type-id='type-id-383' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='glob_ocsp_func_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tls13_ok' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_x509_trust_list_getissuer_function' type-id='type-id-384' size-in-bits='64' id='type-id-385'/>
    <qualified-type-def type-id='type-id-370' const='yes' hash='0903d3106d998103' id='type-id-352'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' hash='0696e8a360c7412a' id='type-id-386'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' hash='5204661a8497b92c' id='type-id-388'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' hash='7aa8ca87a5436331' id='type-id-365'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' hash='6c0c2a82be935797' id='type-id-362'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' hash='a95c11e35afecdb1' id='type-id-367'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' hash='9875daa8c83294ad' id='type-id-360'/>
    <class-decl name='gnutls_pkcs11_privkey_st' is-struct='yes' visibility='default' size-in-bits='3392' hash='785d6de1fb4b324a' id='type-id-390'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk_algorithm' type-id='type-id-244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_ok' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uinfo' type-id='type-id-391' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='url' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sinfo' type-id='type-id-392' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='ref' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='reauth' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='mutex' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='pin' type-id='type-id-278' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='node_st' is-struct='yes' visibility='default' size-in-bits='384' hash='b369821f94a02e5d' id='type-id-389'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trusted_cas' type-id='type-id-361' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trusted_ca_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='named_certs' type-id='type-id-394' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='named_cert_size' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='crls' type-id='type-id-355' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='crl_size' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_certificate_set_key' mangled-name='gnutls_certificate_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_key@@GNUTLS_3_4' hash='54b355747b3257fb'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-342' name='names'/>
      <parameter type-id='type-id-4' name='names_size'/>
      <parameter type-id='type-id-395' name='pcert_list'/>
      <parameter type-id='type-id-4' name='pcert_list_size'/>
      <parameter type-id='type-id-372' name='key'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_keys' mangled-name='gnutls_certificate_free_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_keys@@GNUTLS_3_4' hash='e4c5e6f13ae7cc91'>
      <parameter type-id='type-id-340' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_cas' mangled-name='gnutls_certificate_free_cas' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_cas@@GNUTLS_3_4' hash='e4c5e6f13ae7cc91'>
      <parameter type-id='type-id-340' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_issuer' mangled-name='gnutls_certificate_get_issuer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_issuer@@GNUTLS_3_4' hash='71ea9704bbf94605'>
      <parameter type-id='type-id-340' name='sc'/>
      <parameter type-id='type-id-370' name='cert'/>
      <parameter type-id='type-id-361' name='issuer'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_crt_raw' mangled-name='gnutls_certificate_get_crt_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_crt_raw@@GNUTLS_3_4' hash='bdb73713874752da'>
      <parameter type-id='type-id-340' name='sc'/>
      <parameter type-id='type-id-3' name='idx1'/>
      <parameter type-id='type-id-3' name='idx2'/>
      <parameter type-id='type-id-306' name='cert'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_ca_names' mangled-name='gnutls_certificate_free_ca_names' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_ca_names@@GNUTLS_3_4' hash='e4c5e6f13ae7cc91'>
      <parameter type-id='type-id-340' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_credentials' mangled-name='gnutls_certificate_free_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_credentials@@GNUTLS_3_4' hash='e4c5e6f13ae7cc91'>
      <parameter type-id='type-id-340' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_allocate_credentials' mangled-name='gnutls_certificate_allocate_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_allocate_credentials@@GNUTLS_3_4' hash='13495d1d6332d65d'>
      <parameter type-id='type-id-386' name='res'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_server_set_request' mangled-name='gnutls_certificate_server_set_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_server_set_request@@GNUTLS_3_4' hash='287ba1f0bee1fd3c'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-396' name='req'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function' mangled-name='gnutls_certificate_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function@@GNUTLS_3_4' hash='110e2b176196ba2c'>
      <parameter type-id='type-id-340' name='cred'/>
      <parameter type-id='type-id-378' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function2' mangled-name='gnutls_certificate_set_retrieve_function2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function2@@GNUTLS_3_4' hash='67c64bb7fccc0726'>
      <parameter type-id='type-id-340' name='cred'/>
      <parameter type-id='type-id-379' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function3' mangled-name='gnutls_certificate_set_retrieve_function3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function3@@GNUTLS_3_6_3' hash='39a924d7e6b16d18'>
      <parameter type-id='type-id-340' name='cred'/>
      <parameter type-id='type-id-380' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_function' mangled-name='gnutls_certificate_set_verify_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_function@@GNUTLS_3_4' hash='08500e4451e895c5'>
      <parameter type-id='type-id-340' name='cred'/>
      <parameter type-id='type-id-381' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_getissuer_function' mangled-name='gnutls_x509_trust_list_set_getissuer_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_getissuer_function@@GNUTLS_3_7_0' hash='12530c772966cf07'>
      <parameter type-id='type-id-366' name='tlist'/>
      <parameter type-id='type-id-362' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_ptr' mangled-name='gnutls_x509_trust_list_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_ptr@@GNUTLS_3_7_0' hash='a37a52b216c24f4c'>
      <parameter type-id='type-id-366' name='tlist'/>
      <parameter type-id='type-id-9' name='ptr'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_get_ptr' mangled-name='gnutls_x509_trust_list_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_get_ptr@@GNUTLS_3_7_0' hash='a37a52b216c24f4c'>
      <parameter type-id='type-id-366' name='tlist'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_output_function' mangled-name='gnutls_session_set_verify_output_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_output_function@@GNUTLS_3_7_0' hash='40343009b8f2d3a1'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-397' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verification_status_print' mangled-name='gnutls_certificate_verification_status_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verification_status_print@@GNUTLS_3_4' hash='fa2b6a117920810f'>
      <parameter type-id='type-id-3' name='status'/>
      <parameter type-id='type-id-225' name='type'/>
      <parameter type-id='type-id-306' name='out'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_dh_params' mangled-name='gnutls_certificate_set_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_dh_params@@GNUTLS_3_4' hash='c72c336e8295c31f'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-267' name='dh_params'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_known_dh_params' mangled-name='gnutls_certificate_set_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_known_dh_params@@GNUTLS_3_4' hash='2a922be19a746d4a'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-261' name='sec_param'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='a9148156dab783d0' id='type-id-384'>
      <parameter type-id='type-id-366'/>
      <parameter type-id='type-id-352'/>
      <parameter type-id='type-id-365'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='f5e64fab25db3e20' id='type-id-398'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-399'/>
      <parameter type-id='type-id-400'/>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='15571bb0225572d6' id='type-id-403'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-400'/>
      <parameter type-id='type-id-239'/>
      <parameter type-id='type-id-402'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='bea3bf56d1bdf74e' id='type-id-404'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-405'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='e753c3c7b6ba69aa' id='type-id-406'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='df03b7777be166bf' id='type-id-407'>
      <parameter type-id='type-id-370'/>
      <parameter type-id='type-id-370'/>
      <parameter type-id='type-id-349'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-session.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <enum-decl name='gnutls_ocsp_verify_reason_t' size-in-bits='32' alignment-in-bits='32' hash='b1de86b3499aa8de' id='type-id-408'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_NOT_FOUND' value='1'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_KEYUSAGE_ERROR' value='2'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_UNTRUSTED_SIGNER' value='4'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_INSECURE_ALGORITHM' value='8'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNATURE_FAILURE' value='16'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_NOT_ACTIVATED' value='32'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_EXPIRED' value='64'/>
    </enum-decl>
    <class-decl name='gnutls_x509_tlsfeatures_st' is-struct='yes' visibility='default' size-in-bits='1056' hash='3e0a1f4cf6dfa362' id='type-id-409'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='feature' type-id='type-id-410' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='size' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_ocsp_resp_const_t' type-id='type-id-411' size-in-bits='64' hash='a29157d2632c75c9' id='type-id-412'/>
    <typedef-decl name='gnutls_ocsp_resp_t' type-id='type-id-413' size-in-bits='64' hash='648be3e1b116828a' id='type-id-414'/>
    <typedef-decl name='gnutls_ocsp_verify_reason_t' type-id='type-id-408' size-in-bits='32' alignment-in-bits='32' hash='b1de86b3499aa8de' id='type-id-415'/>
    <typedef-decl name='gnutls_x509_tlsfeatures_t' type-id='type-id-416' size-in-bits='64' hash='47e7a47884bdf4dc' id='type-id-417'/>
    <array-type-def dimensions='1' type-id='type-id-109' size-in-bits='1024' hash='d89bc86a7671afc2' id='type-id-410'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-131'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-418' const='yes' hash='5d644f75b51c51db' id='type-id-419'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' hash='a29157d2632c75c9' id='type-id-411'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' hash='648be3e1b116828a' id='type-id-413'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' hash='0712032f619283c4' id='type-id-420'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' hash='47e7a47884bdf4dc' id='type-id-416'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' hash='6a3102c179d79f9f' id='type-id-421'/>
    <class-decl name='gnutls_ocsp_resp_int' is-struct='yes' visibility='default' size-in-bits='448' hash='3abc6e54e0c20e44' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resp' type-id='type-id-422' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response_type_oid' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='basicresp' type-id='type-id-422' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='der' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_certificate_get_ours' mangled-name='gnutls_certificate_get_ours' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_ours@@GNUTLS_3_4' hash='a9323b1f65814079'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-320'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_peers' mangled-name='gnutls_certificate_get_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_peers@@GNUTLS_3_4' hash='661fea3dbc1052bd'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-239' name='list_size'/>
      <return type-id='type-id-320'/>
    </function-decl>
    <function-decl name='gnutls_certificate_client_get_request_status' mangled-name='gnutls_certificate_client_get_request_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_client_get_request_status@@GNUTLS_3_4' hash='511e44bd8c71dde2'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_params_function' mangled-name='gnutls_certificate_set_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_params_function@@GNUTLS_3_4' hash='75d92047cbd8271e'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-268' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_flags' mangled-name='gnutls_certificate_set_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_flags@@GNUTLS_3_4' hash='219c8345f71dfae3'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_flags' mangled-name='gnutls_certificate_set_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_flags@@GNUTLS_3_4' hash='219c8345f71dfae3'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_verify_flags' mangled-name='gnutls_certificate_get_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_verify_flags@@GNUTLS_3_4' hash='0026aea2424987ff'>
      <parameter type-id='type-id-340' name='res'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_limits' mangled-name='gnutls_certificate_set_verify_limits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_limits@@GNUTLS_3_4' hash='b8d5555ac3f244de'>
      <parameter type-id='type-id-340' name='res'/>
      <parameter type-id='type-id-3' name='max_bits'/>
      <parameter type-id='type-id-3' name='max_depth'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers2' mangled-name='gnutls_certificate_verify_peers2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers2@@GNUTLS_3_4' hash='816ef8b21721c699'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers3' mangled-name='gnutls_certificate_verify_peers3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers3@@GNUTLS_3_4' hash='404bac15a9bb7b29'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-1' name='hostname'/>
      <parameter type-id='type-id-239' name='status'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers' mangled-name='gnutls_certificate_verify_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers@@GNUTLS_3_4' hash='0ddb0385f60497db'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_expiration_time_peers' mangled-name='gnutls_certificate_expiration_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_expiration_time_peers@@GNUTLS_3_4' hash='90aab0690c80fda3'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-423'/>
    </function-decl>
    <function-decl name='gnutls_certificate_activation_time_peers' mangled-name='gnutls_certificate_activation_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_activation_time_peers@@GNUTLS_3_4' hash='90aab0690c80fda3'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-423'/>
    </function-decl>
    <function-type size-in-bits='64' hash='dfbf0d86b5e56f45' id='type-id-424'>
      <parameter type-id='type-id-425'/>
      <return type-id='type-id-423'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cipher-cbc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='cipher.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <enum-decl name='gnutls_rnd_level' size-in-bits='32' alignment-in-bits='32' hash='80fb2266ac304593' id='type-id-426'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='GNUTLS_RND_NONCE' value='0'/>
      <enumerator name='GNUTLS_RND_RANDOM' value='1'/>
      <enumerator name='GNUTLS_RND_KEY' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_aead_cipher_hd_t' type-id='type-id-427' size-in-bits='64' hash='21461b2f7347d8bb' id='type-id-428'/>
    <typedef-decl name='gnutls_calloc_function' type-id='type-id-429' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-430'/>
    <typedef-decl name='gnutls_rnd_level_t' type-id='type-id-426' size-in-bits='32' alignment-in-bits='32' hash='80fb2266ac304593' id='type-id-431'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' hash='21461b2f7347d8bb' id='type-id-427'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' hash='03ccef9ef124a523' id='type-id-434'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-429'/>
  </abi-instr>
  <abi-instr address-size='64' path='cipher_int.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <class-decl name='gnutls_crypto_cipher_st' is-struct='yes' naming-typedef-id='type-id-435' visibility='default' size-in-bits='768' hash='e63197b9210a96a0' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init' type-id='type-id-437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='setkey' type-id='type-id-438' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='setiv' type-id='type-id-439' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='getiv' type-id='type-id-440' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='encrypt' type-id='type-id-441' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='decrypt' type-id='type-id-442' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='aead_encrypt' type-id='type-id-443' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='aead_decrypt' type-id='type-id-444' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='deinit' type-id='type-id-445' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='auth' type-id='type-id-446' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tag' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='exists' type-id='type-id-448' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_aead_decrypt_func' type-id='type-id-449' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-444'/>
    <typedef-decl name='gnutls_cipher_aead_encrypt_func' type-id='type-id-449' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-443'/>
    <typedef-decl name='gnutls_cipher_auth_func' type-id='type-id-450' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-446'/>
    <typedef-decl name='gnutls_cipher_decrypt_func' type-id='type-id-451' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-442'/>
    <typedef-decl name='gnutls_cipher_deinit_func' type-id='type-id-452' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-445'/>
    <typedef-decl name='gnutls_cipher_encrypt_func' type-id='type-id-451' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-441'/>
    <typedef-decl name='gnutls_cipher_getiv_func' type-id='type-id-450' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-440'/>
    <typedef-decl name='gnutls_cipher_init_func' type-id='type-id-453' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-437'/>
    <typedef-decl name='gnutls_cipher_setiv_func' type-id='type-id-450' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-439'/>
    <typedef-decl name='gnutls_cipher_setkey_func' type-id='type-id-450' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-438'/>
    <typedef-decl name='gnutls_cipher_tag_func' type-id='type-id-454' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-447'/>
    <typedef-decl name='gnutls_crypto_cipher_st' type-id='type-id-436' size-in-bits='768' id='type-id-435'/>
    <qualified-type-def type-id='type-id-435' const='yes' hash='428a3d85d35163bf' id='type-id-455'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' hash='f68c466e0a13b7d4' id='type-id-456'/>
    <qualified-type-def type-id='type-id-457' const='yes' hash='b897af4d74909d3d' id='type-id-458'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' hash='aac2cfbde973c8a9' id='type-id-459'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-448'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-453'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' hash='69b28dbc0a7d2b9d' id='type-id-460'/>
  </abi-instr>
  <abi-instr address-size='64' path='compress.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <enum-decl name='BrotliDecoderResult' naming-typedef-id='type-id-461' size-in-bits='32' alignment-in-bits='32' hash='5e558d479fbb97dd' id='type-id-462'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='BROTLI_DECODER_RESULT_ERROR' value='0'/>
      <enumerator name='BROTLI_DECODER_RESULT_SUCCESS' value='1'/>
      <enumerator name='BROTLI_DECODER_RESULT_NEEDS_MORE_INPUT' value='2'/>
      <enumerator name='BROTLI_DECODER_RESULT_NEEDS_MORE_OUTPUT' value='3'/>
    </enum-decl>
    <enum-decl name='BrotliEncoderMode' size-in-bits='32' alignment-in-bits='32' hash='2a18ef7a9948bbce' id='type-id-463'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='BROTLI_MODE_GENERIC' value='0'/>
      <enumerator name='BROTLI_MODE_TEXT' value='1'/>
      <enumerator name='BROTLI_MODE_FONT' value='2'/>
    </enum-decl>
    <typedef-decl name='BrotliDecoderResult' type-id='type-id-462' size-in-bits='32' alignment-in-bits='32' hash='5e558d479fbb97dd' id='type-id-461'/>
    <typedef-decl name='BrotliEncoderMode' type-id='type-id-463' size-in-bits='32' alignment-in-bits='32' hash='2a18ef7a9948bbce' id='type-id-464'/>
    <qualified-type-def type-id='type-id-465' const='yes' hash='1b4ffb02bac7a9d5' id='type-id-466'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' hash='3a39eea3b42424d6' id='type-id-467'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-321'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='d9e2f19705735211#2' id='type-id-468'/>
    <function-decl name='gnutls_compression_get_name' mangled-name='gnutls_compression_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_name@@GNUTLS_3_4' hash='54b0697d5d937a6c'>
      <parameter type-id='type-id-465' name='algorithm'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_compression_get_id' mangled-name='gnutls_compression_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_id@@GNUTLS_3_4' hash='e2bc16cca4329c3d'>
      <parameter type-id='type-id-1' name='name'/>
      <return type-id='type-id-465'/>
    </function-decl>
    <function-decl name='gnutls_compression_list' mangled-name='gnutls_compression_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_list@@GNUTLS_3_4' hash='fdd3b77604b99670'>
      <return type-id='type-id-467'/>
    </function-decl>
    <function-decl name='strcasecmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcasecmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='constate.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' hash='c70b02b4fa0c5785' id='type-id-470'/>
    <function-decl name='gnutls_handshake_set_secret_function' mangled-name='gnutls_handshake_set_secret_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_set_secret_function@@GNUTLS_3_7_0' hash='c4f233f2152a0536'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-471' name='func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='6af6194d47a18ff4' id='type-id-472'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-473'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='526e7560c155d13e' id='type-id-474'>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-api.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <class-decl name='api_cipher_hd_st' is-struct='yes' visibility='default' size-in-bits='1536' hash='8ef4e021676a0652' id='type-id-475'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-469' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctx_dec' type-id='type-id-469' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_crypto_kdf_st' is-struct='yes' naming-typedef-id='type-id-476' visibility='default' size-in-bits='192' hash='15f0d208502e064b' id='type-id-477'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hkdf_extract' type-id='type-id-478' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hkdf_expand' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pbkdf2' type-id='type-id-480' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iov_iter_st' is-struct='yes' visibility='default' size-in-bits='896' hash='963d6c840d373a47' id='type-id-481'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov' type-id='type-id-482' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov_index' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iov_offset' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='block' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='block_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='block_offset' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_hd_t' type-id='type-id-483' size-in-bits='64' hash='2097b6d1a8dafa40' id='type-id-484'/>
    <typedef-decl name='gnutls_crypto_kdf_st' type-id='type-id-477' size-in-bits='192' id='type-id-476'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' hash='2097b6d1a8dafa40' id='type-id-483'/>
    <qualified-type-def type-id='type-id-485' const='yes' hash='ef741c8c36c570a5' id='type-id-486'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' hash='991e093d665c7958' id='type-id-487'/>
    <qualified-type-def type-id='type-id-476' const='yes' hash='2345668472789d2d' id='type-id-488'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' hash='40b4efc1439df08b' id='type-id-489'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' hash='c704ea777ccb0637' id='type-id-490'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' hash='e22debb0c8710389' id='type-id-491'/>
    <pointer-type-def type-id='type-id-492' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-480'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-478'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-479'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' hash='e50cae6732f09e88' id='type-id-495'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' hash='5c14970df355af8b' id='type-id-496'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-498'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-504'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-501'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-503'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-502' size-in-bits='64' id='type-id-497'/>
    <typedef-decl name='gnutls_hmac_hd_t' type-id='type-id-504' size-in-bits='64' id='type-id-499'/>
    <function-decl name='gnutls_cipher_init' mangled-name='gnutls_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_init@@GNUTLS_3_4' hash='fbddb9f481bddbe6'>
      <parameter type-id='type-id-491' name='handle'/>
      <parameter type-id='type-id-137' name='cipher'/>
      <parameter type-id='type-id-320' name='key'/>
      <parameter type-id='type-id-320' name='iv'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_tag' mangled-name='gnutls_cipher_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_tag@@GNUTLS_3_4' hash='d6a67795698b6bf1'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_add_auth' mangled-name='gnutls_cipher_add_auth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_add_auth@@GNUTLS_3_4' hash='d6a67795698b6bf1'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_set_iv' mangled-name='gnutls_cipher_set_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_set_iv@@GNUTLS_3_4' hash='ae31e17b104d16a0'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='iv'/>
      <parameter type-id='type-id-2' name='ivlen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_cipher_get_iv' mangled-name='_gnutls_cipher_get_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_cipher_get_iv@@GNUTLS_FIPS140_3_4' hash='d6a67795698b6bf1'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt' mangled-name='gnutls_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt@@GNUTLS_3_4' hash='d6a67795698b6bf1'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt' mangled-name='gnutls_cipher_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt@@GNUTLS_3_4' hash='d6a67795698b6bf1'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt2' mangled-name='gnutls_cipher_encrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt2@@GNUTLS_3_4' hash='fb54c0da9297efa2'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-9' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt2' mangled-name='gnutls_cipher_decrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt2@@GNUTLS_3_4' hash='fb54c0da9297efa2'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-9' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt3' mangled-name='gnutls_cipher_encrypt3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt3@@GNUTLS_3_7_7' hash='9c167e66b5059f4b'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-9' name='ptext'/>
      <parameter type-id='type-id-321' name='ptext_len'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt3' mangled-name='gnutls_cipher_decrypt3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt3@@GNUTLS_3_7_7' hash='9c167e66b5059f4b'>
      <parameter type-id='type-id-484' name='handle'/>
      <parameter type-id='type-id-9' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-9' name='ptext'/>
      <parameter type-id='type-id-321' name='ptext_len'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_cipher_deinit' mangled-name='gnutls_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_deinit@@GNUTLS_3_4' hash='96c0b4359ea411f9'>
      <parameter type-id='type-id-484' name='handle'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hmac_init' mangled-name='gnutls_hmac_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_init@@GNUTLS_3_4' hash='a9326a6ad0802169'>
      <parameter type-id='type-id-500' name='dig'/>
      <parameter type-id='type-id-214' name='algorithm'/>
      <parameter type-id='type-id-9' name='key'/>
      <parameter type-id='type-id-2' name='keylen'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hmac_set_nonce' mangled-name='gnutls_hmac_set_nonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_set_nonce@@GNUTLS_3_4' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-499' name='handle'/>
      <parameter type-id='type-id-9' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hmac' mangled-name='gnutls_hmac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac@@GNUTLS_3_4' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-499' name='handle'/>
      <parameter type-id='type-id-9' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hmac_output' mangled-name='gnutls_hmac_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_output@@GNUTLS_3_4' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-499' name='handle'/>
      <parameter type-id='type-id-9' name='digest'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hmac_deinit' mangled-name='gnutls_hmac_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_deinit@@GNUTLS_3_4' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-499' name='handle'/>
      <parameter type-id='type-id-9' name='digest'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_len' mangled-name='gnutls_hmac_get_len' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_len@@GNUTLS_3_4' hash='3e84e4f8fa40f2c6'>
      <parameter type-id='type-id-214' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_key_size' mangled-name='gnutls_hmac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_key_size@@GNUTLS_3_6_12' hash='3e84e4f8fa40f2c6'>
      <parameter type-id='type-id-214' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_hmac_fast' mangled-name='gnutls_hmac_fast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_fast@@GNUTLS_3_4' hash='a2b3ddb1503e89b6'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hmac_copy' mangled-name='gnutls_hmac_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_copy@@GNUTLS_3_6_9' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-499' name='handle'/>
      <return type-id='type-id-499'/>
    </function-decl>
    <function-decl name='gnutls_hash_init' mangled-name='gnutls_hash_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_init@@GNUTLS_3_4' hash='744b0d6a323696fe'>
      <parameter type-id='type-id-323'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hash' mangled-name='gnutls_hash' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash@@GNUTLS_3_4' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hash_output' mangled-name='gnutls_hash_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_output@@GNUTLS_3_4' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hash_deinit' mangled-name='gnutls_hash_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_deinit@@GNUTLS_3_4' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hash_fast' mangled-name='gnutls_hash_fast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_fast@@GNUTLS_3_4' hash='1fac5d49c2e3738d'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hash_copy' mangled-name='gnutls_hash_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_copy@@GNUTLS_3_6_9' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-497' name='handle'/>
      <return type-id='type-id-497'/>
    </function-decl>
    <function-decl name='gnutls_hash_squeeze' mangled-name='gnutls_hash_squeeze' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_squeeze@@GNUTLS_3_8_6' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_key_generate' mangled-name='gnutls_key_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_key_generate@@GNUTLS_3_4' hash='aed0fbf174f6b4ed'>
      <parameter type-id='type-id-306' name='key'/>
      <parameter type-id='type-id-3' name='key_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_init' mangled-name='gnutls_aead_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_init@@GNUTLS_3_4' hash='11b20befd41879ed'>
      <parameter type-id='type-id-490' name='handle'/>
      <parameter type-id='type-id-137' name='cipher'/>
      <parameter type-id='type-id-320' name='key'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_set_key' mangled-name='gnutls_aead_cipher_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_set_key@@GNUTLS_3_7_5' hash='af4220d112c091c7'>
      <parameter type-id='type-id-428' name='handle'/>
      <parameter type-id='type-id-320' name='key'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decrypt' mangled-name='gnutls_aead_cipher_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_decrypt@@GNUTLS_3_4' hash='c93eddfd43f6694f'>
      <parameter type-id='type-id-428'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encrypt' mangled-name='gnutls_aead_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encrypt@@GNUTLS_3_4' hash='c93eddfd43f6694f'>
      <parameter type-id='type-id-428'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv' mangled-name='gnutls_aead_cipher_encryptv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encryptv@@GNUTLS_3_6_3' hash='c5d58c813fd4018f'>
      <parameter type-id='type-id-428'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-482'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-482'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv2' mangled-name='gnutls_aead_cipher_encryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encryptv2@@GNUTLS_3_6_10' hash='044bf171a9a67916'>
      <parameter type-id='type-id-428' name='handle'/>
      <parameter type-id='type-id-9' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <parameter type-id='type-id-482' name='auth_iov'/>
      <parameter type-id='type-id-4' name='auth_iovcnt'/>
      <parameter type-id='type-id-482' name='iov'/>
      <parameter type-id='type-id-4' name='iovcnt'/>
      <parameter type-id='type-id-9' name='tag'/>
      <parameter type-id='type-id-321' name='tag_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decryptv2' mangled-name='gnutls_aead_cipher_decryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_decryptv2@@GNUTLS_3_6_10' hash='43814dff7cd50905'>
      <parameter type-id='type-id-428' name='handle'/>
      <parameter type-id='type-id-9' name='nonce'/>
      <parameter type-id='type-id-2' name='nonce_len'/>
      <parameter type-id='type-id-482' name='auth_iov'/>
      <parameter type-id='type-id-4' name='auth_iovcnt'/>
      <parameter type-id='type-id-482' name='iov'/>
      <parameter type-id='type-id-4' name='iovcnt'/>
      <parameter type-id='type-id-9' name='tag'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_deinit' mangled-name='gnutls_aead_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_deinit@@GNUTLS_3_4' hash='b2bdf7e1c92a6045'>
      <parameter type-id='type-id-428' name='handle'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_extract' mangled-name='gnutls_hkdf_extract' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_extract@@GNUTLS_3_6_13' hash='ba230646cfe96ec1'>
      <parameter type-id='type-id-214' name='mac'/>
      <parameter type-id='type-id-320' name='key'/>
      <parameter type-id='type-id-320' name='salt'/>
      <parameter type-id='type-id-9' name='output'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_expand' mangled-name='gnutls_hkdf_expand' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_expand@@GNUTLS_3_6_13' hash='c75996436e7baab8'>
      <parameter type-id='type-id-214' name='mac'/>
      <parameter type-id='type-id-320' name='key'/>
      <parameter type-id='type-id-320' name='info'/>
      <parameter type-id='type-id-9' name='output'/>
      <parameter type-id='type-id-2' name='length'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_pbkdf2' mangled-name='gnutls_pbkdf2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pbkdf2@@GNUTLS_3_6_13' hash='e3900f2931a15382'>
      <parameter type-id='type-id-214' name='mac'/>
      <parameter type-id='type-id-320' name='key'/>
      <parameter type-id='type-id-320' name='salt'/>
      <parameter type-id='type-id-3' name='iter_count'/>
      <parameter type-id='type-id-9' name='output'/>
      <parameter type-id='type-id-2' name='length'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='16b5e0cb82a97923' id='type-id-492'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='a2b3ddb1503e89b6' id='type-id-493'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b3c79690b2805221' id='type-id-494'>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-505'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-backend.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <function-decl name='gnutls_crypto_register_cipher' mangled-name='gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_cipher@@GNUTLS_3_4' hash='d31bae9e84390b60'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <parameter type-id='type-id-4' name='priority'/>
      <parameter type-id='type-id-437' name='init'/>
      <parameter type-id='type-id-438' name='setkey'/>
      <parameter type-id='type-id-439' name='setiv'/>
      <parameter type-id='type-id-441' name='encrypt'/>
      <parameter type-id='type-id-442' name='decrypt'/>
      <parameter type-id='type-id-445' name='deinit'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_gnutls_crypto_register_cipher' mangled-name='_gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_crypto_register_cipher@@GNUTLS_PRIVATE_3_4' hash='d31bae9e84390b60'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <parameter type-id='type-id-4' name='priority'/>
      <parameter type-id='type-id-437' name='init'/>
      <parameter type-id='type-id-438' name='setkey'/>
      <parameter type-id='type-id-439' name='setiv'/>
      <parameter type-id='type-id-441' name='encrypt'/>
      <parameter type-id='type-id-442' name='decrypt'/>
      <parameter type-id='type-id-445' name='deinit'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_aead_cipher' mangled-name='gnutls_crypto_register_aead_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_aead_cipher@@GNUTLS_3_4' hash='e4f107a54fc68894'>
      <parameter type-id='type-id-137' name='algorithm'/>
      <parameter type-id='type-id-4' name='priority'/>
      <parameter type-id='type-id-437' name='init'/>
      <parameter type-id='type-id-438' name='setkey'/>
      <parameter type-id='type-id-443' name='aead_encrypt'/>
      <parameter type-id='type-id-444' name='aead_decrypt'/>
      <parameter type-id='type-id-445' name='deinit'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_mac' mangled-name='gnutls_crypto_register_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_mac@@GNUTLS_3_4' hash='b7fb55f659331f32'>
      <parameter type-id='type-id-214' name='algorithm'/>
      <parameter type-id='type-id-4' name='priority'/>
      <parameter type-id='type-id-506' name='init'/>
      <parameter type-id='type-id-507' name='setkey'/>
      <parameter type-id='type-id-508' name='setnonce'/>
      <parameter type-id='type-id-509' name='hash'/>
      <parameter type-id='type-id-510' name='output'/>
      <parameter type-id='type-id-511' name='deinit'/>
      <parameter type-id='type-id-512' name='hash_fast'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_digest' mangled-name='gnutls_crypto_register_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_digest@@GNUTLS_3_4' hash='da5bd87bf6d43208'>
      <parameter type-id='type-id-212' name='algorithm'/>
      <parameter type-id='type-id-4' name='priority'/>
      <parameter type-id='type-id-513' name='init'/>
      <parameter type-id='type-id-514' name='hash'/>
      <parameter type-id='type-id-515' name='output'/>
      <parameter type-id='type-id-516' name='deinit'/>
      <parameter type-id='type-id-517' name='hash_fast'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests-pk.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' hash='9b7077adf88e44a6' id='type-id-519'/>
    <class-decl name='gnutls_privkey_st' is-struct='yes' visibility='default' size-in-bits='896' hash='649d9b79c375da4c' id='type-id-520'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-521' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pk_algorithm' type-id='type-id-244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-522' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='flags' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pin' type-id='type-id-278' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pubkey_st' is-struct='yes' visibility='default' size-in-bits='4416' hash='a6e5abd3658b6994' id='type-id-523'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='params' type-id='type-id-276' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='key_usage' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='pin' type-id='type-id-278' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-524'/>
    <function-decl name='gnutls_pk_self_test' mangled-name='gnutls_pk_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_self_test@@GNUTLS_FIPS140_3_4' hash='8e4560b5b5380e6a'>
      <parameter type-id='type-id-3' name='flags'/>
      <parameter type-id='type-id-244' name='pk'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-484' const='yes' hash='5a7b62cf180963a8' id='type-id-525'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-529'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-530'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-532'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-531' size-in-bits='64' id='type-id-526'/>
    <typedef-decl name='gnutls_hmac_hd_t' type-id='type-id-533' size-in-bits='64' id='type-id-528'/>
    <function-decl name='gnutls_cipher_self_test' mangled-name='gnutls_cipher_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_self_test@@GNUTLS_FIPS140_3_4' hash='7bd0e475b0ff4252'>
      <parameter type-id='type-id-3' name='flags'/>
      <parameter type-id='type-id-137' name='cipher'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_mac_self_test' mangled-name='gnutls_mac_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_self_test@@GNUTLS_FIPS140_3_4' hash='9f65ea78d3549b94'>
      <parameter type-id='type-id-3' name='flags'/>
      <parameter type-id='type-id-214' name='mac'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_digest_self_test' mangled-name='gnutls_digest_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_self_test@@GNUTLS_FIPS140_3_4' hash='4548119d8a7253d8'>
      <parameter type-id='type-id-3' name='flags'/>
      <parameter type-id='type-id-212' name='digest'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_self_test' mangled-name='gnutls_hkdf_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_self_test@@GNUTLS_FIPS140_3_4' hash='9f65ea78d3549b94'>
      <parameter type-id='type-id-3' name='flags'/>
      <parameter type-id='type-id-214' name='mac'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_pbkdf2_self_test' mangled-name='gnutls_pbkdf2_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pbkdf2_self_test@@GNUTLS_FIPS140_3_4' hash='9f65ea78d3549b94'>
      <parameter type-id='type-id-3' name='flags'/>
      <parameter type-id='type-id-214' name='mac'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_tlsprf_self_test' mangled-name='gnutls_tlsprf_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_tlsprf_self_test@@GNUTLS_FIPS140_3_4' hash='9f65ea78d3549b94'>
      <parameter type-id='type-id-3' name='flags'/>
      <parameter type-id='type-id-214' name='mac'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='datum.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='db.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <function-decl name='gnutls_db_set_retrieve_function' mangled-name='gnutls_db_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_retrieve_function@@GNUTLS_3_4' hash='c4f233f2152a0536'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-534' name='retr_func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_db_set_remove_function' mangled-name='gnutls_db_set_remove_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_remove_function@@GNUTLS_3_4' hash='c4f233f2152a0536'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-535' name='rem_func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_db_set_store_function' mangled-name='gnutls_db_set_store_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_store_function@@GNUTLS_3_4' hash='c4f233f2152a0536'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-536' name='store_func'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_db_set_ptr' mangled-name='gnutls_db_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_ptr@@GNUTLS_3_4' hash='5da33de99a09b407'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-9' name='ptr'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_db_get_ptr' mangled-name='gnutls_db_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_ptr@@GNUTLS_3_4' hash='5da33de99a09b407'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gnutls_db_set_cache_expiration' mangled-name='gnutls_db_set_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_cache_expiration@@GNUTLS_3_4' hash='69ce4c4fa4914cf7'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-4' name='seconds'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_db_get_default_cache_expiration' mangled-name='gnutls_db_get_default_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_default_cache_expiration@@GNUTLS_3_4' hash='2bb88322482ae81c'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry' mangled-name='gnutls_db_check_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry@@GNUTLS_3_4' hash='3a4bb4746da568d9'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-287' name='session_entry'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_time' mangled-name='gnutls_db_check_entry_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_time@@GNUTLS_3_4' hash='3591037e92c2afea'>
      <parameter type-id='type-id-306' name='entry'/>
      <return type-id='type-id-423'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_expire_time' mangled-name='gnutls_db_check_entry_expire_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_expire_time@@GNUTLS_3_6_5' hash='3591037e92c2afea'>
      <parameter type-id='type-id-306' name='entry'/>
      <return type-id='type-id-423'/>
    </function-decl>
    <function-decl name='gnutls_db_remove_session' mangled-name='gnutls_db_remove_session' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_remove_session@@GNUTLS_3_4' hash='5da33de99a09b407'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-537'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-287'/>
      <return type-id='type-id-287'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-538'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-287'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-539'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-287'/>
      <parameter type-id='type-id-287'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='debug.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <function-decl name='gnutls_handshake_description_get_name' mangled-name='gnutls_handshake_description_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_description_get_name@@GNUTLS_3_4' hash='4d6f0aae8359374f'>
      <parameter type-id='type-id-540'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh-primes.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <var-decl name='gnutls_ffdhe_2048_group_prime' type-id='type-id-319' mangled-name='gnutls_ffdhe_2048_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_2048_group_q' type-id='type-id-319' mangled-name='gnutls_ffdhe_2048_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_2048_group_generator' type-id='type-id-319' mangled-name='gnutls_ffdhe_2048_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_2048_key_bits' type-id='type-id-541' mangled-name='gnutls_ffdhe_2048_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_key_bits@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_3072_group_prime' type-id='type-id-319' mangled-name='gnutls_ffdhe_3072_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_3072_group_q' type-id='type-id-319' mangled-name='gnutls_ffdhe_3072_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_3072_group_generator' type-id='type-id-319' mangled-name='gnutls_ffdhe_3072_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_3072_key_bits' type-id='type-id-541' mangled-name='gnutls_ffdhe_3072_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_key_bits@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_4096_group_prime' type-id='type-id-319' mangled-name='gnutls_ffdhe_4096_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_4096_group_q' type-id='type-id-319' mangled-name='gnutls_ffdhe_4096_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_4096_group_generator' type-id='type-id-319' mangled-name='gnutls_ffdhe_4096_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_4096_key_bits' type-id='type-id-541' mangled-name='gnutls_ffdhe_4096_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_key_bits@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_6144_group_prime' type-id='type-id-319' mangled-name='gnutls_ffdhe_6144_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_group_prime@@GNUTLS_3_6_4'/>
    <var-decl name='gnutls_ffdhe_6144_group_q' type-id='type-id-319' mangled-name='gnutls_ffdhe_6144_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_6144_group_generator' type-id='type-id-319' mangled-name='gnutls_ffdhe_6144_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_group_generator@@GNUTLS_3_6_4'/>
    <var-decl name='gnutls_ffdhe_6144_key_bits' type-id='type-id-541' mangled-name='gnutls_ffdhe_6144_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_key_bits@@GNUTLS_3_6_4'/>
    <var-decl name='gnutls_ffdhe_8192_group_prime' type-id='type-id-319' mangled-name='gnutls_ffdhe_8192_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_8192_group_q' type-id='type-id-319' mangled-name='gnutls_ffdhe_8192_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_8192_group_generator' type-id='type-id-319' mangled-name='gnutls_ffdhe_8192_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_8192_key_bits' type-id='type-id-541' mangled-name='gnutls_ffdhe_8192_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_key_bits@@GNUTLS_3_4'/>
  </abi-instr>
  <abi-instr address-size='64' path='dh-session.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-542'/>
    <function-decl name='gnutls_dh_set_prime_bits' mangled-name='gnutls_dh_set_prime_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_set_prime_bits@@GNUTLS_3_4' hash='9a6d65f64ff84c5e'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_group' mangled-name='gnutls_dh_get_group' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_group@@GNUTLS_3_4' hash='8b0f9efe608ef9be'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_pubkey' mangled-name='gnutls_dh_get_pubkey' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_pubkey@@GNUTLS_3_4' hash='e753c3c7b6ba69aa'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_secret_bits' mangled-name='gnutls_dh_get_secret_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_secret_bits@@GNUTLS_3_4' hash='3a4bb4746da568d9'>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_prime_bits' mangled-name='gnutls_dh_get_prime_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_prime_bits@@GNUTLS_3_4' hash='3a4bb4746da568d9'>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_peers_public_bits' mangled-name='gnutls_dh_get_peers_public_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_peers_public_bits@@GNUTLS_3_4' hash='3a4bb4746da568d9'>
      <parameter type-id='type-id-223'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <enum-decl name='gnutls_direction_t' naming-typedef-id='type-id-543' size-in-bits='32' alignment-in-bits='32' hash='b2f7009d4948842f' id='type-id-544'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='GNUTLS_IMPORT' value='0'/>
      <enumerator name='GNUTLS_EXPORT' value='1'/>
    </enum-decl>
    <enum-decl name='gnutls_x509_crt_fmt_t' naming-typedef-id='type-id-341' size-in-bits='32' alignment-in-bits='32' hash='2a90723ab146748b' id='type-id-545'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <class-decl name='gnutls_crypto_pk' is-struct='yes' visibility='default' size-in-bits='1024' hash='8b42077709ecb3f7' id='type-id-546'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encrypt' type-id='type-id-547' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='decrypt' type-id='type-id-547' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='decrypt2' type-id='type-id-548' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sign' type-id='type-id-547' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='verify' type-id='type-id-549' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='verify_priv_params' type-id='type-id-550' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='verify_pub_params' type-id='type-id-550' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='generate_keys' type-id='type-id-551' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='generate_params' type-id='type-id-552' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pk_fixup_private_params' type-id='type-id-553' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='derive' type-id='type-id-554' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='encaps' type-id='type-id-555' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='decaps' type-id='type-id-556' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curve_exists' type-id='type-id-557' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='pk_exists' type-id='type-id-558' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='sign_exists' type-id='type-id-559' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_crypto_pk_st' type-id='type-id-546' size-in-bits='1024' id='type-id-560'/>
    <typedef-decl name='gnutls_direction_t' type-id='type-id-544' size-in-bits='32' alignment-in-bits='32' hash='b2f7009d4948842f' id='type-id-543'/>
    <typedef-decl name='gnutls_x509_crt_fmt_t' type-id='type-id-545' size-in-bits='32' alignment-in-bits='32' hash='2a90723ab146748b' id='type-id-341'/>
    <qualified-type-def type-id='type-id-560' const='yes' hash='ac839871a9e6eb50' id='type-id-561'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' hash='cd9145fb832fbeb2' id='type-id-562'/>
    <qualified-type-def type-id='type-id-276' const='yes' hash='43af199aba6844e5' id='type-id-563'/>
    <pointer-type-def type-id='type-id-563' size-in-bits='64' hash='330f28a8d9263ec8' id='type-id-564'/>
    <qualified-type-def type-id='type-id-565' const='yes' hash='62b849904c530806' id='type-id-566'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' hash='4dccb6a361bf5b6e' id='type-id-567'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' hash='4f374f30409e4b51' id='type-id-568'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-557'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-558'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-549'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-548'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-550'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-556'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-547'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-554'/>
    <pointer-type-def type-id='type-id-576' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-555'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-553'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-552'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-551'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-559'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' id='type-id-584'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-585'/>
    <pointer-type-def type-id='type-id-585' size-in-bits='64' id='type-id-586'/>
    <qualified-type-def type-id='type-id-587' const='yes' id='type-id-588'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-589'/>
    <class-decl name='gnutls_anti_replay_st' is-struct='yes' visibility='default' size-in-bits='320' hash='6dcf412e6d8162f2' id='type-id-590'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='window' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start_time' type-id='type-id-591' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='db_add_func' type-id='type-id-592' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='db_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_supplemental_entry_st' is-struct='yes' visibility='default' size-in-bits='256' hash='5313bfe1a1f8ef94' id='type-id-593'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-594' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='supp_recv_func' type-id='type-id-595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supp_send_func' type-id='type-id-596' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='hello_ext_entry_st' is-struct='yes' visibility='default' size-in-bits='640' hash='0090799a6ee224ac' id='type-id-597'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_struct' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tls_id' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gid' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='client_parse_point' type-id='type-id-598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='server_parse_point' type-id='type-id-598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='validity' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recv_func' type-id='type-id-599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_func' type-id='type-id-600' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='deinit_func' type-id='type-id-601' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pack_func' type-id='type-id-602' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unpack_func' type-id='type-id-603' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cannot_be_overriden' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-9' id='type-id-604'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-9' id='type-id-605'/>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-587'/>
    <function-decl name='gnutls_dh_params_import_raw' mangled-name='gnutls_dh_params_import_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw@@GNUTLS_3_4' hash='37dc9ea526ddf2cf'>
      <parameter type-id='type-id-267' name='dh_params'/>
      <parameter type-id='type-id-320' name='prime'/>
      <parameter type-id='type-id-320' name='generator'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_dsa' mangled-name='gnutls_dh_params_import_dsa' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_dsa@@GNUTLS_3_4' hash='712906273d373d43'>
      <parameter type-id='type-id-267' name='dh_params'/>
      <parameter type-id='type-id-363' name='key'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw2' mangled-name='gnutls_dh_params_import_raw2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw2@@GNUTLS_3_4' hash='b97decf20f9c8255'>
      <parameter type-id='type-id-267' name='dh_params'/>
      <parameter type-id='type-id-320' name='prime'/>
      <parameter type-id='type-id-320' name='generator'/>
      <parameter type-id='type-id-3' name='key_bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw3' mangled-name='gnutls_dh_params_import_raw3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw3@@GNUTLS_3_6_8' hash='6a8e18f68f685402'>
      <parameter type-id='type-id-267' name='dh_params'/>
      <parameter type-id='type-id-320' name='prime'/>
      <parameter type-id='type-id-320' name='q'/>
      <parameter type-id='type-id-320' name='generator'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_init' mangled-name='gnutls_dh_params_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_init@@GNUTLS_3_4' hash='e7fcb68f50c0b5ac'>
      <parameter type-id='type-id-568' name='dh_params'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_deinit' mangled-name='gnutls_dh_params_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_deinit@@GNUTLS_3_4' hash='9fac36247ea69e5b'>
      <parameter type-id='type-id-267'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_cpy' mangled-name='gnutls_dh_params_cpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_cpy@@GNUTLS_3_4' hash='dba58d7ba8bc5872'>
      <parameter type-id='type-id-267' name='dst'/>
      <parameter type-id='type-id-267' name='src'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_generate2' mangled-name='gnutls_dh_params_generate2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_generate2@@GNUTLS_3_4' hash='80860f73b1384bf3'>
      <parameter type-id='type-id-267' name='dparams'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_pkcs3' mangled-name='gnutls_dh_params_import_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_pkcs3@@GNUTLS_3_4' hash='843db0866005b436'>
      <parameter type-id='type-id-267' name='params'/>
      <parameter type-id='type-id-320' name='pkcs3_params'/>
      <parameter type-id='type-id-341' name='format'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export_pkcs3' mangled-name='gnutls_dh_params_export_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_pkcs3@@GNUTLS_3_4' hash='70a6592027ac089c'>
      <parameter type-id='type-id-267' name='params'/>
      <parameter type-id='type-id-341' name='format'/>
      <parameter type-id='type-id-236' name='params_data'/>
      <parameter type-id='type-id-321' name='params_data_size'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export2_pkcs3' mangled-name='gnutls_dh_params_export2_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export2_pkcs3@@GNUTLS_3_4' hash='0acbfa46c7903c11'>
      <parameter type-id='type-id-267' name='params'/>
      <parameter type-id='type-id-341' name='format'/>
      <parameter type-id='type-id-306' name='out'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export_raw' mangled-name='gnutls_dh_params_export_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_raw@@GNUTLS_3_4' hash='1a615a71187f6235'>
      <parameter type-id='type-id-267' name='params'/>
      <parameter type-id='type-id-306' name='prime'/>
      <parameter type-id='type-id-306' name='generator'/>
      <parameter type-id='type-id-239' name='bits'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='asn1_node_st' type-id='type-id-589' id='type-id-583'/>
    <typedef-decl name='asn1_node' type-id='type-id-584' size-in-bits='64' id='type-id-581'/>
    <typedef-decl name='asn1_node_const' type-id='type-id-586' size-in-bits='64' id='type-id-606'/>
    <function-decl name='asn1_write_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='asn1_write_value' hash='1d81aff51c388187'>
      <parameter type-id='type-id-581'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='9af467511dba0ee7' id='type-id-569'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b13a08d5d4d702d7' id='type-id-570'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-564'/>
      <parameter type-id='type-id-567'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='53ba43dbc6e7b7f4' id='type-id-571'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-564'/>
      <parameter type-id='type-id-567'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='1dfb950fea64eb31' id='type-id-572'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-564'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='0605e2d2edcf8a1a' id='type-id-573'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='d8a25443b3d02c9f' id='type-id-574'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-564'/>
      <parameter type-id='type-id-567'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='d0a0810429651fb7' id='type-id-575'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-564'/>
      <parameter type-id='type-id-564'/>
      <parameter type-id='type-id-320'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='87eb1ebe028878b4' id='type-id-576'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='d5386c4b52478f54' id='type-id-577'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-543'/>
      <parameter type-id='type-id-607'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='5f89e990d785df22' id='type-id-578'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-607'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='1c849003afc2bf30' id='type-id-579'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-607'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='1aab4f2bf5fa30a4' id='type-id-580'>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='27c0b64081591467' id='type-id-608'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='5a6971d4bf133f57' id='type-id-609'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-473'/>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='075c3e359fe645a4' id='type-id-610'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-473'/>
      <parameter type-id='type-id-540'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='d74486f57a8fca8a' id='type-id-611'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-612'>
      <parameter type-id='type-id-604'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='987b4ed7f5783ce6' id='type-id-613'>
      <parameter type-id='type-id-604'/>
      <parameter type-id='type-id-482'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-338'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dlwrap/brotlidec.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-614'/>
    <function-decl name='dlopen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='dlclose' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlclose' hash='388da3fa973fde78'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dlsym' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlsym' hash='fa9b01215069aed9'>
      <parameter type-id='type-id-614'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-615'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dlwrap/brotlienc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-616'/>
  </abi-instr>
  <abi-instr address-size='64' path='dlwrap/zlib.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-617'/>
  </abi-instr>
  <abi-instr address-size='64' path='dlwrap/zstd.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-618'/>
  </abi-instr>
  <abi-instr address-size='64' path='dtls-sw.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='dtls.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <class-decl name='gnutls_dtls_prestate_st' is-struct='yes' naming-typedef-id='type-id-619' visibility='default' size-in-bits='96' hash='7fe450a1171b32e5' id='type-id-620'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_seq' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hsk_read_seq' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hsk_write_seq' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_dtls_prestate_st' type-id='type-id-620' size-in-bits='96' id='type-id-619'/>
    <pointer-type-def type-id='type-id-619' size-in-bits='64' hash='d13b5e4c91dc52ef' id='type-id-621'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-9' id='type-id-622'/>
    <function-decl name='gnutls_dtls_set_timeouts' mangled-name='gnutls_dtls_set_timeouts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_timeouts@@GNUTLS_3_4' hash='680f91964c0c86b3'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-3' name='retrans_timeout'/>
      <parameter type-id='type-id-3' name='total_timeout'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_mtu' mangled-name='gnutls_dtls_set_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_mtu@@GNUTLS_3_4' hash='9a6d65f64ff84c5e'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-3' name='bits'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_record_overhead' mangled-name='_gnutls_record_overhead' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_record_overhead@@GNUTLS_PRIVATE_3_4' hash='54cb6efca3520f8e'>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-230'/>
      <parameter type-id='type-id-256'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_est_record_overhead_size' mangled-name='gnutls_est_record_overhead_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_est_record_overhead_size@@GNUTLS_3_4' hash='b939be23294cdaec'>
      <parameter type-id='type-id-234' name='version'/>
      <parameter type-id='type-id-137' name='cipher'/>
      <parameter type-id='type-id-214' name='mac'/>
      <parameter type-id='type-id-465' name='comp'/>
      <parameter type-id='type-id-3' name='flags'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_record_overhead_size' mangled-name='gnutls_record_overhead_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_overhead_size@@GNUTLS_3_4' hash='b76fca20ae81f949'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_data_mtu' mangled-name='gnutls_dtls_get_data_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_get_data_mtu@@GNUTLS_3_4' hash='511e44bd8c71dde2'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_data_mtu' mangled-name='gnutls_dtls_set_data_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_data_mtu@@GNUTLS_3_4' hash='484c647563994e7c'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_mtu' mangled-name='gnutls_dtls_get_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_get_mtu@@GNUTLS_3_4' hash='511e44bd8c71dde2'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_timeout' mangled-name='gnutls_dtls_get_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_get_timeout@@GNUTLS_3_4' hash='511e44bd8c71dde2'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_dtls_cookie_send' mangled-name='gnutls_dtls_cookie_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_cookie_send@@GNUTLS_3_4' hash='a5c5ed6dcaa55c5a'>
      <parameter type-id='type-id-306' name='key'/>
      <parameter type-id='type-id-9' name='client_data'/>
      <parameter type-id='type-id-2' name='client_data_size'/>
      <parameter type-id='type-id-621' name='prestate'/>
      <parameter type-id='type-id-622' name='ptr'/>
      <parameter type-id='type-id-623' name='push_func'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dtls_cookie_verify' mangled-name='gnutls_dtls_cookie_verify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_cookie_verify@@GNUTLS_3_4' hash='2ee278c8dd17dd27'>
      <parameter type-id='type-id-306' name='key'/>
      <parameter type-id='type-id-9' name='client_data'/>
      <parameter type-id='type-id-2' name='client_data_size'/>
      <parameter type-id='type-id-9' name='_msg'/>
      <parameter type-id='type-id-2' name='msg_size'/>
      <parameter type-id='type-id-621' name='prestate'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_dtls_prestate_set' mangled-name='gnutls_dtls_prestate_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_prestate_set@@GNUTLS_3_4' hash='de6538e0f0e4284a'>
      <parameter type-id='type-id-223' name='session'/>
      <parameter type-id='type-id-621' name='prestate'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_record_get_discarded' mangled-name='gnutls_record_get_discarded' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_get_discarded@@GNUTLS_3_4' hash='511e44bd8c71dde2'>
      <parameter type-id='type-id-223' name='session'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ecc.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-624'/>
  </abi-instr>
  <abi-instr address-size='64' path='errors.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-625'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-626'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-84' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-28'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-8' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-204'/>
    </array-type-def>
    <enum-decl name='gnutls_bigint_format_t' naming-typedef-id='type-id-627' size-in-bits='32' alignment-in-bits='32' hash='2309865e33b59041' id='type-id-628'>
      <underlying-type type-id='type-id-74'/>
      <enumerator name='GNUTLS_MPI_FORMAT_USG' value='0'/>
      <enumerator name='GNUTLS_MPI_FORMAT_STD' value='1'/>
      <enumerator name='GNUTLS_MPI_FORMAT_ULE' value='2'/>
    </enum-decl>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-90'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' hash='dedab36ee0ea6582' id='type-id-629'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-630' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-631' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='type-id-625' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-90' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-625' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-632' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-633' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-634' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-635' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-631' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='type-id-636' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='type-id-637' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='type-id-28' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-638'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_crypto_bigint' is-struct='yes' visibility='default' size-in-bits='1600' hash='74e316b2e7c5dd27' id='type-id-639'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bigint_init' type-id='type-id-640' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bigint_init_multi' type-id='type-id-641' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bigint_release' type-id='type-id-642' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bigint_clear' type-id='type-id-642' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bigint_cmp' type-id='type-id-643' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bigint_cmp_ui' type-id='type-id-644' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bigint_modm' type-id='type-id-645' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='bigint_set' type-id='type-id-646' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bigint_copy' type-id='type-id-647' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bigint_set_ui' type-id='type-id-648' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bigint_get_nbits' type-id='type-id-649' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='bigint_powm' type-id='type-id-650' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bigint_addm' type-id='type-id-650' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bigint_subm' type-id='type-id-650' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='bigint_mulm' type-id='type-id-650' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='bigint_add' type-id='type-id-645' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bigint_sub' type-id='type-id-645' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='bigint_mul' type-id='type-id-645' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='bigint_add_ui' type-id='type-id-651' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='bigint_sub_ui' type-id='type-id-651' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='bigint_mul_ui' type-id='type-id-651' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bigint_div' type-id='type-id-645' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='bigint_prime_check' type-id='type-id-652' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='bigint_scan' type-id='type-id-653' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='bigint_print' type-id='type-id-654' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-629' size-in-bits='1728' id='type-id-655'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-7' id='type-id-656'/>
    <typedef-decl name='__off64_t' type-id='type-id-29' size-in-bits='64' hash='b119fe0931d2ee10' id='type-id-633'/>
    <typedef-decl name='gnutls_audit_log_func' type-id='type-id-657' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-658'/>
    <typedef-decl name='gnutls_bigint_format_t' type-id='type-id-628' size-in-bits='32' alignment-in-bits='32' hash='2309865e33b59041' id='type-id-627'/>
    <typedef-decl name='gnutls_crypto_bigint_st' type-id='type-id-639' size-in-bits='1600' id='type-id-659'/>
    <typedef-decl name='gnutls_log_func' type-id='type-id-660' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-661'/>
    <pointer-type-def type-id='type-id-655' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-61'/>
    <pointer-type-def type-id='type-id-629' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-631'/>
    <pointer-type-def type-id='type-id-631' size-in-bits='64' hash='e8c018048121152c' id='type-id-636'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-662'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-647'/>
    <pointer-type-def type-id='type-id-664' size-in-bits='64' hash='6c734b28b028ae97' id='type-id-665'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-312'/>
    <qualified-type-def type-id='type-id-312' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-221'/>
    <qualified-type-def type-id='type-id-1' restrict='yes' hash='b7d5472019e79b5f' id='type-id-57'/>
    <pointer-type-def type-id='type-id-666' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-640'/>
    <pointer-type-def type-id='type-id-667' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-641'/>
    <pointer-type-def type-id='type-id-668' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-646'/>
    <pointer-type-def type-id='type-id-669' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-645'/>
    <pointer-type-def type-id='type-id-670' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-650'/>
    <pointer-type-def type-id='type-id-671' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-651'/>
    <pointer-type-def type-id='type-id-672' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-648'/>
    <pointer-type-def type-id='type-id-673' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-653'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-652'/>
    <pointer-type-def type-id='type-id-675' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-643'/>
    <pointer-type-def type-id='type-id-676' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-644'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-654'/>
    <pointer-type-def type-id='type-id-678' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-649'/>
    <pointer-type-def type-id='type-id-679' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-642'/>
    <pointer-type-def type-id='type-id-680' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-657'/>
    <pointer-type-def type-id='type-id-681' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-660'/>
    <pointer-type-def type-id='type-id-682' size-in-bits='64' id='type-id-634'/>
    <pointer-type-def type-id='type-id-656' size-in-bits='64' id='type-id-632'/>
    <pointer-type-def type-id='type-id-683' size-in-bits='64' id='type-id-630'/>
    <pointer-type-def type-id='type-id-684' size-in-bits='64' id='type-id-635'/>
    <qualified-type-def type-id='type-id-664' const='yes' id='type-id-685'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-682'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-683'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-684'/>
    <typedef-decl name='bigint_t' type-id='type-id-9' id='type-id-664'/>
    <function-decl name='gnutls_error_is_fatal' mangled-name='gnutls_error_is_fatal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_is_fatal@@GNUTLS_3_4' hash='d628501fd2223339'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_perror' mangled-name='gnutls_perror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_perror@@GNUTLS_3_4' hash='388da3fa973fde78'>
      <parameter type-id='type-id-4' name='error'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_strerror' mangled-name='gnutls_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror@@GNUTLS_3_4' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gnutls_strerror_name' mangled-name='gnutls_strerror_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror_name@@GNUTLS_3_4' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_log' mangled-name='_gnutls_mpi_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_mpi_log@@GNUTLS_PRIVATE_3_4' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-1' name='prefix'/>
      <parameter type-id='type-id-664' name='a'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_log' mangled-name='_gnutls_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_log@@GNUTLS_PRIVATE_3_4' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <var-decl name='stderr' type-id='type-id-61' visibility='default' elf-symbol-id='stderr'/>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf' hash='31c19dfde3fac410'>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='vasprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vasprintf' hash='cf2e9adf5c1c1adb'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-662'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-663'>
      <parameter type-id='type-id-685'/>
      <return type-id='type-id-664'/>
    </function-type>
    <function-type size-in-bits='64' hash='884db45c04ecdf6e' id='type-id-666'>
      <parameter type-id='type-id-665'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='884db45c04ecdf6e' id='type-id-667'>
      <parameter type-id='type-id-665'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-668'>
      <parameter type-id='type-id-664'/>
      <parameter type-id='type-id-685'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-669'>
      <parameter type-id='type-id-664'/>
      <parameter type-id='type-id-685'/>
      <parameter type-id='type-id-685'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-670'>
      <parameter type-id='type-id-664'/>
      <parameter type-id='type-id-685'/>
      <parameter type-id='type-id-685'/>
      <parameter type-id='type-id-685'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b6a97d07f8261bc0' id='type-id-671'>
      <parameter type-id='type-id-664'/>
      <parameter type-id='type-id-685'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b6a97d07f8261bc0' id='type-id-672'>
      <parameter type-id='type-id-664'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='f8fc250d17bde158' id='type-id-673'>
      <parameter type-id='type-id-664'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-627'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-674'>
      <parameter type-id='type-id-685'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-675'>
      <parameter type-id='type-id-685'/>
      <parameter type-id='type-id-685'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='b6a97d07f8261bc0' id='type-id-676'>
      <parameter type-id='type-id-685'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='363a7a29d8a4f8b3' id='type-id-677'>
      <parameter type-id='type-id-685'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-627'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-678'>
      <parameter type-id='type-id-685'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-679'>
      <parameter type-id='type-id-664'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='27d4c49b91dd2a3a' id='type-id-680'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='e9ea91a7eab8302c' id='type-id-681'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='alpn.c' comp-dir-path='/home/asosedki/code/gnutls/release-3.8.13/lib/ext' language='LANG_C11'>
