<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libgnutls.so.30'>
  <elf-needed>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libtss2-esys.so.0'/>
    <dependency name='libtss2-mu.so.0'/>
    <dependency name='libtss2-tctildr.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.2'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libhogweed.so.6'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_dsa_generate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_generate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gnutls_realloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_secure_malloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_generator' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_prime' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_strdup' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='asnprintf.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='vasnprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cloexec.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='rpl_fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fcntl.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='glthread/lock.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='64' id='type-id-8'>
      <subrange length='8' type-id='type-id-9' id='type-id-10'/>
    </array-type-def>
    <union-decl name='pthread_rwlockattr_t' size-in-bits='64' naming-typedef-id='type-id-11' visibility='default' id='type-id-12'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-13' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_rwlockattr_t' type-id='type-id-12' id='type-id-11'/>
    <qualified-type-def type-id='type-id-11' const='yes' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-15'/>
    <qualified-type-def type-id='type-id-15' restrict='yes' id='type-id-16'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-18'/>
    <qualified-type-def type-id='type-id-19' restrict='yes' id='type-id-20'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-21'/>
    <function-decl name='pthread_mutexattr_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_settype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlock_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_setkind_np' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-9'/>
  </abi-instr>
  <abi-instr address-size='64' path='hash.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='read-file.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <qualified-type-def type-id='type-id-23' restrict='yes' id='type-id-24'/>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='ftello' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vasnprintf.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='1792' id='type-id-31'>
      <subrange length='7' type-id='type-id-9' id='type-id-32'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='4928' id='type-id-34'>
      <subrange length='7' type-id='type-id-9' id='type-id-32'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-35'/>
    <type-decl name='float' size-in-bits='32' id='type-id-36'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-37'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-38'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-39'/>
    <enum-decl name='arg_type' naming-typedef-id='type-id-40' id='type-id-41'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='TYPE_NONE' value='0'/>
      <enumerator name='TYPE_SCHAR' value='1'/>
      <enumerator name='TYPE_UCHAR' value='2'/>
      <enumerator name='TYPE_SHORT' value='3'/>
      <enumerator name='TYPE_USHORT' value='4'/>
      <enumerator name='TYPE_INT' value='5'/>
      <enumerator name='TYPE_UINT' value='6'/>
      <enumerator name='TYPE_LONGINT' value='7'/>
      <enumerator name='TYPE_ULONGINT' value='8'/>
      <enumerator name='TYPE_LONGLONGINT' value='9'/>
      <enumerator name='TYPE_ULONGLONGINT' value='10'/>
      <enumerator name='TYPE_DOUBLE' value='11'/>
      <enumerator name='TYPE_LONGDOUBLE' value='12'/>
      <enumerator name='TYPE_CHAR' value='13'/>
      <enumerator name='TYPE_WIDE_CHAR' value='14'/>
      <enumerator name='TYPE_STRING' value='15'/>
      <enumerator name='TYPE_WIDE_STRING' value='16'/>
      <enumerator name='TYPE_POINTER' value='17'/>
      <enumerator name='TYPE_COUNT_SCHAR_POINTER' value='18'/>
      <enumerator name='TYPE_COUNT_SHORT_POINTER' value='19'/>
      <enumerator name='TYPE_COUNT_INT_POINTER' value='20'/>
      <enumerator name='TYPE_COUNT_LONGINT_POINTER' value='21'/>
      <enumerator name='TYPE_COUNT_LONGLONGINT_POINTER' value='22'/>
    </enum-decl>
    <typedef-decl name='arg_type' type-id='type-id-41' id='type-id-40'/>
    <class-decl name='argument' size-in-bits='256' is-struct='yes' naming-typedef-id='type-id-30' visibility='default' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-44' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-44'>
      <data-member access='public'>
        <var-decl name='a_schar' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uchar' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_short' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ushort' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longint' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulongint' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longlongint' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulonglongint' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_float' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_double' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longdouble' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_char' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_char' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_string' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_string' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_pointer' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_schar_pointer' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_short_pointer' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_pointer' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longint_pointer' type-id='type-id-55' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longlongint_pointer' type-id='type-id-56' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='argument' type-id='type-id-43' id='type-id-30'/>
    <class-decl name='arguments' size-in-bits='1920' is-struct='yes' naming-typedef-id='type-id-57' visibility='default' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='direct_alloc_arg' type-id='type-id-31' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arguments' type-id='type-id-58' id='type-id-57'/>
    <class-decl name='char_directive' size-in-bits='704' is-struct='yes' naming-typedef-id='type-id-33' visibility='default' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='width_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='width_arg_index' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='precision_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='precision_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='precision_arg_index' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conversion' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arg_index' type-id='type-id-26' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='char_directive' type-id='type-id-60' id='type-id-33'/>
    <class-decl name='char_directives' size-in-bits='5184' is-struct='yes' naming-typedef-id='type-id-61' visibility='default' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_width_length' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_precision_length' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='direct_alloc_dir' type-id='type-id-34' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='char_directives' type-id='type-id-62' id='type-id-61'/>
    <typedef-decl name='wint_t' type-id='type-id-49' id='type-id-50'/>
    <typedef-decl name='wchar_t' type-id='type-id-6' id='type-id-64'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-66'/>
    <qualified-type-def type-id='type-id-64' const='yes' id='type-id-67'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-52'/>
    <function-decl name='printf_fetchargs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='printf_parse' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-48'/>
  </abi-instr>
  <abi-instr address-size='64' path='accelerated.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated' language='LANG_C11'>
    <function-decl name='register_x86_crypto' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='2048' id='type-id-69'>
      <subrange length='64' type-id='type-id-9' id='type-id-70'/>
    </array-type-def>
    <class-decl name='AES_KEY' size-in-bits='2080' is-struct='yes' naming-typedef-id='type-id-71' visibility='default' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rd_key' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='rounds' type-id='type-id-68' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AES_KEY' type-id='type-id-72' id='type-id-71'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-73'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-74'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-75'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-76'/>
    <function-decl name='aesni_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='aesni_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='aesni_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='_gnutls_aesni_x86' type-id='type-id-79' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='vpaes_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='vpaes_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='vpaes_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_gnutls_aes_ssse3' type-id='type-id-79' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-ccm-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <typedef-decl name='nettle_cipher_func' type-id='type-id-80' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <function-decl name='aesni_ecb_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_gnutls_aes_ccm_x86_aesni' type-id='type-id-79' visibility='default'/>
    <function-decl name='nettle_ccm_encrypt_message' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_ccm_decrypt_message' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-80'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-85' size-in-bits='32768' id='type-id-86'>
      <subrange length='256' type-id='type-id-9' id='type-id-87'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='128' id='type-id-89'>
      <subrange length='2' type-id='type-id-9' id='type-id-90'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-49' size-in-bits='128' id='type-id-91'>
      <subrange length='4' type-id='type-id-9' id='type-id-92'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='128' id='type-id-93'>
      <subrange length='2' type-id='type-id-9' id='type-id-90'/>
    </array-type-def>
    <class-decl name='padlock_cipher_data' size-in-bits='2336' is-struct='yes' visibility='default' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cword' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ks' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-96'>
      <data-member access='public'>
        <var-decl name='pad' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-97' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rounds' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dgst' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='align' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='ciphr' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='keygen' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='interm' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='encdec' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='ksize' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gcm_key' size-in-bits='32768' is-struct='yes' visibility='default' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h' type-id='type-id-86' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gcm_ctx' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctr' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth_size' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='data_size' type-id='type-id-88' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='nettle_block16' size-in-bits='128' visibility='default' id='type-id-85'>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='w' type-id='type-id-93' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u64' type-id='type-id-89' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-101'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-105'/>
    <var-decl name='_gnutls_aes_gcm_padlock' type-id='type-id-79' visibility='default'/>
    <function-decl name='padlock_aes_cipher_setkey' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='padlock_ecb_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_iv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_gcm_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_gcm_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_gcm_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_gcm_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_x86_aesni' type-id='type-id-79' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul-avx.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='u128' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-106' visibility='default' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hi' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lo' type-id='type-id-88' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u128' type-id='type-id-107' id='type-id-106'/>
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-108'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-110'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-113'/>
    <function-decl name='aesni_ctr32_encrypt_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='aesni_gcm_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='aesni_gcm_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <var-decl name='_gnutls_aes_gcm_pclmul_avx' type-id='type-id-79' visibility='default'/>
    <function-decl name='gcm_init_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gcm_ghash_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gcm_gmult_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_pclmul' type-id='type-id-79' visibility='default'/>
    <function-decl name='gcm_init_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gcm_ghash_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gcm_gmult_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='vpaes_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_gnutls_aes_gcm_x86_ssse3' type-id='type-id-79' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='1664' id='type-id-114'>
      <subrange length='52' type-id='type-id-9' id='type-id-115'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='1920' id='type-id-116'>
      <subrange length='60' type-id='type-id-9' id='type-id-117'/>
    </array-type-def>
    <class-decl name='aes192_ctx' size-in-bits='1664' is-struct='yes' visibility='default' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-114' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='aes256_ctx' size-in-bits='1920' is-struct='yes' visibility='default' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-116' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-121'/>
    <var-decl name='_gnutls_aes_padlock' type-id='type-id-79' visibility='default'/>
    <function-decl name='padlock_reload_key' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nettle_aes192_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_aes192_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-xts-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='aesni_xts_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='aesni_xts_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_gnutls_aes_xts_x86_aesni' type-id='type-id-79' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='160' id='type-id-122'>
      <subrange length='5' type-id='type-id-9' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-68' size-in-bits='256' id='type-id-124'>
      <subrange length='8' type-id='type-id-9' id='type-id-10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='512' id='type-id-125'>
      <subrange length='8' type-id='type-id-9' id='type-id-10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-126' size-in-bits='1024' id='type-id-127'>
      <subrange length='128' type-id='type-id-9' id='type-id-128'/>
    </array-type-def>
    <class-decl name='nettle_hash' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context_size' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='digest_size' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='block_size' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='digest' type-id='type-id-132' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nettle_hash_init_func' type-id='type-id-133' id='type-id-134'/>
    <typedef-decl name='nettle_hash_update_func' type-id='type-id-135' id='type-id-136'/>
    <typedef-decl name='nettle_hash_digest_func' type-id='type-id-137' id='type-id-138'/>
    <class-decl name='sha1_ctx' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-122' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='count' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='index' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='block' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha256_ctx' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-124' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='count' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='index' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha512_ctx' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-125' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='count_low' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='count_high' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='index' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='block' type-id='type-id-127' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-129' const='yes' id='type-id-143'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-147'/>
    <var-decl name='_gnutls_hmac_sha_padlock_oneshot' type-id='type-id-148' visibility='default'/>
    <function-decl name='wrap_padlock_hash_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='padlock_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_gnutls_hmac_sha_padlock' type-id='type-id-148' visibility='default'/>
    <function-decl name='nettle_hmac_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_hmac_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='x86_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='x86_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='x86_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_gnutls_hmac_sha_x86_ssse3' type-id='type-id-148' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='sha-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_sha_padlock_oneshot' type-id='type-id-150' visibility='default'/>
    <function-decl name='padlock_sha1_oneshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_sha256_oneshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_sha1_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_sha256_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_sha512_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='padlock_sha1' type-id='type-id-143' visibility='default'/>
    <var-decl name='padlock_sha224' type-id='type-id-143' visibility='default'/>
    <var-decl name='padlock_sha256' type-id='type-id-143' visibility='default'/>
    <var-decl name='padlock_sha384' type-id='type-id-143' visibility='default'/>
    <var-decl name='padlock_sha512' type-id='type-id-143' visibility='default'/>
    <var-decl name='_gnutls_sha_padlock' type-id='type-id-150' visibility='default'/>
    <function-decl name='nettle_sha1_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha256_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha224_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha512_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha384_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sha-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='x86_sha1' type-id='type-id-143' visibility='default'/>
    <var-decl name='x86_sha224' type-id='type-id-143' visibility='default'/>
    <var-decl name='x86_sha256' type-id='type-id-143' visibility='default'/>
    <var-decl name='x86_sha384' type-id='type-id-143' visibility='default'/>
    <var-decl name='x86_sha512' type-id='type-id-143' visibility='default'/>
    <var-decl name='_gnutls_sha_x86_ssse3' type-id='type-id-150' visibility='default'/>
    <function-decl name='sha1_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='sha256_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='sha512_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha1_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-145'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha256_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha224_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha512_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='nettle_sha384_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='x86-common.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='gnutls_crypto_single_cipher_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_single_mac_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_single_digest_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_priority_update_non_aesni' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='padlock_capability' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-49'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='alert.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_alert_get_strname' mangled-name='gnutls_alert_get_strname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_strname@@GNUTLS_3_4'>
      <parameter type-id='type-id-157' name='alert'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_error_to_alert' mangled-name='gnutls_error_to_alert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_to_alert@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='err'/>
      <parameter type-id='type-id-54' name='level'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_alert_send_appropriate' mangled-name='gnutls_alert_send_appropriate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send_appropriate@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-6' name='err'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert_types.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-160'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <function-decl name='gnutls_certificate_type_list' mangled-name='gnutls_certificate_type_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_list@@GNUTLS_3_4'>
      <return type-id='type-id-161'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphers.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <function-decl name='gnutls_cipher_list' mangled-name='gnutls_cipher_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_list@@GNUTLS_3_4'>
      <return type-id='type-id-163'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphersuites.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <typedef-decl name='gnutls_priority_t' type-id='type-id-164' id='type-id-165'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <function-decl name='_gnutls_kx_needs_dh_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-172'/>
    </function-decl>
    <function-decl name='_gnutls_select_server_cert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-173'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_mac_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_get_name' mangled-name='gnutls_cipher_suite_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-167' name='kx_algorithm'/>
      <parameter type-id='type-id-152' name='cipher_algorithm'/>
      <parameter type-id='type-id-154' name='mac_algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_info' mangled-name='gnutls_cipher_suite_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_info@@GNUTLS_3_4'>
      <parameter type-id='type-id-26' name='idx'/>
      <parameter type-id='type-id-78' name='cs_id'/>
      <parameter type-id='type-id-168' name='kx'/>
      <parameter type-id='type-id-166' name='cipher'/>
      <parameter type-id='type-id-169' name='mac'/>
      <parameter type-id='type-id-171' name='min_version'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_priority_get_cipher_suite_index' mangled-name='gnutls_priority_get_cipher_suite_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_get_cipher_suite_index@@GNUTLS_3_4'>
      <parameter type-id='type-id-165' name='pcache'/>
      <parameter type-id='type-id-49' name='idx'/>
      <parameter type-id='type-id-151' name='sidx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='bool' size-in-bits='8' id='type-id-172'/>
  </abi-instr>
  <abi-instr address-size='64' path='ecc.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <function-decl name='gnutls_ecc_curve_list' mangled-name='gnutls_ecc_curve_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_list@@GNUTLS_3_4'>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='_gnutls_ecc_curve_is_supported' mangled-name='_gnutls_ecc_curve_is_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_ecc_curve_is_supported@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-176' name='curve'/>
      <return type-id='type-id-49'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='groups.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <function-decl name='gnutls_group_list' mangled-name='gnutls_group_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_list@@GNUTLS_3_6_0'>
      <return type-id='type-id-179'/>
    </function-decl>
    <function-decl name='gnutls_group_get_id' mangled-name='gnutls_group_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_id@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-177'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='kx.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-167' const='yes' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <function-decl name='gnutls_kx_list' mangled-name='gnutls_kx_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_list@@GNUTLS_3_4'>
      <return type-id='type-id-181'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mac.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-149' const='yes' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <function-decl name='gnutls_mac_get_key_size' mangled-name='gnutls_mac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_key_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-154' name='algorithm'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_nonce_size' mangled-name='gnutls_mac_get_nonce_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_nonce_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-154' name='algorithm'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='gnutls_mac_list' mangled-name='gnutls_mac_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_list@@GNUTLS_3_4'>
      <return type-id='type-id-185'/>
    </function-decl>
    <function-decl name='gnutls_digest_list' mangled-name='gnutls_digest_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_list@@GNUTLS_3_4'>
      <return type-id='type-id-183'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='protocols.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-186'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <function-decl name='gnutls_protocol_set_enabled' mangled-name='gnutls_protocol_set_enabled' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_set_enabled@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-170' name='version'/>
      <parameter type-id='type-id-49' name='enabled'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_protocol_list' mangled-name='gnutls_protocol_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_list@@GNUTLS_3_4'>
      <return type-id='type-id-187'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='publickey.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_pk_list' mangled-name='gnutls_pk_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_list@@GNUTLS_3_4'>
      <return type-id='type-id-188'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_id' mangled-name='gnutls_pk_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-189'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sign.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <function-decl name='_gnutls_digest_is_insecure2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-172'/>
    </function-decl>
    <function-decl name='gnutls_sign_list' mangled-name='gnutls_sign_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_list@@GNUTLS_3_4'>
      <return type-id='type-id-192'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_oid' mangled-name='gnutls_sign_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-190' name='sign'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon_cred.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_anon_server_credentials_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dh_params' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='deinit_dh_params' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dh_sec_param' type-id='type-id-195' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='params_func' type-id='type-id-196' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_anon_client_credentials_st' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_anon_server_credentials_t' type-id='type-id-198' id='type-id-199'/>
    <typedef-decl name='gnutls_anon_client_credentials_t' type-id='type-id-200' id='type-id-201'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-203'/>
    <function-decl name='gnutls_anon_free_server_credentials' mangled-name='gnutls_anon_free_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='sc'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_server_credentials' mangled-name='gnutls_anon_allocate_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-203' name='sc'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_anon_free_client_credentials' mangled-name='gnutls_anon_free_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-201' name='sc'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_client_credentials' mangled-name='gnutls_anon_allocate_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-202' name='sc'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_dh_params' mangled-name='gnutls_anon_set_server_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='res'/>
      <parameter type-id='type-id-194' name='dh_params'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_known_dh_params' mangled-name='gnutls_anon_set_server_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_known_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='res'/>
      <parameter type-id='type-id-195' name='sec_param'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_params_function' mangled-name='gnutls_anon_set_server_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_params_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-199' name='res'/>
      <parameter type-id='type-id-196' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='atfork.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <var-decl name='_gnutls_forkid' type-id='type-id-49' visibility='default'/>
    <function-decl name='__register_atfork' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-204'/>
      <parameter type-id='type-id-204'/>
      <parameter type-id='type-id-204'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-205'>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='auth.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='dh_info_st' size-in-bits='448' is-struct='yes' naming-typedef-id='type-id-206' visibility='default' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret_bits' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prime' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generator' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='public_key' type-id='type-id-208' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dh_info_st' type-id='type-id-207' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-209'/>
    <function-decl name='_gnutls_free_dh_info' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_credentials_clear' mangled-name='gnutls_credentials_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_clear@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' mangled-name='gnutls_credentials_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-210' name='type'/>
      <parameter type-id='type-id-23' name='cred'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_credentials_get' mangled-name='gnutls_credentials_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-210' name='type'/>
      <parameter type-id='type-id-211' name='cred'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_auth_get_type' mangled-name='gnutls_auth_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-210'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_dh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_dh_common_print_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dh_common_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_figure_dh_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-195'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon_ecdh.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_ecdh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <enum-decl name='encipher_type' id='type-id-214'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='CIPHER_ENCRYPT' value='0'/>
      <enumerator name='CIPHER_SIGN' value='1'/>
      <enumerator name='CIPHER_IGN' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <function-decl name='_gnutls_kx_supports_pk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='_gnutls_kx_supports_pk_usage' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='_gnutls_kx_encipher_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-214'/>
    </function-decl>
    <function-decl name='_gnutls_sign_to_tls_aid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_sign_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_sign_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_verify_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_verify_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh_common.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_set_psk_session_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_dh_set_secret_bits' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_dh_set_peer_public' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_mpi' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dhe.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_cert_server_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_client_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_client_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_server_cert_req' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_cert_cert_req' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_cert_client_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_gen_dhe_signature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dhe_signature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dhe_psk.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <qualified-type-def type-id='type-id-222' const='yes' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-224'/>
    <function-decl name='_gnutls_gen_dh_common_client_kx_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_gen_ecdh_common_client_kx_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_ecdh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_ecdh_common_print_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_ecdh_common_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='rsa_psk.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_psk_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_get_public_rsa_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-225'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='srp_kx.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <class-decl name='SRP_PWD_ENTRY' size-in-bits='576' is-struct='yes' naming-typedef-id='type-id-226' visibility='default' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='username' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='salt' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='g' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='n' type-id='type-id-208' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SRP_PWD_ENTRY' type-id='type-id-227' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <function-decl name='_gnutls_srp_pwd_read_entry' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-229'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_srp_entry_free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='gnutls_srp_8192_group_prime' type-id='type-id-230' mangled-name='gnutls_srp_8192_group_prime' visibility='default' elf-symbol-id='gnutls_srp_8192_group_prime@@GNUTLS_3_6_2'/>
    <var-decl name='gnutls_srp_8192_group_generator' type-id='type-id-230' mangled-name='gnutls_srp_8192_group_generator' visibility='default' elf-symbol-id='gnutls_srp_8192_group_generator@@GNUTLS_3_6_2'/>
    <var-decl name='gnutls_srp_4096_group_prime' type-id='type-id-230' mangled-name='gnutls_srp_4096_group_prime' visibility='default' elf-symbol-id='gnutls_srp_4096_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_4096_group_generator' type-id='type-id-230' mangled-name='gnutls_srp_4096_group_generator' visibility='default' elf-symbol-id='gnutls_srp_4096_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_prime' type-id='type-id-230' mangled-name='gnutls_srp_3072_group_prime' visibility='default' elf-symbol-id='gnutls_srp_3072_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_generator' type-id='type-id-230' mangled-name='gnutls_srp_3072_group_generator' visibility='default' elf-symbol-id='gnutls_srp_3072_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_prime' type-id='type-id-230' mangled-name='gnutls_srp_2048_group_prime' visibility='default' elf-symbol-id='gnutls_srp_2048_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_generator' type-id='type-id-230' mangled-name='gnutls_srp_2048_group_generator' visibility='default' elf-symbol-id='gnutls_srp_2048_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_prime' type-id='type-id-230' mangled-name='gnutls_srp_1536_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1536_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_generator' type-id='type-id-230' mangled-name='gnutls_srp_1536_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1536_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1024_group_prime' type-id='type-id-230' mangled-name='gnutls_srp_1024_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1024_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1024_group_generator' type-id='type-id-230' mangled-name='gnutls_srp_1024_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1024_group_generator@@GNUTLS_3_4'/>
    <function-decl name='_gnutls_calc_srp_B' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='_gnutls_calc_srp_u' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='_gnutls_calc_srp_S1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='_gnutls_calc_srp_A' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='_gnutls_calc_srp_S2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-221'/>
    </function-decl>
    <function-decl name='_gnutls_calc_srp_x' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='srp_passwd.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_sbase64_decode' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-232'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='srp_rsa.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_srp_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_gen_srp_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_srp_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_proc_srp_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='srp_sb64.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='gnutls_srp_base64_encode' mangled-name='gnutls_srp_base64_encode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode@@GNUTLS_3_4'>
      <parameter type-id='type-id-220' name='data'/>
      <parameter type-id='type-id-5' name='result'/>
      <parameter type-id='type-id-2' name='result_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srp_base64_encode2' mangled-name='gnutls_srp_base64_encode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode2@@GNUTLS_3_4'>
      <parameter type-id='type-id-220' name='data'/>
      <parameter type-id='type-id-213' name='result'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srp_base64_decode' mangled-name='gnutls_srp_base64_decode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_decode@@GNUTLS_3_4'>
      <parameter type-id='type-id-220' name='b64_data'/>
      <parameter type-id='type-id-5' name='result'/>
      <parameter type-id='type-id-2' name='result_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srp_base64_decode2' mangled-name='gnutls_srp_base64_decode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_decode2@@GNUTLS_3_4'>
      <parameter type-id='type-id-220' name='b64_data'/>
      <parameter type-id='type-id-213' name='result'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vko_gost.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_ecc_curve_get_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='_gnutls_gost_keytrans_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_gost_keytrans_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='auto-verify.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_certificate_verify_peers2' mangled-name='gnutls_certificate_verify_peers2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers2@@GNUTLS_3_4'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers' mangled-name='gnutls_certificate_verify_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_cert' mangled-name='gnutls_session_set_verify_cert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-3' name='hostname'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_cert2' mangled-name='gnutls_session_set_verify_cert2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert2@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-233' name='data'/>
      <parameter type-id='type-id-49' name='elements'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_session_get_verify_cert_status' mangled-name='gnutls_session_get_verify_cert_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_verify_cert_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-49'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='buffers.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='__compar_fn_t' type-id='type-id-234' id='type-id-235'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-234'/>
    <function-decl name='_gnutls_recv_in_buffers' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='gnutls_system_recv_timeout' mangled-name='gnutls_system_recv_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_system_recv_timeout@@GNUTLS_3_4'>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_mbuffer_dequeue' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='_mbuffer_head_get_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='_mbuffer_head_push_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='system_read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='gnutls_record_check_pending' mangled-name='gnutls_record_check_pending' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_pending@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='gnutls_record_check_corked' mangled-name='gnutls_record_check_corked' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_corked@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_resize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='qsort' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='memcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-236'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-rawpk.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_certificate_set_rawpk_key_mem' mangled-name='gnutls_certificate_set_rawpk_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_mem@@GNUTLS_3_6_6'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-220' name='spki'/>
      <parameter type-id='type-id-220' name='pkey'/>
      <parameter type-id='type-id-244' name='format'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-49' name='key_usage'/>
      <parameter type-id='type-id-245' name='names'/>
      <parameter type-id='type-id-49' name='names_length'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_rawpk_key_file' mangled-name='gnutls_certificate_set_rawpk_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_file@@GNUTLS_3_6_6'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-3' name='rawpkfile'/>
      <parameter type-id='type-id-3' name='privkeyfile'/>
      <parameter type-id='type-id-244' name='format'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-49' name='key_usage'/>
      <parameter type-id='type-id-245' name='names'/>
      <parameter type-id='type-id-49' name='names_length'/>
      <parameter type-id='type-id-49' name='privkey_flags'/>
      <parameter type-id='type-id-49' name='pkcs11_flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_read_key_mem' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_read_key_file' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-x509.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='gnutls_pkcs12_t' type-id='type-id-247' id='type-id-248'/>
    <class-decl name='gnutls_pkcs12_int' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pkcs12' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expanded' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-252'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-256'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-257'/>
    <function-decl name='_gnutls_read_file' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_gnutls_check_key_cert_match' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_export_x509' mangled-name='gnutls_privkey_export_x509' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_export_x509@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-258'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_x509_raw' mangled-name='gnutls_privkey_import_x509_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_import_x509_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_url' mangled-name='gnutls_privkey_import_url' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_import_url@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pcert_import_x509_list' mangled-name='gnutls_pcert_import_x509_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pcert_import_x509_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pcert_export_x509' mangled-name='gnutls_pcert_export_x509' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pcert_export_x509@@GNUTLS_3_4'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-259'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_url_is_supported' mangled-name='gnutls_url_is_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_url_is_supported@@GNUTLS_3_4'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_init' mangled-name='gnutls_pkcs12_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pkcs12_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_deinit' mangled-name='gnutls_pkcs12_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pkcs12_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_import' mangled-name='gnutls_pkcs12_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pkcs12_import@@GNUTLS_3_4'>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_verify_mac' mangled-name='gnutls_pkcs12_verify_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pkcs12_verify_mac@@GNUTLS_3_4'>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_simple_parse' mangled-name='gnutls_pkcs12_simple_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pkcs12_simple_parse@@GNUTLS_3_4'>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_import_url' mangled-name='gnutls_x509_crt_import_url' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_import_url@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_dn_by_oid' mangled-name='gnutls_x509_crt_get_dn_by_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_get_dn_by_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_set_pin_function' mangled-name='gnutls_x509_crt_set_pin_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_set_pin_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_subject_alt_name' mangled-name='gnutls_x509_crt_get_subject_alt_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_get_subject_alt_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crl_init' mangled-name='gnutls_x509_crl_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crl_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crl_deinit' mangled-name='gnutls_x509_crl_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crl_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-251'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_check_issuer' mangled-name='gnutls_x509_crt_check_issuer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_check_issuer@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_cas' mangled-name='gnutls_x509_trust_list_add_cas' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_add_cas@@GNUTLS_3_4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_crls' mangled-name='gnutls_x509_trust_list_add_crls' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_add_crls@@GNUTLS_3_4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_trust_mem' mangled-name='gnutls_x509_trust_list_add_trust_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_add_trust_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_trust_dir' mangled-name='gnutls_x509_trust_list_add_trust_dir' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_add_trust_dir@@GNUTLS_3_4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_x509_crt_cpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_x509_crl_cpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-251'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem' mangled-name='gnutls_certificate_set_x509_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-220' name='cert'/>
      <parameter type-id='type-id-220' name='key'/>
      <parameter type-id='type-id-244' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem2' mangled-name='gnutls_certificate_set_x509_key_mem2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem2@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-220' name='cert'/>
      <parameter type-id='type-id-220' name='key'/>
      <parameter type-id='type-id-244' name='type'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key' mangled-name='gnutls_certificate_set_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-259' name='cert_list'/>
      <parameter type-id='type-id-6' name='cert_list_size'/>
      <parameter type-id='type-id-264' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_key' mangled-name='gnutls_certificate_get_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-49' name='index'/>
      <parameter type-id='type-id-258' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_crt' mangled-name='gnutls_certificate_get_x509_crt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_crt@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-49' name='index'/>
      <parameter type-id='type-id-260' name='crt_list'/>
      <parameter type-id='type-id-151' name='crt_list_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_trust_list' mangled-name='gnutls_certificate_set_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_trust_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-263' name='tlist'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_trust_list' mangled-name='gnutls_certificate_get_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_trust_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-265' name='tlist'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file' mangled-name='gnutls_certificate_set_x509_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-3' name='certfile'/>
      <parameter type-id='type-id-3' name='keyfile'/>
      <parameter type-id='type-id-244' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file2' mangled-name='gnutls_certificate_set_x509_key_file2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file2@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-3' name='certfile'/>
      <parameter type-id='type-id-3' name='keyfile'/>
      <parameter type-id='type-id-244' name='type'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_mem' mangled-name='gnutls_certificate_set_x509_trust_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-220' name='ca'/>
      <parameter type-id='type-id-244' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust' mangled-name='gnutls_certificate_set_x509_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-259' name='ca_list'/>
      <parameter type-id='type-id-6' name='ca_list_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_file' mangled-name='gnutls_certificate_set_x509_trust_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-3' name='cafile'/>
      <parameter type-id='type-id-244' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_dir' mangled-name='gnutls_certificate_set_x509_trust_dir' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_dir@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-3' name='ca_dir'/>
      <parameter type-id='type-id-244' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_system_trust' mangled-name='gnutls_certificate_set_x509_system_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_system_trust@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='cred'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_mem' mangled-name='gnutls_certificate_set_x509_crl_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-220' name='CRL'/>
      <parameter type-id='type-id-244' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl' mangled-name='gnutls_certificate_set_x509_crl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-257' name='crl_list'/>
      <parameter type-id='type-id-6' name='crl_list_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_file' mangled-name='gnutls_certificate_set_x509_crl_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-3' name='crlfile'/>
      <parameter type-id='type-id-244' name='type'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_file' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-3' name='pkcs12file'/>
      <parameter type-id='type-id-244' name='type'/>
      <parameter type-id='type-id-3' name='password'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_mem' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-220' name='p12blob'/>
      <parameter type-id='type-id-244' name='type'/>
      <parameter type-id='type-id-3' name='password'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_crls' mangled-name='gnutls_certificate_free_crls' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_crls@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='sc'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_pin_function' mangled-name='gnutls_certificate_set_pin_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_pin_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-262' name='fn'/>
      <parameter type-id='type-id-23' name='userdata'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_certificate_credential_append_keypair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_url_is_known' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_get_raw_issuer' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-265'/>
    <typedef-decl name='gnutls_x509_crl_t' type-id='type-id-267' id='type-id-251'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-267'/>
    <class-decl name='gnutls_x509_crl_int' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crl' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expanded' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rcache' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rcache_idx' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='use_extensions' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='der' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='raw_issuer_dn' type-id='type-id-208' visibility='default'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='node_st' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trusted_cas' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trusted_ca_size' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='named_certs' type-id='type-id-270' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='named_cert_size' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='crls' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='crl_size' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_x509_trust_list_getissuer_function' type-id='type-id-271' id='type-id-272'/>
    <qualified-type-def type-id='type-id-261' const='yes' id='type-id-254'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-276'/>
    <function-decl name='_gnutls13_sign_get_compatible_with_privkey' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-277'/>
    </function-decl>
    <function-decl name='gnutls_pubkey_get_pk_algorithm' mangled-name='gnutls_pubkey_get_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pubkey_get_pk_algorithm@@GNUTLS_3_4'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pubkey_verify_data2' mangled-name='gnutls_pubkey_verify_data2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pubkey_verify_data2@@GNUTLS_3_4'>
      <parameter type-id='type-id-278'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_init' mangled-name='gnutls_privkey_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_deinit' mangled-name='gnutls_privkey_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_privkey_set_pin_function' mangled-name='gnutls_privkey_set_pin_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_set_pin_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_privkey_get_pk_algorithm' mangled-name='gnutls_privkey_get_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_get_pk_algorithm@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_pkcs11' mangled-name='gnutls_privkey_import_pkcs11' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_import_pkcs11@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_x509' mangled-name='gnutls_privkey_import_x509' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_import_x509@@GNUTLS_3_4'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_privkey_sign_data2' mangled-name='gnutls_privkey_sign_data2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_privkey_sign_data2@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pcert_import_x509' mangled-name='gnutls_pcert_import_x509' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pcert_import_x509@@GNUTLS_3_4'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pcert_deinit' mangled-name='gnutls_pcert_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pcert_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pk_bits_to_sec_param' mangled-name='gnutls_pk_bits_to_sec_param' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_bits_to_sec_param@@GNUTLS_3_4'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-195'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_name' mangled-name='gnutls_pk_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_pk_to_sign' mangled-name='gnutls_pk_to_sign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_to_sign@@GNUTLS_3_4'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-190'/>
    </function-decl>
    <function-decl name='gnutls_idna_map' mangled-name='gnutls_idna_map' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_idna_map@@GNUTLS_3_4'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_init' mangled-name='gnutls_x509_crt_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-259'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_deinit' mangled-name='gnutls_x509_crt_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_import' mangled-name='gnutls_x509_crt_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_import@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_init' mangled-name='gnutls_x509_trust_list_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_deinit' mangled-name='gnutls_x509_trust_list_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_get_issuer' mangled-name='gnutls_x509_trust_list_get_issuer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_get_issuer@@GNUTLS_3_4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_reallocarray_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_key' mangled-name='gnutls_certificate_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-245' name='names'/>
      <parameter type-id='type-id-6' name='names_size'/>
      <parameter type-id='type-id-217' name='pcert_list'/>
      <parameter type-id='type-id-6' name='pcert_list_size'/>
      <parameter type-id='type-id-218' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_keys' mangled-name='gnutls_certificate_free_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_keys@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='sc'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_cas' mangled-name='gnutls_certificate_free_cas' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_cas@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='sc'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_issuer' mangled-name='gnutls_certificate_get_issuer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_issuer@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='sc'/>
      <parameter type-id='type-id-261' name='cert'/>
      <parameter type-id='type-id-259' name='issuer'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_crt_raw' mangled-name='gnutls_certificate_get_crt_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_crt_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='sc'/>
      <parameter type-id='type-id-49' name='idx1'/>
      <parameter type-id='type-id-49' name='idx2'/>
      <parameter type-id='type-id-213' name='cert'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_ca_names' mangled-name='gnutls_certificate_free_ca_names' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_ca_names@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='sc'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_credentials' mangled-name='gnutls_certificate_free_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='sc'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_allocate_credentials' mangled-name='gnutls_certificate_allocate_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_allocate_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-273' name='res'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_server_set_request' mangled-name='gnutls_certificate_server_set_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_server_set_request@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-280' name='req'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function' mangled-name='gnutls_certificate_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-281' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function2' mangled-name='gnutls_certificate_set_retrieve_function2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function2@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-282' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function3' mangled-name='gnutls_certificate_set_retrieve_function3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function3@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-283' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_function' mangled-name='gnutls_certificate_set_verify_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='cred'/>
      <parameter type-id='type-id-284' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_getissuer_function' mangled-name='gnutls_x509_trust_list_set_getissuer_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_getissuer_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-263' name='tlist'/>
      <parameter type-id='type-id-275' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_ptr' mangled-name='gnutls_x509_trust_list_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_ptr@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-263' name='tlist'/>
      <parameter type-id='type-id-23' name='ptr'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_get_ptr' mangled-name='gnutls_x509_trust_list_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_get_ptr@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-263' name='tlist'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_output_function' mangled-name='gnutls_session_set_verify_output_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_output_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-285' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verification_status_print' mangled-name='gnutls_certificate_verification_status_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verification_status_print@@GNUTLS_3_4'>
      <parameter type-id='type-id-49' name='status'/>
      <parameter type-id='type-id-159' name='type'/>
      <parameter type-id='type-id-213' name='out'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_dh_params' mangled-name='gnutls_certificate_set_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-194' name='dh_params'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_known_dh_params' mangled-name='gnutls_certificate_set_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_known_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-195' name='sec_param'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_get_x509_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-271'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-254'/>
      <parameter type-id='type-id-260'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-session.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_ocsp_resp_int' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resp' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response_type_oid' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='basicresp' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='der' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-287' size-in-bits='1024' id='type-id-288'>
      <subrange length='64' type-id='type-id-9' id='type-id-70'/>
    </array-type-def>
    <enum-decl name='gnutls_ocsp_verify_reason_t' id='type-id-289'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_NOT_FOUND' value='1'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_KEYUSAGE_ERROR' value='2'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_UNTRUSTED_SIGNER' value='4'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_INSECURE_ALGORITHM' value='8'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNATURE_FAILURE' value='16'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_NOT_ACTIVATED' value='32'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_EXPIRED' value='64'/>
    </enum-decl>
    <typedef-decl name='gnutls_ocsp_verify_reason_t' type-id='type-id-289' id='type-id-290'/>
    <typedef-decl name='gnutls_ocsp_resp_t' type-id='type-id-291' id='type-id-292'/>
    <typedef-decl name='gnutls_ocsp_resp_const_t' type-id='type-id-293' id='type-id-294'/>
    <typedef-decl name='gnutls_x509_tlsfeatures_t' type-id='type-id-295' id='type-id-296'/>
    <class-decl name='gnutls_x509_tlsfeatures_st' size-in-bits='1056' is-struct='yes' visibility='default' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='feature' type-id='type-id-288' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='size' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-286' const='yes' id='type-id-298'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-295'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-300'/>
    <function-decl name='gnutls_ocsp_status_request_get2' mangled-name='gnutls_ocsp_status_request_get2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_status_request_get2@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_init' mangled-name='gnutls_ocsp_resp_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_deinit' mangled-name='gnutls_ocsp_resp_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-292'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_import' mangled-name='gnutls_ocsp_resp_import' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_import@@GNUTLS_3_4'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_get_status' mangled-name='gnutls_ocsp_resp_get_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_get_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-294'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_get_single' mangled-name='gnutls_ocsp_resp_get_single' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_get_single@@GNUTLS_3_4'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-301'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_verify_direct' mangled-name='gnutls_ocsp_resp_verify_direct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_verify_direct@@GNUTLS_3_4'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_verify' mangled-name='gnutls_ocsp_resp_verify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_verify@@GNUTLS_3_4'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_check_crt' mangled-name='gnutls_ocsp_resp_check_crt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ocsp_resp_check_crt@@GNUTLS_3_4'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_activation_time' mangled-name='gnutls_x509_crt_get_activation_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_get_activation_time@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_expiration_time' mangled-name='gnutls_x509_crt_get_expiration_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_get_expiration_time@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='gnutls_x509_tlsfeatures_init' mangled-name='gnutls_x509_tlsfeatures_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_tlsfeatures_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-300'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_tlsfeatures_deinit' mangled-name='gnutls_x509_tlsfeatures_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_tlsfeatures_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-296'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_x509_tlsfeatures_get' mangled-name='gnutls_x509_tlsfeatures_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_tlsfeatures_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_tlsfeatures' mangled-name='gnutls_x509_crt_get_tlsfeatures' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_crt_get_tlsfeatures@@GNUTLS_3_4'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_verify_crt2' mangled-name='gnutls_x509_trust_list_verify_crt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_verify_crt2@@GNUTLS_3_4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-151'/>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_client_get_request_status' mangled-name='gnutls_certificate_client_get_request_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_client_get_request_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_params_function' mangled-name='gnutls_certificate_set_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_params_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-196' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_flags' mangled-name='gnutls_certificate_set_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_flags' mangled-name='gnutls_certificate_set_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_verify_flags' mangled-name='gnutls_certificate_get_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_verify_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_limits' mangled-name='gnutls_certificate_set_verify_limits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_limits@@GNUTLS_3_4'>
      <parameter type-id='type-id-243' name='res'/>
      <parameter type-id='type-id-49' name='max_bits'/>
      <parameter type-id='type-id-49' name='max_depth'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers3' mangled-name='gnutls_certificate_verify_peers3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers3@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-3' name='hostname'/>
      <parameter type-id='type-id-151' name='status'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_certificate_expiration_time_peers' mangled-name='gnutls_certificate_expiration_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_expiration_time_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='gnutls_certificate_activation_time_peers' mangled-name='gnutls_certificate_activation_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_activation_time_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='_gnutls_ocsp_verify_status_to_str' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cipher-cbc.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='_gnutls_make_preamble' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cipher.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='gnutls_aead_cipher_hd_t' type-id='type-id-305' id='type-id-306'/>
    <enum-decl name='gnutls_rnd_level' id='type-id-307'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='GNUTLS_RND_NONCE' value='0'/>
      <enumerator name='GNUTLS_RND_RANDOM' value='1'/>
      <enumerator name='GNUTLS_RND_KEY' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_rnd_level_t' type-id='type-id-307' id='type-id-308'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-2'/>
    <function-decl name='_gnutls_auth_cipher_add_auth' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_encrypt2_tag' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_decrypt2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_tag' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decrypt' mangled-name='gnutls_aead_cipher_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_decrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv' mangled-name='gnutls_aead_cipher_encryptv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encryptv@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_rnd' mangled-name='gnutls_rnd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_rnd@@GNUTLS_3_4'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_memcmp' mangled-name='gnutls_memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_memcmp@@GNUTLS_3_4'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='cbc_mac_verify' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-313'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nettle_memxor' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cipher_int.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_crypto_cipher_st' size-in-bits='768' is-struct='yes' naming-typedef-id='type-id-314' visibility='default' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init' type-id='type-id-316' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='setkey' type-id='type-id-317' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='setiv' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='getiv' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='encrypt' type-id='type-id-320' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='decrypt' type-id='type-id-321' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='aead_encrypt' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='aead_decrypt' type-id='type-id-323' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='deinit' type-id='type-id-324' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='auth' type-id='type-id-325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tag' type-id='type-id-326' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='exists' type-id='type-id-327' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_crypto_cipher_st' type-id='type-id-315' id='type-id-314'/>
    <typedef-decl name='gnutls_cipher_init_func' type-id='type-id-328' id='type-id-316'/>
    <typedef-decl name='gnutls_cipher_setkey_func' type-id='type-id-329' id='type-id-317'/>
    <typedef-decl name='gnutls_cipher_setiv_func' type-id='type-id-329' id='type-id-318'/>
    <typedef-decl name='gnutls_cipher_getiv_func' type-id='type-id-329' id='type-id-319'/>
    <typedef-decl name='gnutls_cipher_encrypt_func' type-id='type-id-330' id='type-id-320'/>
    <typedef-decl name='gnutls_cipher_decrypt_func' type-id='type-id-330' id='type-id-321'/>
    <typedef-decl name='gnutls_cipher_auth_func' type-id='type-id-329' id='type-id-325'/>
    <typedef-decl name='gnutls_cipher_tag_func' type-id='type-id-331' id='type-id-326'/>
    <typedef-decl name='gnutls_cipher_aead_encrypt_func' type-id='type-id-332' id='type-id-322'/>
    <typedef-decl name='gnutls_cipher_aead_decrypt_func' type-id='type-id-332' id='type-id-323'/>
    <typedef-decl name='gnutls_cipher_deinit_func' type-id='type-id-333' id='type-id-324'/>
    <qualified-type-def type-id='type-id-314' const='yes' id='type-id-79'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-334' const='yes' id='type-id-335'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-339'/>
    <function-decl name='_gnutls_get_crypto_cipher' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-153'/>
    </function-decl>
    <function-decl name='_gnutls_mac_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-339'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_mac_copy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-336'/>
      <parameter type-id='type-id-339'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_mac_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-339'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-337'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-338'>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-341'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-342'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-343'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-344'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='compress.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_compression_method_t' naming-typedef-id='type-id-345' id='type-id-346'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='GNUTLS_COMP_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_COMP_NULL' value='1'/>
      <enumerator name='GNUTLS_COMP_DEFLATE' value='2'/>
      <enumerator name='GNUTLS_COMP_ZLIB' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_compression_method_t' type-id='type-id-346' id='type-id-345'/>
    <qualified-type-def type-id='type-id-345' const='yes' id='type-id-347'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-348'/>
    <function-decl name='c_strcasecmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_compression_get_name' mangled-name='gnutls_compression_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-345' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_compression_get_id' mangled-name='gnutls_compression_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-345'/>
    </function-decl>
    <function-decl name='gnutls_compression_list' mangled-name='gnutls_compression_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_list@@GNUTLS_3_4'>
      <return type-id='type-id-348'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='constate.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-350'/>
    <function-decl name='_gnutls_cipher_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-350'/>
      <parameter type-id='type-id-351'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-351'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_tag_size' mangled-name='gnutls_cipher_get_tag_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_tag_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='_gnutls_generate_master' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_handshake_set_secret_function' mangled-name='gnutls_handshake_set_secret_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_set_secret_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-352' name='func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_dtls_reset_window' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-353'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_record_overhead' mangled-name='_gnutls_record_overhead' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_record_overhead@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-351'/>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='_tls13_expand_secret' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_tls13_expand_secret2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-api.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-354'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-355'/>
    <typedef-decl name='gnutls_cipher_hd_t' type-id='type-id-356' id='type-id-357'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-358' id='type-id-359'/>
    <typedef-decl name='gnutls_hmac_hd_t' type-id='type-id-360' id='type-id-361'/>
    <class-decl name='api_cipher_hd_st' size-in-bits='1536' is-struct='yes' visibility='default' id='type-id-362'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-349' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctx_dec' type-id='type-id-349' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iov_iter_st' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_count' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov_index' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iov_offset' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='block' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='block_size' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='block_offset' type-id='type-id-26' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-356'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-365'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-367'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-232'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-354'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-355'/>
    <function-decl name='_gnutls_mac_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_hash_copy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-366'/>
      <parameter type-id='type-id-372'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_init' mangled-name='gnutls_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-368' name='handle'/>
      <parameter type-id='type-id-152' name='cipher'/>
      <parameter type-id='type-id-220' name='key'/>
      <parameter type-id='type-id-220' name='iv'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_tag' mangled-name='gnutls_cipher_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_tag@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='tag'/>
      <parameter type-id='type-id-26' name='tag_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_add_auth' mangled-name='gnutls_cipher_add_auth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_add_auth@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_set_iv' mangled-name='gnutls_cipher_set_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_set_iv@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='iv'/>
      <parameter type-id='type-id-26' name='ivlen'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_cipher_get_iv' mangled-name='_gnutls_cipher_get_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_cipher_get_iv@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='iv'/>
      <parameter type-id='type-id-26' name='ivlen'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt' mangled-name='gnutls_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt' mangled-name='gnutls_cipher_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='ctext'/>
      <parameter type-id='type-id-26' name='ctext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt2' mangled-name='gnutls_cipher_encrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt2@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_len'/>
      <parameter type-id='type-id-23' name='ctext'/>
      <parameter type-id='type-id-26' name='ctext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt2' mangled-name='gnutls_cipher_decrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt2@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <parameter type-id='type-id-23' name='ctext'/>
      <parameter type-id='type-id-26' name='ctext_len'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_deinit' mangled-name='gnutls_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-357' name='handle'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_hmac_init' mangled-name='gnutls_hmac_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-370' name='dig'/>
      <parameter type-id='type-id-154' name='algorithm'/>
      <parameter type-id='type-id-23' name='key'/>
      <parameter type-id='type-id-26' name='keylen'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hmac_set_nonce' mangled-name='gnutls_hmac_set_nonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_set_nonce@@GNUTLS_3_4'>
      <parameter type-id='type-id-361' name='handle'/>
      <parameter type-id='type-id-23' name='nonce'/>
      <parameter type-id='type-id-26' name='nonce_len'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_hmac' mangled-name='gnutls_hmac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac@@GNUTLS_3_4'>
      <parameter type-id='type-id-361' name='handle'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hmac_output' mangled-name='gnutls_hmac_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_output@@GNUTLS_3_4'>
      <parameter type-id='type-id-361' name='handle'/>
      <parameter type-id='type-id-23' name='digest'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_hmac_deinit' mangled-name='gnutls_hmac_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-361' name='handle'/>
      <parameter type-id='type-id-23' name='digest'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_len' mangled-name='gnutls_hmac_get_len' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_len@@GNUTLS_3_4'>
      <parameter type-id='type-id-154' name='algorithm'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_key_size' mangled-name='gnutls_hmac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_key_size@@GNUTLS_3_6_12'>
      <parameter type-id='type-id-154' name='algorithm'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_hmac_fast' mangled-name='gnutls_hmac_fast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_fast@@GNUTLS_3_4'>
      <parameter type-id='type-id-154' name='algorithm'/>
      <parameter type-id='type-id-23' name='key'/>
      <parameter type-id='type-id-26' name='keylen'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_len'/>
      <parameter type-id='type-id-23' name='digest'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hmac_copy' mangled-name='gnutls_hmac_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_copy@@GNUTLS_3_6_9'>
      <parameter type-id='type-id-361' name='handle'/>
      <return type-id='type-id-361'/>
    </function-decl>
    <function-decl name='gnutls_hash_init' mangled-name='gnutls_hash_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-369' name='dig'/>
      <parameter type-id='type-id-149' name='algorithm'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hash' mangled-name='gnutls_hash' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash@@GNUTLS_3_4'>
      <parameter type-id='type-id-359' name='handle'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hash_output' mangled-name='gnutls_hash_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_output@@GNUTLS_3_4'>
      <parameter type-id='type-id-359' name='handle'/>
      <parameter type-id='type-id-23' name='digest'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_hash_deinit' mangled-name='gnutls_hash_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-359' name='handle'/>
      <parameter type-id='type-id-23' name='digest'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_hash_copy' mangled-name='gnutls_hash_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_copy@@GNUTLS_3_6_9'>
      <parameter type-id='type-id-359' name='handle'/>
      <return type-id='type-id-359'/>
    </function-decl>
    <function-decl name='gnutls_key_generate' mangled-name='gnutls_key_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_key_generate@@GNUTLS_3_4'>
      <parameter type-id='type-id-213' name='key'/>
      <parameter type-id='type-id-49' name='key_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_init' mangled-name='gnutls_aead_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-367' name='handle'/>
      <parameter type-id='type-id-152' name='cipher'/>
      <parameter type-id='type-id-220' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encrypt' mangled-name='gnutls_aead_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-306' name='handle'/>
      <parameter type-id='type-id-23' name='nonce'/>
      <parameter type-id='type-id-26' name='nonce_len'/>
      <parameter type-id='type-id-23' name='auth'/>
      <parameter type-id='type-id-26' name='auth_len'/>
      <parameter type-id='type-id-26' name='tag_size'/>
      <parameter type-id='type-id-23' name='ptext'/>
      <parameter type-id='type-id-26' name='ptext_len'/>
      <parameter type-id='type-id-23' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv2' mangled-name='gnutls_aead_cipher_encryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encryptv2@@GNUTLS_3_6_10'>
      <parameter type-id='type-id-306' name='handle'/>
      <parameter type-id='type-id-23' name='nonce'/>
      <parameter type-id='type-id-26' name='nonce_len'/>
      <parameter type-id='type-id-312' name='auth_iov'/>
      <parameter type-id='type-id-6' name='auth_iovcnt'/>
      <parameter type-id='type-id-312' name='iov'/>
      <parameter type-id='type-id-6' name='iovcnt'/>
      <parameter type-id='type-id-23' name='tag'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decryptv2' mangled-name='gnutls_aead_cipher_decryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_decryptv2@@GNUTLS_3_6_10'>
      <parameter type-id='type-id-306' name='handle'/>
      <parameter type-id='type-id-23' name='nonce'/>
      <parameter type-id='type-id-26' name='nonce_len'/>
      <parameter type-id='type-id-312' name='auth_iov'/>
      <parameter type-id='type-id-6' name='auth_iovcnt'/>
      <parameter type-id='type-id-312' name='iov'/>
      <parameter type-id='type-id-6' name='iovcnt'/>
      <parameter type-id='type-id-23' name='tag'/>
      <parameter type-id='type-id-26' name='tag_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_deinit' mangled-name='gnutls_aead_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-306' name='handle'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_extract' mangled-name='gnutls_hkdf_extract' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_extract@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-154' name='mac'/>
      <parameter type-id='type-id-220' name='key'/>
      <parameter type-id='type-id-220' name='salt'/>
      <parameter type-id='type-id-23' name='output'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_expand' mangled-name='gnutls_hkdf_expand' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_expand@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-154' name='mac'/>
      <parameter type-id='type-id-220' name='key'/>
      <parameter type-id='type-id-220' name='info'/>
      <parameter type-id='type-id-23' name='output'/>
      <parameter type-id='type-id-26' name='length'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pbkdf2' mangled-name='gnutls_pbkdf2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pbkdf2@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-154' name='mac'/>
      <parameter type-id='type-id-220' name='key'/>
      <parameter type-id='type-id-220' name='salt'/>
      <parameter type-id='type-id-49' name='iter_count'/>
      <parameter type-id='type-id-23' name='output'/>
      <parameter type-id='type-id-26' name='length'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_iov_iter_init' mangled-name='_gnutls_iov_iter_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_iov_iter_init@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-371'/>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_iov_iter_next' mangled-name='_gnutls_iov_iter_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_iov_iter_next@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-371'/>
      <parameter type-id='type-id-232'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='_gnutls_iov_iter_sync' mangled-name='_gnutls_iov_iter_sync' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_iov_iter_sync@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-371'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-backend.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <var-decl name='crypto_cipher_prio' type-id='type-id-6' visibility='default'/>
    <var-decl name='crypto_mac_prio' type-id='type-id-6' visibility='default'/>
    <var-decl name='crypto_digest_prio' type-id='type-id-6' visibility='default'/>
    <function-decl name='gnutls_crypto_register_cipher' mangled-name='gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_cipher@@GNUTLS_3_4'>
      <parameter type-id='type-id-152' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-316' name='init'/>
      <parameter type-id='type-id-317' name='setkey'/>
      <parameter type-id='type-id-318' name='setiv'/>
      <parameter type-id='type-id-320' name='encrypt'/>
      <parameter type-id='type-id-321' name='decrypt'/>
      <parameter type-id='type-id-324' name='deinit'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_crypto_register_cipher' mangled-name='_gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_crypto_register_cipher@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-152' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-316' name='init'/>
      <parameter type-id='type-id-317' name='setkey'/>
      <parameter type-id='type-id-318' name='setiv'/>
      <parameter type-id='type-id-320' name='encrypt'/>
      <parameter type-id='type-id-321' name='decrypt'/>
      <parameter type-id='type-id-324' name='deinit'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_aead_cipher' mangled-name='gnutls_crypto_register_aead_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_aead_cipher@@GNUTLS_3_4'>
      <parameter type-id='type-id-152' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-316' name='init'/>
      <parameter type-id='type-id-317' name='setkey'/>
      <parameter type-id='type-id-322' name='aead_encrypt'/>
      <parameter type-id='type-id-323' name='aead_decrypt'/>
      <parameter type-id='type-id-324' name='deinit'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_mac' mangled-name='gnutls_crypto_register_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_mac@@GNUTLS_3_4'>
      <parameter type-id='type-id-154' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-373' name='init'/>
      <parameter type-id='type-id-374' name='setkey'/>
      <parameter type-id='type-id-375' name='setnonce'/>
      <parameter type-id='type-id-376' name='hash'/>
      <parameter type-id='type-id-377' name='output'/>
      <parameter type-id='type-id-378' name='deinit'/>
      <parameter type-id='type-id-379' name='hash_fast'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_digest' mangled-name='gnutls_crypto_register_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_digest@@GNUTLS_3_4'>
      <parameter type-id='type-id-149' name='algorithm'/>
      <parameter type-id='type-id-6' name='priority'/>
      <parameter type-id='type-id-380' name='init'/>
      <parameter type-id='type-id-381' name='hash'/>
      <parameter type-id='type-id-382' name='output'/>
      <parameter type-id='type-id-383' name='deinit'/>
      <parameter type-id='type-id-384' name='hash_fast'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests-pk.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_pk_self_test' mangled-name='gnutls_pk_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-49' name='flags'/>
      <parameter type-id='type-id-189' name='pk'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='_gnutls_cipher_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_iv_size' mangled-name='gnutls_cipher_get_iv_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_iv_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_hash_get_len' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_name' mangled-name='gnutls_digest_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_self_test' mangled-name='gnutls_cipher_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-49' name='flags'/>
      <parameter type-id='type-id-152' name='cipher'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_mac_self_test' mangled-name='gnutls_mac_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-49' name='flags'/>
      <parameter type-id='type-id-154' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_digest_self_test' mangled-name='gnutls_digest_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-49' name='flags'/>
      <parameter type-id='type-id-149' name='digest'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_self_test' mangled-name='gnutls_hkdf_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-49' name='flags'/>
      <parameter type-id='type-id-154' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_pbkdf2_self_test' mangled-name='gnutls_pbkdf2_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pbkdf2_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-49' name='flags'/>
      <parameter type-id='type-id-154' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_tlsprf_self_test' mangled-name='gnutls_tlsprf_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_tlsprf_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-49' name='flags'/>
      <parameter type-id='type-id-154' name='mac'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='db.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_db_set_retrieve_function' mangled-name='gnutls_db_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_retrieve_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-385' name='retr_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_db_set_remove_function' mangled-name='gnutls_db_set_remove_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_remove_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-386' name='rem_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_db_set_store_function' mangled-name='gnutls_db_set_store_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_store_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-387' name='store_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_db_set_ptr' mangled-name='gnutls_db_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-23' name='ptr'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_db_get_ptr' mangled-name='gnutls_db_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='gnutls_db_set_cache_expiration' mangled-name='gnutls_db_set_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_cache_expiration@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-6' name='seconds'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_db_get_default_cache_expiration' mangled-name='gnutls_db_get_default_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_default_cache_expiration@@GNUTLS_3_4'>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry' mangled-name='gnutls_db_check_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-208' name='session_entry'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_time' mangled-name='gnutls_db_check_entry_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_time@@GNUTLS_3_4'>
      <parameter type-id='type-id-213' name='entry'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_expire_time' mangled-name='gnutls_db_check_entry_expire_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_expire_time@@GNUTLS_3_6_5'>
      <parameter type-id='type-id-213' name='entry'/>
      <return type-id='type-id-303'/>
    </function-decl>
    <function-decl name='gnutls_db_remove_session' mangled-name='gnutls_db_remove_session' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_remove_session@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_server_name_matches_resumed' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-49'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='debug.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_handshake_description_get_name' mangled-name='gnutls_handshake_description_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_description_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-238' name='type'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh-primes.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <var-decl name='gnutls_ffdhe_8192_group_prime' type-id='type-id-230' mangled-name='gnutls_ffdhe_8192_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_8192_group_q' type-id='type-id-230' mangled-name='gnutls_ffdhe_8192_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_8192_group_generator' type-id='type-id-230' mangled-name='gnutls_ffdhe_8192_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_8192_key_bits' type-id='type-id-388' mangled-name='gnutls_ffdhe_8192_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_8192_key_bits@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_6144_group_prime' type-id='type-id-230' mangled-name='gnutls_ffdhe_6144_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_group_prime@@GNUTLS_3_6_4'/>
    <var-decl name='gnutls_ffdhe_6144_group_q' type-id='type-id-230' mangled-name='gnutls_ffdhe_6144_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_6144_group_generator' type-id='type-id-230' mangled-name='gnutls_ffdhe_6144_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_group_generator@@GNUTLS_3_6_4'/>
    <var-decl name='gnutls_ffdhe_6144_key_bits' type-id='type-id-388' mangled-name='gnutls_ffdhe_6144_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_6144_key_bits@@GNUTLS_3_6_4'/>
    <var-decl name='gnutls_ffdhe_4096_group_prime' type-id='type-id-230' mangled-name='gnutls_ffdhe_4096_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_4096_group_q' type-id='type-id-230' mangled-name='gnutls_ffdhe_4096_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_4096_group_generator' type-id='type-id-230' mangled-name='gnutls_ffdhe_4096_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_4096_key_bits' type-id='type-id-388' mangled-name='gnutls_ffdhe_4096_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_4096_key_bits@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_3072_group_prime' type-id='type-id-230' mangled-name='gnutls_ffdhe_3072_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_3072_group_q' type-id='type-id-230' mangled-name='gnutls_ffdhe_3072_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_3072_group_generator' type-id='type-id-230' mangled-name='gnutls_ffdhe_3072_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_3072_key_bits' type-id='type-id-388' mangled-name='gnutls_ffdhe_3072_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_3072_key_bits@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_2048_group_prime' type-id='type-id-230' mangled-name='gnutls_ffdhe_2048_group_prime' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_2048_group_q' type-id='type-id-230' mangled-name='gnutls_ffdhe_2048_group_q' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_group_q@@GNUTLS_3_6_8'/>
    <var-decl name='gnutls_ffdhe_2048_group_generator' type-id='type-id-230' mangled-name='gnutls_ffdhe_2048_group_generator' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_ffdhe_2048_key_bits' type-id='type-id-388' mangled-name='gnutls_ffdhe_2048_key_bits' visibility='default' elf-symbol-id='gnutls_ffdhe_2048_key_bits@@GNUTLS_3_4'/>
    <var-decl name='gnutls_modp_8192_group_prime' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_8192_group_q' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_8192_group_generator' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_8192_key_bits' type-id='type-id-388' visibility='default'/>
    <var-decl name='gnutls_modp_6144_group_prime' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_6144_group_q' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_6144_group_generator' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_6144_key_bits' type-id='type-id-388' visibility='default'/>
    <var-decl name='gnutls_modp_4096_group_prime' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_4096_group_q' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_4096_group_generator' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_4096_key_bits' type-id='type-id-388' visibility='default'/>
    <var-decl name='gnutls_modp_3072_group_prime' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_3072_group_q' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_3072_group_generator' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_3072_key_bits' type-id='type-id-388' visibility='default'/>
    <var-decl name='gnutls_modp_2048_group_prime' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_2048_group_q' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_2048_group_generator' type-id='type-id-230' visibility='default'/>
    <var-decl name='gnutls_modp_2048_key_bits' type-id='type-id-388' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='dh-session.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_dh_set_prime_bits' mangled-name='gnutls_dh_set_prime_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_set_prime_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_group' mangled-name='gnutls_dh_get_group' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_group@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-213' name='raw_gen'/>
      <parameter type-id='type-id-213' name='raw_prime'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_pubkey' mangled-name='gnutls_dh_get_pubkey' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_pubkey@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-213' name='raw_key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_secret_bits' mangled-name='gnutls_dh_get_secret_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_secret_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_peers_public_bits' mangled-name='gnutls_dh_get_peers_public_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_get_peers_public_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_x509_crt_fmt_t' naming-typedef-id='type-id-244' id='type-id-389'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <typedef-decl name='gnutls_x509_crt_fmt_t' type-id='type-id-389' id='type-id-244'/>
    <typedef-decl name='asn1_node_const' type-id='type-id-390' id='type-id-391'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-392'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-393' const='yes' id='type-id-394'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-390'/>
    <qualified-type-def type-id='type-id-221' const='yes' id='type-id-395'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-396'/>
    <function-decl name='gnutls_pk_params_release' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pk_params_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_sec_param_to_pk_bits' mangled-name='gnutls_sec_param_to_pk_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_to_pk_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-195'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_x509_privkey_export_dsa_raw' mangled-name='gnutls_x509_privkey_export_dsa_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_privkey_export_dsa_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_init_scan_nz' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_dprint' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_x509_der_encode' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_x509_read_uint' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_x509_read_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_x509_write_uint32' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_fbase64_encode' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_fbase64_decode' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw' mangled-name='gnutls_dh_params_import_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='dh_params'/>
      <parameter type-id='type-id-220' name='prime'/>
      <parameter type-id='type-id-220' name='generator'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_dsa' mangled-name='gnutls_dh_params_import_dsa' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_dsa@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='dh_params'/>
      <parameter type-id='type-id-264' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw2' mangled-name='gnutls_dh_params_import_raw2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw2@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='dh_params'/>
      <parameter type-id='type-id-220' name='prime'/>
      <parameter type-id='type-id-220' name='generator'/>
      <parameter type-id='type-id-49' name='key_bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw3' mangled-name='gnutls_dh_params_import_raw3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw3@@GNUTLS_3_6_8'>
      <parameter type-id='type-id-194' name='dh_params'/>
      <parameter type-id='type-id-220' name='prime'/>
      <parameter type-id='type-id-220' name='q'/>
      <parameter type-id='type-id-220' name='generator'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_init' mangled-name='gnutls_dh_params_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-396' name='dh_params'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_deinit' mangled-name='gnutls_dh_params_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='dh_params'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_cpy' mangled-name='gnutls_dh_params_cpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_cpy@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='dst'/>
      <parameter type-id='type-id-194' name='src'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_generate2' mangled-name='gnutls_dh_params_generate2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_generate2@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='dparams'/>
      <parameter type-id='type-id-49' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_pkcs3' mangled-name='gnutls_dh_params_import_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='params'/>
      <parameter type-id='type-id-220' name='pkcs3_params'/>
      <parameter type-id='type-id-244' name='format'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export_pkcs3' mangled-name='gnutls_dh_params_export_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='params'/>
      <parameter type-id='type-id-244' name='format'/>
      <parameter type-id='type-id-78' name='params_data'/>
      <parameter type-id='type-id-2' name='params_data_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export2_pkcs3' mangled-name='gnutls_dh_params_export2_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export2_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='params'/>
      <parameter type-id='type-id-244' name='format'/>
      <parameter type-id='type-id-213' name='out'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_export_raw' mangled-name='gnutls_dh_params_export_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-194' name='params'/>
      <parameter type-id='type-id-213' name='prime'/>
      <parameter type-id='type-id-213' name='generator'/>
      <parameter type-id='type-id-151' name='bits'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_dh_save_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_create_element' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-391'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_delete_structure' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_write_value' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_der_decoding' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dtls.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_dtls_prestate_st' size-in-bits='96' is-struct='yes' naming-typedef-id='type-id-397' visibility='default' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_seq' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='hsk_read_seq' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hsk_write_seq' type-id='type-id-49' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_dtls_prestate_st' type-id='type-id-398' id='type-id-397'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-399'/>
    <function-decl name='_gnutls_io_check_recv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_parse_record_buffered_msgs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_mtu' mangled-name='gnutls_dtls_set_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_mtu@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-49' name='mtu'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_est_record_overhead_size' mangled-name='gnutls_est_record_overhead_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_est_record_overhead_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-170' name='version'/>
      <parameter type-id='type-id-152' name='cipher'/>
      <parameter type-id='type-id-154' name='mac'/>
      <parameter type-id='type-id-345' name='comp'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_data_mtu' mangled-name='gnutls_dtls_set_data_mtu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_data_mtu@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-49' name='mtu'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_timeout' mangled-name='gnutls_dtls_get_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_get_timeout@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_dtls_cookie_send' mangled-name='gnutls_dtls_cookie_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_cookie_send@@GNUTLS_3_4'>
      <parameter type-id='type-id-213' name='key'/>
      <parameter type-id='type-id-23' name='client_data'/>
      <parameter type-id='type-id-26' name='client_data_size'/>
      <parameter type-id='type-id-399' name='prestate'/>
      <parameter type-id='type-id-240' name='ptr'/>
      <parameter type-id='type-id-400' name='push_func'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dtls_cookie_verify' mangled-name='gnutls_dtls_cookie_verify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_cookie_verify@@GNUTLS_3_4'>
      <parameter type-id='type-id-213' name='key'/>
      <parameter type-id='type-id-23' name='client_data'/>
      <parameter type-id='type-id-26' name='client_data_size'/>
      <parameter type-id='type-id-23' name='_msg'/>
      <parameter type-id='type-id-26' name='msg_size'/>
      <parameter type-id='type-id-399' name='prestate'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_dtls_prestate_set' mangled-name='gnutls_dtls_prestate_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_prestate_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-399' name='prestate'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_record_get_discarded' mangled-name='gnutls_record_get_discarded' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_get_discarded@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-49'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ecc.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_ecc_curve_get_size' mangled-name='gnutls_ecc_curve_get_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='errors.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='8' id='type-id-401'>
      <subrange length='1' type-id='type-id-9' id='type-id-402'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='160' id='type-id-403'>
      <subrange length='20' type-id='type-id-9' id='type-id-404'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-405'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-406'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-407'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-45'/>
    <typedef-decl name='__off_t' type-id='type-id-13' id='type-id-28'/>
    <typedef-decl name='__off64_t' type-id='type-id-13' id='type-id-409'/>
    <typedef-decl name='FILE' type-id='type-id-410' id='type-id-411'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-22' id='type-id-412'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-413' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-414' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-401' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-415' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-409' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-416' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-417' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-414' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-403' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-27'/>
    <qualified-type-def type-id='type-id-27' restrict='yes' id='type-id-25'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-416'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-413'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-417'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-418'/>
    <qualified-type-def type-id='type-id-418' restrict='yes' id='type-id-419'/>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-420'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-405'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-406'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-407'/>
    <function-decl name='gnutls_perror' mangled-name='gnutls_perror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_perror@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='error'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_strerror' mangled-name='gnutls_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='error'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_strerror_name' mangled-name='gnutls_strerror_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='error'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_log' mangled-name='_gnutls_mpi_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_mpi_log@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-3' name='prefix'/>
      <parameter type-id='type-id-221' name='a'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-420'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='vasprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-419'/>
      <parameter type-id='type-id-420'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='alpn.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_alpn' type-id='type-id-421' visibility='default'/>
    <function-decl name='gnutls_alpn_get_selected_protocol' mangled-name='gnutls_alpn_get_selected_protocol' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alpn_get_selected_protocol@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-213' name='protocol'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_alpn_set_protocols' mangled-name='gnutls_alpn_set_protocols' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alpn_set_protocols@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-220' name='protocols'/>
      <parameter type-id='type-id-49' name='protocols_size'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='client_cert_type.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_client_cert_type' type-id='type-id-421' visibility='default'/>
    <function-decl name='_gnutls_session_client_cert_type_set' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_session_is_cert_type_supported' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-422'/>
      <return type-id='type-id-172'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cookie.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_cookie' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='dumbfw.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_dumbfw' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='early_data.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_early_data' type-id='type-id-421' visibility='default'/>
    <function-decl name='gnutls_record_get_max_early_data_size' mangled-name='gnutls_record_get_max_early_data_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_get_max_early_data_size@@GNUTLS_3_6_5'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='gnutls_record_set_max_early_data_size' mangled-name='gnutls_record_set_max_early_data_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_set_max_early_data_size@@GNUTLS_3_6_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-26' name='size'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ec_point_formats.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_supported_ec_point_formats' type-id='type-id-421' visibility='default'/>
    <function-decl name='_gnutls_session_is_ecc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='etm.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_etm' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='ext_master_secret.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_ext_master_secret' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='heartbeat.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_heartbeat' type-id='type-id-421' visibility='default'/>
    <function-decl name='gnutls_heartbeat_enable' mangled-name='gnutls_heartbeat_enable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_enable@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-49' name='type'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_ping' mangled-name='gnutls_heartbeat_ping' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_ping@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-26' name='data_size'/>
      <parameter type-id='type-id-49' name='max_tries'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_pong' mangled-name='gnutls_heartbeat_pong' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_pong@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_get_timeout' mangled-name='gnutls_heartbeat_get_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_get_timeout@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_set_timeouts' mangled-name='gnutls_heartbeat_set_timeouts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_set_timeouts@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-49' name='retrans_timeout'/>
      <parameter type-id='type-id-49' name='total_timeout'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='key_share.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <function-decl name='_gnutls_tls_id_to_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-423'/>
    </function-decl>
    <function-decl name='_gnutls_session_supports_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_fixed_mpi' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='max_record.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <typedef-decl name='hello_ext_entry_st' type-id='type-id-424' id='type-id-425'/>
    <qualified-type-def type-id='type-id-425' const='yes' id='type-id-421'/>
    <var-decl name='ext_mod_max_record_size' type-id='type-id-421' visibility='default'/>
    <function-decl name='gnutls_record_set_max_size' mangled-name='gnutls_record_set_max_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_set_max_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-26' name='size'/>
      <return type-id='type-id-239'/>
    </function-decl>
    <function-decl name='gnutls_record_set_max_recv_size' mangled-name='gnutls_record_set_max_recv_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_set_max_recv_size@@GNUTLS_3_6_8'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-26' name='size'/>
      <return type-id='type-id-239'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='post_handshake.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_post_handshake' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='pre_shared_key.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <function-decl name='_gnutls_psk_pwd_find_entry' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-287'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_find_psk_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-428'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='ext_mod_pre_shared_key' type-id='type-id-421' visibility='default'/>
    <function-decl name='_gnutls_ext_get_full_client_hello' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='_tls13_init_secret2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls13_unpack_session_ticket' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-427'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='psk_ke_modes.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_psk_ke_modes' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='record_size_limit.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_record_size_limit' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='safe_renegotiation.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_sr' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='server_cert_type.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_server_cert_type' type-id='type-id-421' visibility='default'/>
    <function-decl name='_gnutls_session_server_cert_type_set' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='server_name.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <enum-decl name='gnutls_server_name_type_t' naming-typedef-id='type-id-429' id='type-id-430'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='GNUTLS_NAME_DNS' value='1'/>
    </enum-decl>
    <typedef-decl name='gnutls_server_name_type_t' type-id='type-id-430' id='type-id-429'/>
    <var-decl name='ext_mod_server_name' type-id='type-id-421' visibility='default'/>
    <function-decl name='_gnutls_hello_ext_unset_priv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-431'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_set_datum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-431'/>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_get_datum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-431'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_get_resumed_datum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-431'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_default_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-432'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_default_pack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-432'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_default_unpack' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-433'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_server_name_get' mangled-name='gnutls_server_name_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_server_name_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-23' name='data'/>
      <parameter type-id='type-id-2' name='data_length'/>
      <parameter type-id='type-id-151' name='type'/>
      <parameter type-id='type-id-49' name='indx'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_server_name_set_raw' mangled-name='_gnutls_server_name_set_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_server_name_set_raw@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-429' name='type'/>
      <parameter type-id='type-id-23' name='name'/>
      <parameter type-id='type-id-26' name='name_length'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_server_name_set' mangled-name='gnutls_server_name_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_server_name_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-429' name='type'/>
      <parameter type-id='type-id-23' name='name'/>
      <parameter type-id='type-id-26' name='name_length'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='session_ticket.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <function-decl name='_gnutls_epoch_set_keys' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-287'/>
      <parameter type-id='type-id-434'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='ext_mod_session_ticket' type-id='type-id-421' visibility='default'/>
    <function-decl name='_gnutls_get_session_ticket_encryption_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_get_session_ticket_decryption_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_initialize_session_ticket_key_rotation' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-220'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_session_ticket_key_generate' mangled-name='gnutls_session_ticket_key_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ticket_key_generate@@GNUTLS_3_4'>
      <parameter type-id='type-id-213' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_session_ticket_enable_client' mangled-name='gnutls_session_ticket_enable_client' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ticket_enable_client@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_session_ticket_enable_server' mangled-name='gnutls_session_ticket_enable_server' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ticket_enable_server@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-220' name='key'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='signature.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <function-decl name='_gnutls_privkey_compatible_with_sig' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='_gnutls_tls_aid_to_sign' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-304'/>
      <return type-id='type-id-190'/>
    </function-decl>
    <var-decl name='ext_mod_sig' type-id='type-id-421' visibility='default'/>
    <function-decl name='gnutls_sign_algorithm_get_requested' mangled-name='gnutls_sign_algorithm_get_requested' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_algorithm_get_requested@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-26' name='indx'/>
      <parameter type-id='type-id-219' name='algo'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='srp.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_srp' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='srtp.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <enum-decl name='gnutls_srtp_profile_t' naming-typedef-id='type-id-435' id='type-id-436'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='GNUTLS_SRTP_AES128_CM_HMAC_SHA1_80' value='1'/>
      <enumerator name='GNUTLS_SRTP_AES128_CM_HMAC_SHA1_32' value='2'/>
      <enumerator name='GNUTLS_SRTP_NULL_HMAC_SHA1_80' value='5'/>
      <enumerator name='GNUTLS_SRTP_NULL_HMAC_SHA1_32' value='6'/>
    </enum-decl>
    <typedef-decl name='gnutls_srtp_profile_t' type-id='type-id-436' id='type-id-435'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-437'/>
    <var-decl name='ext_mod_srtp' type-id='type-id-421' visibility='default'/>
    <function-decl name='gnutls_srtp_get_profile_id' mangled-name='gnutls_srtp_get_profile_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_profile_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <parameter type-id='type-id-437' name='profile'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_profile_name' mangled-name='gnutls_srtp_get_profile_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_profile_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-435' name='profile'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_selected_profile' mangled-name='gnutls_srtp_get_selected_profile' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_selected_profile@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-437' name='profile'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_mki' mangled-name='gnutls_srtp_get_mki' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_mki@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-213' name='mki'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_set_mki' mangled-name='gnutls_srtp_set_mki' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_set_mki@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-220' name='mki'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_set_profile' mangled-name='gnutls_srtp_set_profile' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_set_profile@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-435' name='profile'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_set_profile_direct' mangled-name='gnutls_srtp_set_profile_direct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_set_profile_direct@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-3' name='profiles'/>
      <parameter type-id='type-id-245' name='err_pos'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_srtp_get_keys' mangled-name='gnutls_srtp_get_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srtp_get_keys@@GNUTLS_3_4'>
      <parameter type-id='type-id-158' name='session'/>
      <parameter type-id='type-id-23' name='key_material'/>
      <parameter type-id='type-id-49' name='key_material_size'/>
      <parameter type-id='type-id-213' name='client_key'/>
      <parameter type-id='type-id-213' name='client_salt'/>
      <parameter type-id='type-id-213' name='server_key'/>
      <parameter type-id='type-id-213' name='server_salt'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='status_request.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_status_request' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='supported_groups.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <var-decl name='ext_mod_supported_groups' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='supported_versions.c' comp-dir-path='/home/ueno/devel/gnutls/lib/ext' language='LANG_C11'>
    <function-decl name='_gnutls_write_supported_versions' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='ext_mod_supported_versions' type-id='type-id-421' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='extv.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_ext_raw_parse' mangled-name='gnutls_ext_raw_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ext_raw_parse@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-23' name='ctx'/>
      <parameter type-id='type-id-438' name='cb'/>
      <parameter type-id='type-id-220' name='data'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='file.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_load_file' mangled-name='gnutls_load_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_load_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='filename'/>
      <parameter type-id='type-id-213' name='data'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fingerprint.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_fingerprint' mangled-name='gnutls_fingerprint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fingerprint@@GNUTLS_3_4'>
      <parameter type-id='type-id-149' name='algo'/>
      <parameter type-id='type-id-220' name='data'/>
      <parameter type-id='type-id-23' name='result'/>
      <parameter type-id='type-id-2' name='result_size'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fips.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_fips_mode_t' id='type-id-439'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='GNUTLS_FIPS140_DISABLED' value='0'/>
      <enumerator name='GNUTLS_FIPS140_STRICT' value='1'/>
      <enumerator name='GNUTLS_FIPS140_SELFTESTS' value='2'/>
      <enumerator name='GNUTLS_FIPS140_LAX' value='3'/>
      <enumerator name='GNUTLS_FIPS140_LOG' value='4'/>
    </enum-decl>
    <typedef-decl name='gnutls_fips_mode_t' type-id='type-id-439' id='type-id-440'/>
    <typedef-decl name='gnutls_fips140_context_t' type-id='type-id-441' id='type-id-442'/>
    <class-decl name='gnutls_fips140_context_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-443'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-444' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-441' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-445'/>
    <var-decl name='_gnutls_lib_state' type-id='type-id-49' visibility='default'/>
    <function-decl name='gnutls_fips140_mode_enabled' mangled-name='gnutls_fips140_mode_enabled' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_mode_enabled@@GNUTLS_3_4'>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gnutls_fips140_set_mode' mangled-name='gnutls_fips140_set_mode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_set_mode@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-440' name='mode'/>
      <parameter type-id='type-id-49' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_lib_simulate_error' mangled-name='_gnutls_lib_simulate_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_lib_simulate_error@@GNUTLS_PRIVATE_3_4'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_lib_force_operational' mangled-name='_gnutls_lib_force_operational' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_lib_force_operational@@GNUTLS_PRIVATE_3_4'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_fips140_context_init' mangled-name='gnutls_fips140_context_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_context_init@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-445' name='context'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_fips140_context_deinit' mangled-name='gnutls_fips140_context_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_context_deinit@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-442' name='context'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_fips140_get_operation_state' mangled-name='gnutls_fips140_get_operation_state' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_get_operation_state@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-442' name='context'/>
      <return type-id='type-id-444'/>
    </function-decl>
    <function-decl name='gnutls_fips140_push_context' mangled-name='gnutls_fips140_push_context' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_push_context@@GNUTLS_3_7_3'>
      <parameter type-id='type-id-442' name='context'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_fips140_pop_context' mangled-name='gnutls_fips140_pop_context' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_fips140_pop_context@@GNUTLS_3_7_3'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='global.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_library_config_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-446'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_library_config_st' type-id='type-id-446' id='type-id-447'/>
    <typedef-decl name='gnutls_time_func' type-id='type-id-448' id='type-id-449'/>
    <typedef-decl name='gnutls_alloc_function' type-id='type-id-450' id='type-id-451'/>
    <typedef-decl name='gnutls_is_secure_function' type-id='type-id-452' id='type-id-453'/>
    <typedef-decl name='gnutls_free_function' type-id='type-id-333' id='type-id-454'/>
    <typedef-decl name='gnutls_realloc_function' type-id='type-id-455' id='type-id-456'/>
    <typedef-decl name='gnutls_log_func' type-id='type-id-457' id='type-id-458'/>
    <typedef-decl name='gnutls_audit_log_func' type-id='type-id-459' id='type-id-460'/>
    <class-decl name='asn1_static_node_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-461'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='asn1_static_node' type-id='type-id-461' id='type-id-462'/>
    <qualified-type-def type-id='type-id-462' const='yes' id='type-id-463'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-447' const='yes' id='type-id-465'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-472' size-in-bits='64' id='type-id-455'/>
    <function-decl name='_gnutls_register_accel_crypto' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_afalg_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_cryptodev_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_cryptodev_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_register_fork_handler' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_crypto_deregister' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <var-decl name='_gnutls_pkix1_asn' type-id='type-id-250' visibility='default'/>
    <var-decl name='_gnutls_gnutls_asn' type-id='type-id-250' visibility='default'/>
    <var-decl name='_gnutls_log_func' type-id='type-id-458' visibility='default'/>
    <var-decl name='_gnutls_audit_log_func' type-id='type-id-460' visibility='default'/>
    <var-decl name='_gnutls_log_level' type-id='type-id-6' mangled-name='_gnutls_log_level' visibility='default' elf-symbol-id='_gnutls_log_level@@GNUTLS_PRIVATE_3_4'/>
    <function-decl name='gnutls_crypto_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_crypto_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_nss_keylog_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_load_system_priorities' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_unload_system_priorities' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pkcs11_deinit' mangled-name='gnutls_pkcs11_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pkcs11_deinit@@GNUTLS_3_4'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_rnd_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_rnd_preinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_supplemental_deinit' mangled-name='_gnutls_supplemental_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_supplemental_deinit@@GNUTLS_PRIVATE_3_4'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_system_key_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_system_key_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_system_global_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_system_global_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_global_init_skip' mangled-name='_gnutls_global_init_skip' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_global_init_skip@@GNUTLS_3_4'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_global_set_log_function' mangled-name='gnutls_global_set_log_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_log_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-458' name='log_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_global_set_audit_log_function' mangled-name='gnutls_global_set_audit_log_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_audit_log_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-460' name='log_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_global_set_time_function' mangled-name='gnutls_global_set_time_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_time_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-449' name='time_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_global_set_log_level' mangled-name='gnutls_global_set_log_level' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_log_level@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='level'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_global_set_mem_functions' mangled-name='gnutls_global_set_mem_functions' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_set_mem_functions@@GNUTLS_3_4'>
      <parameter type-id='type-id-451' name='alloc_func'/>
      <parameter type-id='type-id-451' name='secure_alloc_func'/>
      <parameter type-id='type-id-453' name='is_secure_func'/>
      <parameter type-id='type-id-456' name='realloc_func'/>
      <parameter type-id='type-id-454' name='free_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_global_init' mangled-name='gnutls_global_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_init@@GNUTLS_3_4'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_global_deinit' mangled-name='gnutls_global_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_global_deinit@@GNUTLS_3_4'>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_check_version' mangled-name='gnutls_check_version' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_check_version@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='req_version'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_get_library_config' mangled-name='gnutls_get_library_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_get_library_config@@GNUTLS_3_7_3'>
      <return type-id='type-id-466'/>
    </function-decl>
    <var-decl name='_gnutls_global_version' type-id='type-id-49' mangled-name='_gnutls_global_version' visibility='default' elf-symbol-id='_gnutls_global_version@@GNUTLS_PRIVATE_3_4'/>
    <function-decl name='bindtextdomain' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='asn1_array2tree' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-392'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='asn1_check_version' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strtol' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-420'/>
      <parameter type-id='type-id-419'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strverscmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-467'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-468'>
      <parameter type-id='type-id-302'/>
      <return type-id='type-id-303'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-469'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-470'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-471'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-472'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-23'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='handshake-tls13.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-473'/>
    <class-decl name='gnutls_pkcs11_privkey_st' size-in-bits='3392' is-struct='yes' visibility='default' id='type-id-474'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk_algorithm' type-id='type-id-189' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_ok' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uinfo' type-id='type-id-475' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='url' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sinfo' type-id='type-id-476' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='ref' type-id='type-id-477' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='reauth' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='mutex' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='pin' type-id='type-id-478' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_privkey_pk_params_func' type-id='type-id-479' id='type-id-480'/>
    <union-decl name='__anonymous_union__' size-in-bits='640' is-anonymous='yes' visibility='default' id='type-id-481'>
      <data-member access='public'>
        <var-decl name='x509' type-id='type-id-264' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pkcs11' type-id='type-id-279' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ext' type-id='type-id-482' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-482'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sign_func' type-id='type-id-483' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sign_data_func' type-id='type-id-484' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sign_hash_func' type-id='type-id-485' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt_func' type-id='type-id-486' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='decrypt_func2' type-id='type-id-487' visibility='default'/>
      </data-member>
