<abi-corpus version='2.2' architecture='elf-amd-x86_64' soname='libgnutls.so.30'>
  <elf-needed>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.5'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libhogweed.so.6'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_dsa_generate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_generate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gnutls13_psk_ext_iter_next_binder' version='GNUTLS_PRIVATE_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gnutls_realloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_secure_malloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_generator' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_prime' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_strdup' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='asnprintf.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='vasnprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='basename-lgpl.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cloexec.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='rpl_fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dirname-lgpl.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='last_component' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fcntl.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gl_linkedhash_list.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <class-decl name='gl_hash_entry' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hash_next' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hashcode' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_impl' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='table' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='table_size' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='root' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='count' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_impl_base' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='equals_fn' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hashcode_fn' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dispose_fn' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='allow_duplicates' type-id='type-id-20' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_implementation' size-in-bits='2048' is-struct='yes' visibility='default' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nx_create_empty' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nx_create' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='node_value' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='node_nx_set_value' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_node' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='previous_node' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='first_node' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='last_node' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_at' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nx_set_at' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='search_from_to' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='indexof_from_to' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nx_add_first' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nx_add_last' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nx_add_before' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nx_add_after' type-id='type-id-34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nx_add_at' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='remove_node' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='remove_at' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='remove_elt' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='list_free' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='iterator' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='iterator_from_to' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='iterator_next' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='iterator_free' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='sortedlist_search' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='sortedlist_search_from_to' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='sortedlist_indexof' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='sortedlist_indexof_from_to' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='sortedlist_nx_add' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='sortedlist_remove' type-id='type-id-47' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_iterator_t' size-in-bits='448' is-struct='yes' naming-typedef-id='type-id-48' visibility='default' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vtable' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='count' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='q' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='i' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='j' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gl_list_node_impl' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prev' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='value' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gl_list_implementation_t' type-id='type-id-16' id='type-id-52'/>
    <typedef-decl name='gl_list_iterator_t' type-id='type-id-49' id='type-id-48'/>
    <typedef-decl name='gl_list_node_t' type-id='type-id-51' id='type-id-53'/>
    <typedef-decl name='gl_list_t' type-id='type-id-54' id='type-id-50'/>
    <typedef-decl name='gl_listelement_compar_fn' type-id='type-id-55' id='type-id-56'/>
    <typedef-decl name='gl_listelement_dispose_fn' type-id='type-id-57' id='type-id-19'/>
    <typedef-decl name='gl_listelement_equals_fn' type-id='type-id-58' id='type-id-17'/>
    <typedef-decl name='gl_listelement_hashcode_fn' type-id='type-id-59' id='type-id-18'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-58'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-66'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-29'/>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <var-decl name='gl_linkedhash_list_implementation' type-id='type-id-66' visibility='default'/>
    <function-decl name='free' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-61'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-62'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-63'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-60'>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-65'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-20'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-70'>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-48'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-71'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-48'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-80'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-50'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-81'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-50'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-72'>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-73'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-74'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-75'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-76'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-77'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-79'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-53'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-69'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-82'>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-83'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-84'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-85'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-87'>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-86'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-88'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-89'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-93'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='glthread/lock.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-95' size-in-bits='64' id='type-id-96'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-97' id='type-id-98'/>
    </array-type-def>
    <typedef-decl name='pthread_rwlockattr_t' type-id='type-id-99' id='type-id-100'/>
    <union-decl name='pthread_rwlockattr_t' size-in-bits='64' naming-typedef-id='type-id-100' visibility='default' id='type-id-99'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-101' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-102'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <qualified-type-def type-id='type-id-103' restrict='yes' id='type-id-104'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <qualified-type-def type-id='type-id-107' restrict='yes' id='type-id-108'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-109'/>
    <function-decl name='pthread_once' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_mutexattr_settype' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_rwlock_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_destroy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='pthread_rwlockattr_setkind_np' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-114'>
      <return type-id='type-id-90'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hash.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-116'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_grow_preserve.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='realloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='malloc/scratch_buffer_set_array_size.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='malloca.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='memset_explicit.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='memset' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='printf-parse.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='read-file.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <qualified-type-def type-id='type-id-8' restrict='yes' id='type-id-117'/>
    <function-decl name='fopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='memset_explicit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='ftello' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='stripslash.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <function-decl name='base_len' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vasnprintf.c' comp-dir-path='/home/zfridric/upstream/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-121' size-in-bits='1792' id='type-id-122'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-97' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='4928' id='type-id-125'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-97' id='type-id-123'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-126'/>
    <enum-decl name='arg_type' naming-typedef-id='type-id-127' id='type-id-128'>
      <underlying-type type-id='type-id-129'/>
      <enumerator name='TYPE_NONE' value='0'/>
      <enumerator name='TYPE_SCHAR' value='1'/>
      <enumerator name='TYPE_UCHAR' value='2'/>
      <enumerator name='TYPE_SHORT' value='3'/>
      <enumerator name='TYPE_USHORT' value='4'/>
      <enumerator name='TYPE_INT' value='5'/>
      <enumerator name='TYPE_UINT' value='6'/>
      <enumerator name='TYPE_LONGINT' value='7'/>
      <enumerator name='TYPE_ULONGINT' value='8'/>
      <enumerator name='TYPE_LONGLONGINT' value='9'/>
      <enumerator name='TYPE_ULONGLONGINT' value='10'/>
      <enumerator name='TYPE_DOUBLE' value='11'/>
      <enumerator name='TYPE_LONGDOUBLE' value='12'/>
      <enumerator name='TYPE_CHAR' value='13'/>
      <enumerator name='TYPE_WIDE_CHAR' value='14'/>
      <enumerator name='TYPE_STRING' value='15'/>
      <enumerator name='TYPE_WIDE_STRING' value='16'/>
      <enumerator name='TYPE_POINTER' value='17'/>
      <enumerator name='TYPE_COUNT_SCHAR_POINTER' value='18'/>
      <enumerator name='TYPE_COUNT_SHORT_POINTER' value='19'/>
      <enumerator name='TYPE_COUNT_INT_POINTER' value='20'/>
      <enumerator name='TYPE_COUNT_LONGINT_POINTER' value='21'/>
      <enumerator name='TYPE_COUNT_LONGLONGINT_POINTER' value='22'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='type-id-130'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-131'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-132'/>
    <class-decl name='argument' size-in-bits='256' is-struct='yes' naming-typedef-id='type-id-121' visibility='default' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-134' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='arguments' size-in-bits='1920' is-struct='yes' naming-typedef-id='type-id-135' visibility='default' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='direct_alloc_arg' type-id='type-id-122' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directive' size-in-bits='704' is-struct='yes' naming-typedef-id='type-id-124' visibility='default' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='width_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='width_arg_index' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='precision_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='precision_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='precision_arg_index' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conversion' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arg_index' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='char_directives' size-in-bits='5184' is-struct='yes' naming-typedef-id='type-id-139' visibility='default' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_width_length' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_precision_length' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='direct_alloc_dir' type-id='type-id-125' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arg_type' type-id='type-id-128' id='type-id-127'/>
    <typedef-decl name='argument' type-id='type-id-133' id='type-id-121'/>
    <typedef-decl name='arguments' type-id='type-id-136' id='type-id-135'/>
    <typedef-decl name='char_directive' type-id='type-id-138' id='type-id-124'/>
    <typedef-decl name='char_directives' type-id='type-id-140' id='type-id-139'/>
    <typedef-decl name='wchar_t' type-id='type-id-7' id='type-id-142'/>
    <typedef-decl name='wint_t' type-id='type-id-143' id='type-id-144'/>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-134'>
      <data-member access='public'>
        <var-decl name='a_schar' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uchar' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_short' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ushort' type-id='type-id-148' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_int' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_uint' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longint' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulongint' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longlongint' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_ulonglongint' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_float' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_double' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_longdouble' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_char' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_char' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_string' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_wide_string' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_pointer' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_schar_pointer' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_short_pointer' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_int_pointer' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longint_pointer' type-id='type-id-153' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='a_count_longlongint_pointer' type-id='type-id-154' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-142' const='yes' id='type-id-157'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-151'/>
    <function-decl name='printf_fetchargs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-155'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='printf_parse' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-155'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='snprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='accelerated.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated' language='LANG_C11'>
    <function-decl name='register_x86_crypto' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-90'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='AES_KEY' size-in-bits='2080' is-struct='yes' naming-typedef-id='type-id-158' visibility='default' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rd_key' type-id='type-id-160' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='rounds' type-id='type-id-161' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AES_KEY' type-id='type-id-159' id='type-id-158'/>
    <array-type-def dimensions='1' type-id='type-id-161' size-in-bits='2048' id='type-id-160'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-97' id='type-id-162'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-166'/>
    <function-decl name='_gnutls_log' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_memset' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='aesni_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='aesni_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='aesni_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <var-decl name='_gnutls_aesni_x86' type-id='type-id-169' visibility='default'/>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-175'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='aes-cbc-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='vpaes_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vpaes_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vpaes_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='_gnutls_aes_ssse3' type-id='type-id-169' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-ccm-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <typedef-decl name='nettle_cipher_func' type-id='type-id-177' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <function-decl name='aesni_ecb_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='_gnutls_aes_ccm_x86_aesni' type-id='type-id-169' visibility='default'/>
    <function-decl name='nettle_ccm_encrypt_message' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_ccm_decrypt_message' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-177'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-182' size-in-bits='32768' id='type-id-183'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-97' id='type-id-184'/>
    </array-type-def>
    <class-decl name='gcm_ctx' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctr' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth_size' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='data_size' type-id='type-id-186' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gcm_key' size-in-bits='32768' is-struct='yes' visibility='default' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h' type-id='type-id-183' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='padlock_cipher_data' size-in-bits='2336' is-struct='yes' visibility='default' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-189' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cword' type-id='type-id-190' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ks' type-id='type-id-158' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rounds' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dgst' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='align' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='ciphr' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='keygen' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='interm' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='encdec' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='ksize' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-186' size-in-bits='128' id='type-id-192'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-97' id='type-id-193'/>
    </array-type-def>
    <union-decl name='nettle_block16' size-in-bits='128' visibility='default' id='type-id-182'>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-194' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='w' type-id='type-id-195' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u64' type-id='type-id-192' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-190'>
      <data-member access='public'>
        <var-decl name='pad' type-id='type-id-196' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='b' type-id='type-id-191' visibility='default'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-143' size-in-bits='128' id='type-id-196'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-97' id='type-id-197'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-97' size-in-bits='128' id='type-id-195'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-97' id='type-id-193'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-198'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-202'/>
    <function-decl name='gnutls_memcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <var-decl name='_gnutls_aes_gcm_padlock' type-id='type-id-169' visibility='default'/>
    <function-decl name='padlock_aes_cipher_setkey' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='padlock_ecb_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-179'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_iv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_gcm_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_gcm_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_gcm_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_gcm_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-199'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_x86_aesni' type-id='type-id-169' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul-avx.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='u128' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-203' visibility='default' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hi' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lo' type-id='type-id-186' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='u128' type-id='type-id-204' id='type-id-203'/>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-205'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-207'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-210'/>
    <function-decl name='gcm_init_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gcm_ghash_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gcm_gmult_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='aesni_ctr32_encrypt_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='aesni_gcm_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-210'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='aesni_gcm_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-210'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='_gnutls_aes_gcm_pclmul_avx' type-id='type-id-169' visibility='default'/>
    <function-decl name='nettle_memxor' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-pclmul.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='gcm_init_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gcm_ghash_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gcm_gmult_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='_gnutls_aes_gcm_pclmul' type-id='type-id-169' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='aes-gcm-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='vpaes_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='_gnutls_aes_gcm_x86_ssse3' type-id='type-id-169' visibility='default'/>
    <function-decl name='__assert_fail' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-90'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='aes192_ctx' size-in-bits='1664' is-struct='yes' visibility='default' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-212' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='aes256_ctx' size-in-bits='1920' is-struct='yes' visibility='default' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-214' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-161' size-in-bits='1664' id='type-id-212'>
      <subrange length='52' lower-bound='0' upper-bound='51' type-id='type-id-97' id='type-id-215'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-161' size-in-bits='1920' id='type-id-214'>
      <subrange length='60' lower-bound='0' upper-bound='59' type-id='type-id-97' id='type-id-216'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-217'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-218'/>
    <var-decl name='_gnutls_aes_padlock' type-id='type-id-169' visibility='default'/>
    <function-decl name='padlock_reload_key' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nettle_aes192_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_aes192_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='aes-xts-x86-aesni.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='aesni_xts_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='aesni_xts_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='_gnutls_aes_xts_x86_aesni' type-id='type-id-169' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <class-decl name='nettle_hash' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='digest_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='block_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init' type-id='type-id-220' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update' type-id='type-id-221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='digest' type-id='type-id-222' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha1_ctx' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-224' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='count' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='index' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='block' type-id='type-id-225' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha256_ctx' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='count' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='index' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block' type-id='type-id-225' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha512_ctx' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='count_low' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='count_high' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='index' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='block' type-id='type-id-230' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nettle_hash_digest_func' type-id='type-id-231' id='type-id-232'/>
    <typedef-decl name='nettle_hash_init_func' type-id='type-id-94' id='type-id-233'/>
    <typedef-decl name='nettle_hash_update_func' type-id='type-id-234' id='type-id-235'/>
    <array-type-def dimensions='1' type-id='type-id-161' size-in-bits='160' id='type-id-224'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-97' id='type-id-236'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-161' size-in-bits='256' id='type-id-227'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-97' id='type-id-98'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-186' size-in-bits='512' id='type-id-229'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-97' id='type-id-98'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-237' size-in-bits='1024' id='type-id-230'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-97' id='type-id-238'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-239'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-243'/>
    <function-decl name='_gnutls_mac_to_entry' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-245'/>
    </function-decl>
    <var-decl name='_gnutls_hmac_sha_padlock_oneshot' type-id='type-id-246' visibility='default'/>
    <function-decl name='wrap_padlock_hash_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='padlock_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='_gnutls_hmac_sha_padlock' type-id='type-id-246' visibility='default'/>
    <function-decl name='nettle_hmac_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_hmac_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-234'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-231'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-248'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-249'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-250'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='hmac-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='x86_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='x86_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='x86_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='_gnutls_hmac_sha_x86_ssse3' type-id='type-id-246' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='sha-padlock.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_sha_padlock_oneshot' type-id='type-id-252' visibility='default'/>
    <function-decl name='padlock_sha1_oneshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_sha256_oneshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_sha1_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_sha256_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_sha512_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='padlock_sha1' type-id='type-id-239' visibility='default'/>
    <var-decl name='padlock_sha224' type-id='type-id-239' visibility='default'/>
    <var-decl name='padlock_sha256' type-id='type-id-239' visibility='default'/>
    <var-decl name='padlock_sha384' type-id='type-id-239' visibility='default'/>
    <var-decl name='padlock_sha512' type-id='type-id-239' visibility='default'/>
    <var-decl name='_gnutls_sha_padlock' type-id='type-id-252' visibility='default'/>
    <function-decl name='nettle_sha1_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha256_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha224_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha512_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha384_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-254'>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-255'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-256'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='sha-x86-ssse3.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='sha1_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='sha256_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='sha512_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <var-decl name='x86_sha1' type-id='type-id-239' visibility='default'/>
    <var-decl name='x86_sha224' type-id='type-id-239' visibility='default'/>
    <var-decl name='x86_sha256' type-id='type-id-239' visibility='default'/>
    <var-decl name='x86_sha384' type-id='type-id-239' visibility='default'/>
    <var-decl name='x86_sha512' type-id='type-id-239' visibility='default'/>
    <var-decl name='_gnutls_sha_x86_ssse3' type-id='type-id-252' visibility='default'/>
    <function-decl name='nettle_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha1_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha256_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha224_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha512_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='nettle_sha384_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-90'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='x86-common.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='gnutls_crypto_single_cipher_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_crypto_single_mac_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-258'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_crypto_single_digest_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_priority_update_non_aesni' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='padlock_capability' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='secure_getenv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='memcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='alert.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_error_is_fatal' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_name' mangled-name='gnutls_alert_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-260' name='alert'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_strname' mangled-name='gnutls_alert_get_strname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_strname@@GNUTLS_3_4'>
      <parameter type-id='type-id-260' name='alert'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_alert_send' mangled-name='gnutls_alert_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-262' name='level'/>
      <parameter type-id='type-id-260' name='desc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_error_to_alert' mangled-name='gnutls_error_to_alert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_to_alert@@GNUTLS_3_4'>
      <parameter type-id='type-id-7' name='err'/>
      <parameter type-id='type-id-9' name='level'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_alert_send_appropriate' mangled-name='gnutls_alert_send_appropriate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send_appropriate@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-7' name='err'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_alert_get' mangled-name='gnutls_alert_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-260'/>
    </function-decl>
    <function-decl name='_gnutls_epoch_get' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_send_tlen_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-266'/>
    </function-decl>
    <function-decl name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert_types.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-268'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <function-decl name='c_strcasecmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get_name' mangled-name='gnutls_certificate_type_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-267' name='type'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get_id' mangled-name='gnutls_certificate_type_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_list' mangled-name='gnutls_certificate_type_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_list@@GNUTLS_3_4'>
      <return type-id='type-id-269'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphers.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-171' const='yes' id='type-id-270'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <function-decl name='_gnutls_cipher_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_cipher_to_entry' mangled-name='_gnutls_cipher_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_cipher_to_entry@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-171' name='c'/>
      <return type-id='type-id-272'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_block_size' mangled-name='gnutls_cipher_get_block_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_block_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_tag_size' mangled-name='gnutls_cipher_get_tag_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_tag_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_iv_size' mangled-name='gnutls_cipher_get_iv_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_iv_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_key_size' mangled-name='gnutls_cipher_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_key_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_name' mangled-name='gnutls_cipher_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_id' mangled-name='gnutls_cipher_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-171'/>
    </function-decl>
    <function-decl name='gnutls_cipher_list' mangled-name='gnutls_cipher_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_list@@GNUTLS_3_4'>
      <return type-id='type-id-271'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ciphersuites.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <function-decl name='_gnutls_version_max' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='_gnutls_kx_needs_dh_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_gnutls_map_kx_get_cred' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-280'/>
    </function-decl>
    <function-decl name='_gnutls_id_to_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-281'/>
    </function-decl>
    <function-decl name='_gnutls_get_cred' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-280'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gnutls_select_server_cert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_mac_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_hello_ext_get_priv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-8' id='type-id-285'/>
    <function-decl name='_gnutls_buffer_append_data_prefix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_get_name' mangled-name='gnutls_cipher_suite_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-274' name='kx_algorithm'/>
      <parameter type-id='type-id-171' name='cipher_algorithm'/>
      <parameter type-id='type-id-244' name='mac_algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_info' mangled-name='gnutls_cipher_suite_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_info@@GNUTLS_3_4'>
      <parameter type-id='type-id-6' name='idx'/>
      <parameter type-id='type-id-168' name='cs_id'/>
      <parameter type-id='type-id-275' name='kx'/>
      <parameter type-id='type-id-273' name='cipher'/>
      <parameter type-id='type-id-276' name='mac'/>
      <parameter type-id='type-id-278' name='min_version'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_priority_get_cipher_suite_index' mangled-name='gnutls_priority_get_cipher_suite_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_get_cipher_suite_index@@GNUTLS_3_4'>
      <parameter type-id='type-id-287' name='pcache'/>
      <parameter type-id='type-id-143' name='idx'/>
      <parameter type-id='type-id-253' name='sidx'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ecc.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <function-decl name='gnutls_ecc_curve_list' mangled-name='gnutls_ecc_curve_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_list@@GNUTLS_3_4'>
      <return type-id='type-id-289'/>
    </function-decl>
    <function-decl name='_gnutls_ecc_curve_is_supported' mangled-name='_gnutls_ecc_curve_is_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_ecc_curve_is_supported@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-290' name='curve'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_ecc_curve' mangled-name='gnutls_oid_to_ecc_curve' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_ecc_curve@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='oid'/>
      <return type-id='type-id-290'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_id' mangled-name='gnutls_ecc_curve_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-290'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_name' mangled-name='gnutls_ecc_curve_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-290' name='curve'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_oid' mangled-name='gnutls_ecc_curve_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-290' name='curve'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_size' mangled-name='gnutls_ecc_curve_get_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-290' name='curve'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_pk' mangled-name='gnutls_ecc_curve_get_pk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_get_pk@@GNUTLS_3_4'>
      <parameter type-id='type-id-290' name='curve'/>
      <return type-id='type-id-291'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='groups.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-293'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-294'/>
    <function-decl name='gnutls_group_list' mangled-name='gnutls_group_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_list@@GNUTLS_3_6_0'>
      <return type-id='type-id-294'/>
    </function-decl>
    <function-decl name='gnutls_group_get_id' mangled-name='gnutls_group_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_id@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-292'/>
    </function-decl>
    <function-decl name='gnutls_group_get_name' mangled-name='gnutls_group_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_name@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-292' name='group'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='kx.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-295'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-296'/>
    <function-decl name='gnutls_sec_param_to_pk_bits' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_prime_bits' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_kx_get_name' mangled-name='gnutls_kx_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-274' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_kx_get_id' mangled-name='gnutls_kx_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-274'/>
    </function-decl>
    <function-decl name='gnutls_kx_list' mangled-name='gnutls_kx_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_list@@GNUTLS_3_4'>
      <return type-id='type-id-296'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mac.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-247' const='yes' id='type-id-298'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <qualified-type-def type-id='type-id-244' const='yes' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <function-decl name='_gnutls_digest_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_name' mangled-name='gnutls_mac_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_name' mangled-name='gnutls_digest_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-247' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_id' mangled-name='gnutls_digest_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-247'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_id' mangled-name='gnutls_mac_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_key_size' mangled-name='gnutls_mac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_key_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_nonce_size' mangled-name='gnutls_mac_get_nonce_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_nonce_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_mac_list' mangled-name='gnutls_mac_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_list@@GNUTLS_3_4'>
      <return type-id='type-id-301'/>
    </function-decl>
    <function-decl name='gnutls_digest_list' mangled-name='gnutls_digest_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_list@@GNUTLS_3_4'>
      <return type-id='type-id-299'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_digest' mangled-name='gnutls_oid_to_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_digest@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='oid'/>
      <return type-id='type-id-247'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_mac' mangled-name='gnutls_oid_to_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_mac@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='oid'/>
      <return type-id='type-id-244'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_oid' mangled-name='gnutls_digest_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-247' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='protocols.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-302'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <function-decl name='_gnutls_allowlisting_mode' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_gnutls_version_to_entry' mangled-name='_gnutls_version_to_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_version_to_entry@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-277' name='version'/>
      <return type-id='type-id-279'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_name' mangled-name='gnutls_protocol_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-277' name='version'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_id' mangled-name='gnutls_protocol_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-277'/>
    </function-decl>
    <function-decl name='gnutls_protocol_list' mangled-name='gnutls_protocol_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_list@@GNUTLS_3_4'>
      <return type-id='type-id-303'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='publickey.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_pk_algorithm_get_name' mangled-name='gnutls_pk_algorithm_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_algorithm_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-291' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_pk_list' mangled-name='gnutls_pk_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_list@@GNUTLS_3_4'>
      <return type-id='type-id-304'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_id' mangled-name='gnutls_pk_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-291'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_name' mangled-name='gnutls_pk_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-291' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_pk' mangled-name='gnutls_oid_to_pk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_pk@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='oid'/>
      <return type-id='type-id-291'/>
    </function-decl>
    <function-decl name='gnutls_pk_get_oid' mangled-name='gnutls_pk_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-291' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='secparams.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_sec_param_to_symmetric_bits' mangled-name='gnutls_sec_param_to_symmetric_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_to_symmetric_bits@@GNUTLS_3_4'>
      <parameter type-id='type-id-297' name='param'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_sec_param_get_name' mangled-name='gnutls_sec_param_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sec_param_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-297' name='param'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_pk_bits_to_sec_param' mangled-name='gnutls_pk_bits_to_sec_param' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_bits_to_sec_param@@GNUTLS_3_4'>
      <parameter type-id='type-id-291' name='algo'/>
      <parameter type-id='type-id-143' name='bits'/>
      <return type-id='type-id-297'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sign.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-306'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <function-decl name='_gnutls_privkey_compatible_with_sig' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='_gnutls_digest_is_insecure2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_name' mangled-name='gnutls_sign_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-305' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_sign_is_secure' mangled-name='gnutls_sign_is_secure' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_is_secure@@GNUTLS_3_4'>
      <parameter type-id='type-id-305' name='algorithm'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_sign_is_secure2' mangled-name='gnutls_sign_is_secure2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_is_secure2@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-305' name='algorithm'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_sign_list' mangled-name='gnutls_sign_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_list@@GNUTLS_3_4'>
      <return type-id='type-id-307'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_id' mangled-name='gnutls_sign_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-305'/>
    </function-decl>
    <function-decl name='gnutls_oid_to_sign' mangled-name='gnutls_oid_to_sign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_oid_to_sign@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='oid'/>
      <return type-id='type-id-305'/>
    </function-decl>
    <function-decl name='gnutls_pk_to_sign' mangled-name='gnutls_pk_to_sign' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_to_sign@@GNUTLS_3_4'>
      <parameter type-id='type-id-291' name='pk'/>
      <parameter type-id='type-id-247' name='hash'/>
      <return type-id='type-id-305'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_oid' mangled-name='gnutls_sign_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-305' name='sign'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_hash_algorithm' mangled-name='gnutls_sign_get_hash_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_hash_algorithm@@GNUTLS_3_4'>
      <parameter type-id='type-id-305' name='sign'/>
      <return type-id='type-id-247'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_pk_algorithm' mangled-name='gnutls_sign_get_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_pk_algorithm@@GNUTLS_3_4'>
      <parameter type-id='type-id-305' name='sign'/>
      <return type-id='type-id-291'/>
    </function-decl>
    <function-decl name='gnutls_sign_supports_pk_algorithm' mangled-name='gnutls_sign_supports_pk_algorithm' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_supports_pk_algorithm@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-305' name='sign'/>
      <parameter type-id='type-id-291' name='pk'/>
      <return type-id='type-id-143'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon_cred.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_anon_client_credentials_st' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_anon_server_credentials_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dh_params' type-id='type-id-311' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='deinit_dh_params' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dh_sec_param' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='params_func' type-id='type-id-312' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_anon_client_credentials_t' type-id='type-id-313' id='type-id-314'/>
    <typedef-decl name='gnutls_anon_server_credentials_t' type-id='type-id-315' id='type-id-316'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-315'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-318'/>
    <class-decl name='gnutls_x509_privkey_int' size-in-bits='4288' is-struct='yes' visibility='default' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-320' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='expanded' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='flags' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='key' type-id='type-id-321' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='pin' type-id='type-id-322' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_dh_params_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_anon_free_server_credentials' mangled-name='gnutls_anon_free_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-316' name='sc'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_server_credentials' mangled-name='gnutls_anon_allocate_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-318' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_anon_free_client_credentials' mangled-name='gnutls_anon_free_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-314' name='sc'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_client_credentials' mangled-name='gnutls_anon_allocate_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-317' name='sc'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_dh_params' mangled-name='gnutls_anon_set_server_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-316' name='res'/>
      <parameter type-id='type-id-311' name='dh_params'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_known_dh_params' mangled-name='gnutls_anon_set_server_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_known_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-316' name='res'/>
      <parameter type-id='type-id-297' name='sec_param'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_params_function' mangled-name='gnutls_anon_set_server_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_params_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-316' name='res'/>
      <parameter type-id='type-id-312' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-323'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-324'/>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='atfork.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='__register_atfork' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <var-decl name='_gnutls_forkid' type-id='type-id-143' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='auth.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='dh_info_st' size-in-bits='448' is-struct='yes' naming-typedef-id='type-id-326' visibility='default' id='type-id-327'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret_bits' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prime' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generator' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='public_key' type-id='type-id-328' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dh_info_st' type-id='type-id-327' id='type-id-326'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-329'/>
    <function-decl name='_gnutls_free_dh_info' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_credentials_clear' mangled-name='gnutls_credentials_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_clear@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' mangled-name='gnutls_credentials_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-280' name='type'/>
      <parameter type-id='type-id-8' name='cred'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_credentials_get' mangled-name='gnutls_credentials_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-280' name='type'/>
      <parameter type-id='type-id-91' name='cred'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_auth_get_type' mangled-name='gnutls_auth_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-280'/>
    </function-decl>
    <function-decl name='gnutls_auth_server_get_type' mangled-name='gnutls_auth_server_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_server_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-280'/>
    </function-decl>
    <function-decl name='gnutls_auth_client_get_type' mangled-name='gnutls_auth_client_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_client_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-280'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_auth_info_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_gen_dh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_dh_common_print_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dh_common_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_figure_dh_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='anon_ecdh.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_ecdh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_ecdh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-331'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_ecdh_common_print_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-331'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_ecdh_common_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <enum-decl name='encipher_type' id='type-id-332'>
      <underlying-type type-id='type-id-129'/>
      <enumerator name='CIPHER_ENCRYPT' value='0'/>
      <enumerator name='CIPHER_SIGN' value='1'/>
      <enumerator name='CIPHER_IGN' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-339'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-341'/>
    <function-decl name='_gnutls_kx_supports_pk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='_gnutls_kx_supports_pk_usage' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='_gnutls_kx_encipher_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-332'/>
    </function-decl>
    <function-decl name='_gnutls_tls_aid_to_sign' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-305'/>
    </function-decl>
    <function-decl name='_gnutls_sign_to_tls_aid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='_gnutls_get_auth_info_pcert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-267'/>
      <parameter type-id='type-id-343'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_session_get_sign_algo' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-305'/>
    </function-decl>
    <function-decl name='_gnutls_sign_algorithm_parse_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_sign_algorithm_write_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_session_sign_algo_enabled' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pubkey_get_pk_algorithm' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_pcert_import_x509_raw' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pcert_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_pcert_import_rawpk_raw' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_server_name_get' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_buffer_append_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-347'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_rdn_get2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_prefix' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_check_key_usage_for_sig' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_sign_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_sign_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-348'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_verify_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_verify_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='asn1_node_st' type-id='type-id-341' id='type-id-337'/>
    <typedef-decl name='asn1_node' type-id='type-id-338' id='type-id-335'/>
    <typedef-decl name='asn1_node_const' type-id='type-id-340' id='type-id-349'/>
    <function-decl name='asn1_create_element' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-349'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-336'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='asn1_delete_structure' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-336'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='asn1_der_decoding' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-336'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='asn1_der_decoding_startEnd' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-335'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dh_common.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_set_psk_session_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='bigint_t' type-id='type-id-8' id='type-id-350'/>
    <function-decl name='gnutls_pk_params_release' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_pk_params_clear' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_pk_params_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_audit_log' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_init_scan_nz' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-352'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_dh_set_secret_bits' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_dh_set_peer_public' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-350'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_dh_save_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-350'/>
      <parameter type-id='type-id-350'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_mpi' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-350'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dhe.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_cert_server_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_client_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_client_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_server_cert_req' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_cert_cert_req' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_cert_client_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_gen_dhe_signature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dhe_signature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dhe_psk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-354'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-331'/>
    <function-decl name='_gnutls_gen_dh_common_client_kx_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_gen_ecdh_common_client_kx_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_psk_pwd_find_entry' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-355'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-356'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_find_psk_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-357'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-356'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ecdhe.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_ecc_curve_get_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <return type-id='type-id-358'/>
    </function-decl>
    <function-decl name='_gnutls_tls_id_to_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-281'/>
    </function-decl>
    <typedef-decl name='bigint_t' type-id='type-id-8' id='type-id-359'/>
    <function-decl name='_gnutls_set_datum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_ecc_ansi_x962_import' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-352'/>
      <parameter type-id='type-id-352'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_ecc_ansi_x962_export' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <parameter type-id='type-id-359'/>
      <parameter type-id='type-id-359'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_session_supports_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='psk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-type size-in-bits='64' id='type-id-360'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-362'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-363'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-356'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='psk_passwd.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <class-decl name='gnutls_anti_replay_st' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-364'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='window' type-id='type-id-161' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start_time' type-id='type-id-365' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='db_add_func' type-id='type-id-366' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='db_ptr' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_privkey_st' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-368' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pk_algorithm' type-id='type-id-291' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='flags' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pin' type-id='type-id-322' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_supplemental_entry_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-371' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='supp_recv_func' type-id='type-id-372' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supp_send_func' type-id='type-id-373' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_x509_crl_int' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-374'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crl' type-id='type-id-321' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expanded' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rcache' type-id='type-id-321' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rcache_idx' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='use_extensions' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='der' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='raw_issuer_dn' type-id='type-id-328' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_x509_crt_int' size-in-bits='1088' is-struct='yes' visibility='default' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cert' type-id='type-id-321' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_extensions' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='expanded' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='modified' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flags' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pin' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='raw_dn' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='raw_issuer_dn' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='raw_spki' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='der' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='san' type-id='type-id-376' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ian' type-id='type-id-376' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dn' type-id='type-id-377' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='idn' type-id='type-id-377' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='hello_ext_entry_st' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-378'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_struct' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tls_id' type-id='type-id-355' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gid' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='client_parse_point' type-id='type-id-379' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='server_parse_point' type-id='type-id-379' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='validity' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recv_func' type-id='type-id-380' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_func' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='deinit_func' type-id='type-id-382' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pack_func' type-id='type-id-383' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unpack_func' type-id='type-id-384' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cannot_be_overriden' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_rnd' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-385'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-8' id='type-id-386'/>
    <function-decl name='gnutls_hex_decode2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-8' id='type-id-387'/>
    <function-decl name='__getdelim' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-388'/>
      <parameter type-id='type-id-389'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-390'/>
    </function-decl>
    <function-decl name='strncmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-391'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-328'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-392'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-393'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-345'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-394'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-396'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-397'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-398'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-399'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-400'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-403'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-404'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-405'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-406'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-266'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-408'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-409'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-266'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='rsa.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <class-decl name='gnutls_privkey_st' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-368' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pk_algorithm' type-id='type-id-291' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='flags' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pin' type-id='type-id-322' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pkcs11_privkey_st' size-in-bits='3392' is-struct='yes' visibility='default' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk_algorithm' type-id='type-id-291' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_ok' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uinfo' type-id='type-id-411' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='url' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sinfo' type-id='type-id-412' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='ref' type-id='type-id-413' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='reauth' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='mutex' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='pin' type-id='type-id-322' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='_gnutls_pubkey_get_mpis' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='bigint_t' type-id='type-id-8' id='type-id-414'/>
    <function-decl name='gnutls_pubkey_get_key_usage' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_decrypt_data2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-8' id='type-id-415'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-8' id='type-id-416'/>
    <function-type size-in-bits='64' id='type-id-417'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-305'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-418'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-419'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-420'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-421'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-422'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='rsa_psk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_psk_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_get_public_rsa_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='bigint_t' type-id='type-id-8' id='type-id-423'/>
  </abi-instr>
  <abi-instr address-size='64' path='srp_kx.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <var-decl name='gnutls_srp_8192_group_prime' type-id='type-id-424' mangled-name='gnutls_srp_8192_group_prime' visibility='default' elf-symbol-id='gnutls_srp_8192_group_prime@@GNUTLS_3_6_2'/>
    <var-decl name='gnutls_srp_8192_group_generator' type-id='type-id-424' mangled-name='gnutls_srp_8192_group_generator' visibility='default' elf-symbol-id='gnutls_srp_8192_group_generator@@GNUTLS_3_6_2'/>
    <var-decl name='gnutls_srp_4096_group_prime' type-id='type-id-424' mangled-name='gnutls_srp_4096_group_prime' visibility='default' elf-symbol-id='gnutls_srp_4096_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_4096_group_generator' type-id='type-id-424' mangled-name='gnutls_srp_4096_group_generator' visibility='default' elf-symbol-id='gnutls_srp_4096_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_prime' type-id='type-id-424' mangled-name='gnutls_srp_3072_group_prime' visibility='default' elf-symbol-id='gnutls_srp_3072_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_3072_group_generator' type-id='type-id-424' mangled-name='gnutls_srp_3072_group_generator' visibility='default' elf-symbol-id='gnutls_srp_3072_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_prime' type-id='type-id-424' mangled-name='gnutls_srp_2048_group_prime' visibility='default' elf-symbol-id='gnutls_srp_2048_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_2048_group_generator' type-id='type-id-424' mangled-name='gnutls_srp_2048_group_generator' visibility='default' elf-symbol-id='gnutls_srp_2048_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_prime' type-id='type-id-424' mangled-name='gnutls_srp_1536_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1536_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1536_group_generator' type-id='type-id-424' mangled-name='gnutls_srp_1536_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1536_group_generator@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1024_group_prime' type-id='type-id-424' mangled-name='gnutls_srp_1024_group_prime' visibility='default' elf-symbol-id='gnutls_srp_1024_group_prime@@GNUTLS_3_4'/>
    <var-decl name='gnutls_srp_1024_group_generator' type-id='type-id-424' mangled-name='gnutls_srp_1024_group_generator' visibility='default' elf-symbol-id='gnutls_srp_1024_group_generator@@GNUTLS_3_4'/>
  </abi-instr>
  <abi-instr address-size='64' path='srp_sb64.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='gnutls_srp_base64_encode' mangled-name='gnutls_srp_base64_encode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode@@GNUTLS_3_4'>
      <parameter type-id='type-id-345' name='data'/>
      <parameter type-id='type-id-5' name='result'/>
      <parameter type-id='type-id-2' name='result_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_srp_base64_encode2' mangled-name='gnutls_srp_base64_encode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_srp_base64_encode2@@GNUTLS_3_4'>
      <parameter type-id='type-id-345' name='data'/>
      <parameter type-id='type-id-330' name='result'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vko_gost.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib/auth' language='LANG_C11'>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-427'/>
    <function-decl name='_gnutls_ecc_curve_get_group' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <return type-id='type-id-292'/>
    </function-decl>
    <typedef-decl name='bigint_t' type-id='type-id-8' id='type-id-429'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-428' id='type-id-425'/>
    <function-decl name='gnutls_hash_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-426'/>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hash' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-425'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hash_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-425'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_hash_get_len' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='_gnutls_bin2hex' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_gnutls_gost_keytrans_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-351'/>
      <parameter type-id='type-id-351'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_gost_keytrans_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-351'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='asn1_get_length_der' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-101'/>
    </function-decl>
    <function-decl name='asn1_length_der' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-97'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-90'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='auto-verify.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_session_set_verify_function' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-430'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-431'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_cert' mangled-name='gnutls_session_set_verify_cert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-3' name='hostname'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_cert2' mangled-name='gnutls_session_set_verify_cert2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_cert2@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-431' name='data'/>
      <parameter type-id='type-id-143' name='elements'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_session_get_verify_cert_status' mangled-name='gnutls_session_get_verify_cert_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_verify_cert_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-143'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='buffers.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='__compar_fn_t' type-id='type-id-55' id='type-id-432'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-55'/>
    <function-decl name='gnutls_handshake_description_get_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-8' id='type-id-433'/>
    <function-decl name='gnutls_system_recv_timeout' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-433'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_record_check_pending' mangled-name='gnutls_record_check_pending' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_pending@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='gnutls_record_check_corked' mangled-name='gnutls_record_check_corked' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_corked@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_gnutls_recv_in_buffers' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-266'/>
    </function-decl>
    <function-decl name='_gnutls_packet2str' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_dtls_transmit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_timespec_sub_ms' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='_mbuffer_enqueue' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-435'/>
      <parameter type-id='type-id-436'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_mbuffer_dequeue' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-435'/>
      <parameter type-id='type-id-436'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='_mbuffer_head_remove_bytes' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-435'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_mbuffer_head_get_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-435'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='_mbuffer_head_get_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-436'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='_mbuffer_head_push_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-435'/>
      <parameter type-id='type-id-436'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_mbuffer_head_pop_first' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-435'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='_mbuffer_alloc_align16' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='_mbuffer_linearize_align16' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-435'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_clear' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_resize' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='system_read' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-433'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-266'/>
    </function-decl>
    <function-decl name='qsort' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-432'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nanosleep' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-437'/>
      <parameter type-id='type-id-434'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-rawpk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='_gnutls_read_file' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='gnutls_pubkey_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-438'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pubkey_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_pubkey_import_url' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pcert_import_rawpk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_idna_map' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_url_is_supported' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_rawpk_key_mem' mangled-name='gnutls_certificate_set_rawpk_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_mem@@GNUTLS_3_6_6'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-345' name='spki'/>
      <parameter type-id='type-id-345' name='pkey'/>
      <parameter type-id='type-id-346' name='format'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-143' name='key_usage'/>
      <parameter type-id='type-id-440' name='names'/>
      <parameter type-id='type-id-143' name='names_length'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_rawpk_key_file' mangled-name='gnutls_certificate_set_rawpk_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_rawpk_key_file@@GNUTLS_3_6_6'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-3' name='rawpkfile'/>
      <parameter type-id='type-id-3' name='privkeyfile'/>
      <parameter type-id='type-id-346' name='format'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-143' name='key_usage'/>
      <parameter type-id='type-id-440' name='names'/>
      <parameter type-id='type-id-143' name='names_length'/>
      <parameter type-id='type-id-143' name='privkey_flags'/>
      <parameter type-id='type-id-143' name='pkcs11_flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_certificate_credential_append_keypair' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-439'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-441'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_read_key_mem' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-439'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_read_key_file' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-439'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_check_key_cert_match' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-439'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred-x509.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_pkcs12_int' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-443'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pkcs12' type-id='type-id-444' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expanded' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_pkcs12_t' type-id='type-id-445' id='type-id-446'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-447'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-455'/>
    <class-decl name='gnutls_x509_trust_list_st' size-in-bits='704' is-struct='yes' visibility='default' id='type-id-456'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='node' type-id='type-id-457' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x509_rdn_sequence' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='distrusted' type-id='type-id-458' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='distrusted_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='keep_certs' type-id='type-id-458' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='keep_certs_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pkcs11_token' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='issuer_callback' type-id='type-id-459' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='usr_ptr' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_privkey_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_set_pin_function' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-460'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_x509' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-461'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_export_x509' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-462'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_x509_raw' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_url' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pcert_import_x509' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pcert_import_x509_list' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-458'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pcert_export_x509' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-458'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-451'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-446'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_import' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-446'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_verify_mac' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-446'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pkcs12_simple_parse' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-446'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-462'/>
      <parameter type-id='type-id-463'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-463'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-452'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-458'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_import' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-346'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_import_url' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_dn_by_oid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_set_pin_function' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-460'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_subject_alt_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crl_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-452'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crl_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-402'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_check_issuer' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_x509_privkey_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-461'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_cas' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-450'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_crls' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-448'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_trust_mem' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_trust_file' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_trust_dir' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_add_system_trust' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_x509_crt_cpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_x509_crl_cpy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-402'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem' mangled-name='gnutls_certificate_set_x509_key_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-345' name='cert'/>
      <parameter type-id='type-id-345' name='key'/>
      <parameter type-id='type-id-346' name='type'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_mem2' mangled-name='gnutls_certificate_set_x509_key_mem2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_mem2@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-345' name='cert'/>
      <parameter type-id='type-id-345' name='key'/>
      <parameter type-id='type-id-346' name='type'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key' mangled-name='gnutls_certificate_set_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-458' name='cert_list'/>
      <parameter type-id='type-id-7' name='cert_list_size'/>
      <parameter type-id='type-id-461' name='key'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_key' mangled-name='gnutls_certificate_get_x509_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-143' name='index'/>
      <parameter type-id='type-id-462' name='key'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_x509_crt' mangled-name='gnutls_certificate_get_x509_crt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_x509_crt@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-143' name='index'/>
      <parameter type-id='type-id-463' name='crt_list'/>
      <parameter type-id='type-id-253' name='crt_list_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_trust_list' mangled-name='gnutls_certificate_set_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_trust_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-464' name='tlist'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_trust_list' mangled-name='gnutls_certificate_get_trust_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_trust_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-465' name='tlist'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file' mangled-name='gnutls_certificate_set_x509_key_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-3' name='certfile'/>
      <parameter type-id='type-id-3' name='keyfile'/>
      <parameter type-id='type-id-346' name='type'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file2' mangled-name='gnutls_certificate_set_x509_key_file2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file2@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-3' name='certfile'/>
      <parameter type-id='type-id-3' name='keyfile'/>
      <parameter type-id='type-id-346' name='type'/>
      <parameter type-id='type-id-3' name='pass'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_mem' mangled-name='gnutls_certificate_set_x509_trust_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-345' name='ca'/>
      <parameter type-id='type-id-346' name='type'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust' mangled-name='gnutls_certificate_set_x509_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-458' name='ca_list'/>
      <parameter type-id='type-id-7' name='ca_list_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_file' mangled-name='gnutls_certificate_set_x509_trust_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-3' name='cafile'/>
      <parameter type-id='type-id-346' name='type'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_dir' mangled-name='gnutls_certificate_set_x509_trust_dir' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_dir@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-3' name='ca_dir'/>
      <parameter type-id='type-id-346' name='type'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_system_trust' mangled-name='gnutls_certificate_set_x509_system_trust' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_system_trust@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='cred'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_mem' mangled-name='gnutls_certificate_set_x509_crl_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-345' name='CRL'/>
      <parameter type-id='type-id-346' name='type'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl' mangled-name='gnutls_certificate_set_x509_crl' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-452' name='crl_list'/>
      <parameter type-id='type-id-7' name='crl_list_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_crl_file' mangled-name='gnutls_certificate_set_x509_crl_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_crl_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-3' name='crlfile'/>
      <parameter type-id='type-id-346' name='type'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_file' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_file@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-3' name='pkcs12file'/>
      <parameter type-id='type-id-346' name='type'/>
      <parameter type-id='type-id-3' name='password'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_simple_pkcs12_mem' mangled-name='gnutls_certificate_set_x509_simple_pkcs12_mem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_simple_pkcs12_mem@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-345' name='p12blob'/>
      <parameter type-id='type-id-346' name='type'/>
      <parameter type-id='type-id-3' name='password'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_crls' mangled-name='gnutls_certificate_free_crls' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_crls@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='sc'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_pin_function' mangled-name='gnutls_certificate_set_pin_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_pin_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-460' name='fn'/>
      <parameter type-id='type-id-8' name='userdata'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_reallocarray' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gnutls_url_is_known' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_get_raw_issuer' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='asn1_node_st' type-id='type-id-455' id='type-id-453'/>
    <typedef-decl name='asn1_node' type-id='type-id-454' id='type-id-444'/>
    <function-decl name='memmem' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-466'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-cred.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_x509_trust_list_st' size-in-bits='704' is-struct='yes' visibility='default' id='type-id-456'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='node' type-id='type-id-457' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='x509_rdn_sequence' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='distrusted' type-id='type-id-458' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='distrusted_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='keep_certs' type-id='type-id-458' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='keep_certs_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pkcs11_token' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='issuer_callback' type-id='type-id-459' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='usr_ptr' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_x509_trust_list_getissuer_function' type-id='type-id-467' id='type-id-468'/>
    <qualified-type-def type-id='type-id-401' const='yes' id='type-id-449'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-469'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-470'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-463'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-459'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-465'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-457'/>
    <class-decl name='node_st' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-471'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trusted_cas' type-id='type-id-458' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trusted_ca_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='named_certs' type-id='type-id-472' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='named_cert_size' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='crls' type-id='type-id-452' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='crl_size' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_pubkey_verify_data2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-305'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-345'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_get_pk_algorithm' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_import_pkcs11' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-473'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_sign_data2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-305'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-465'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_get_issuer' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-458'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls13_sign_get_compatible_with_privkey' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-474'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_key' mangled-name='gnutls_certificate_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_key@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-440' name='names'/>
      <parameter type-id='type-id-7' name='names_size'/>
      <parameter type-id='type-id-342' name='pcert_list'/>
      <parameter type-id='type-id-7' name='pcert_list_size'/>
      <parameter type-id='type-id-308' name='key'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_keys' mangled-name='gnutls_certificate_free_keys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_keys@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='sc'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_cas' mangled-name='gnutls_certificate_free_cas' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_cas@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='sc'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_issuer' mangled-name='gnutls_certificate_get_issuer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_issuer@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='sc'/>
      <parameter type-id='type-id-401' name='cert'/>
      <parameter type-id='type-id-458' name='issuer'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_crt_raw' mangled-name='gnutls_certificate_get_crt_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_crt_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='sc'/>
      <parameter type-id='type-id-143' name='idx1'/>
      <parameter type-id='type-id-143' name='idx2'/>
      <parameter type-id='type-id-330' name='cert'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_ca_names' mangled-name='gnutls_certificate_free_ca_names' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_ca_names@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='sc'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_credentials' mangled-name='gnutls_certificate_free_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='sc'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_allocate_credentials' mangled-name='gnutls_certificate_allocate_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_allocate_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-469' name='res'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_server_set_request' mangled-name='gnutls_certificate_server_set_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_server_set_request@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-475' name='req'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function' mangled-name='gnutls_certificate_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-476' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function2' mangled-name='gnutls_certificate_set_retrieve_function2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function2@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-477' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_retrieve_function3' mangled-name='gnutls_certificate_set_retrieve_function3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_retrieve_function3@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-478' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_function' mangled-name='gnutls_certificate_set_verify_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='cred'/>
      <parameter type-id='type-id-430' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_getissuer_function' mangled-name='gnutls_x509_trust_list_set_getissuer_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_getissuer_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-464' name='tlist'/>
      <parameter type-id='type-id-459' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_set_ptr' mangled-name='gnutls_x509_trust_list_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_set_ptr@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-464' name='tlist'/>
      <parameter type-id='type-id-8' name='ptr'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_get_ptr' mangled-name='gnutls_x509_trust_list_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_x509_trust_list_get_ptr@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-464' name='tlist'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gnutls_session_set_verify_output_function' mangled-name='gnutls_session_set_verify_output_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_verify_output_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-479' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verification_status_print' mangled-name='gnutls_certificate_verification_status_print' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verification_status_print@@GNUTLS_3_4'>
      <parameter type-id='type-id-143' name='status'/>
      <parameter type-id='type-id-267' name='type'/>
      <parameter type-id='type-id-330' name='out'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_dh_params' mangled-name='gnutls_certificate_set_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-311' name='dh_params'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_known_dh_params' mangled-name='gnutls_certificate_set_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_known_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-297' name='sec_param'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_get_x509_name' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-470'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_reallocarray_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_str' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_to_datum' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-467'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-449'/>
      <parameter type-id='type-id-463'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-480'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-481'/>
      <parameter type-id='type-id-482'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-483'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-442'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-484'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-482'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-485'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-486'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='cert-session.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_ocsp_verify_reason_t' id='type-id-487'>
      <underlying-type type-id='type-id-129'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_NOT_FOUND' value='1'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNER_KEYUSAGE_ERROR' value='2'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_UNTRUSTED_SIGNER' value='4'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_INSECURE_ALGORITHM' value='8'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_SIGNATURE_FAILURE' value='16'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_NOT_ACTIVATED' value='32'/>
      <enumerator name='GNUTLS_OCSP_VERIFY_CERT_EXPIRED' value='64'/>
    </enum-decl>
    <class-decl name='gnutls_x509_tlsfeatures_st' size-in-bits='1056' is-struct='yes' visibility='default' id='type-id-488'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='feature' type-id='type-id-489' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='size' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_ocsp_resp_const_t' type-id='type-id-490' id='type-id-491'/>
    <typedef-decl name='gnutls_ocsp_resp_t' type-id='type-id-492' id='type-id-493'/>
    <typedef-decl name='gnutls_ocsp_verify_reason_t' type-id='type-id-487' id='type-id-494'/>
    <typedef-decl name='gnutls_x509_tlsfeatures_t' type-id='type-id-495' id='type-id-496'/>
    <array-type-def dimensions='1' type-id='type-id-355' size-in-bits='1024' id='type-id-489'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-97' id='type-id-162'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-498'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-490'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-492'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-499'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-495'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-500'/>
    <class-decl name='gnutls_ocsp_resp_int' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-497'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resp' type-id='type-id-501' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response_type_oid' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='basicresp' type-id='type-id-501' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='der' type-id='type-id-328' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='init' type-id='type-id-143' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_strerror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_status_request_get2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-499'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-493'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_import' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-493'/>
      <parameter type-id='type-id-345'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_get_status' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-491'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_get_single' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-491'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-502'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-503'/>
      <parameter type-id='type-id-503'/>
      <parameter type-id='type-id-503'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_verify_direct' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-491'/>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_verify' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-491'/>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_ocsp_resp_check_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-491'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_activation_time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-504'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_expiration_time' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <return type-id='type-id-504'/>
    </function-decl>
    <function-decl name='gnutls_x509_tlsfeatures_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-500'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_tlsfeatures_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-496'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_tlsfeatures_get' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-496'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_crt_get_tlsfeatures' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-496'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_trust_list_verify_crt2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-464'/>
      <parameter type-id='type-id-458'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-431'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-479'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_ours' mangled-name='gnutls_certificate_get_ours' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_ours@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-345'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_peers' mangled-name='gnutls_certificate_get_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-253' name='list_size'/>
      <return type-id='type-id-345'/>
    </function-decl>
    <function-decl name='gnutls_certificate_client_get_request_status' mangled-name='gnutls_certificate_client_get_request_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_client_get_request_status@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_params_function' mangled-name='gnutls_certificate_set_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_params_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-312' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_flags' mangled-name='gnutls_certificate_set_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_flags' mangled-name='gnutls_certificate_set_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_get_verify_flags' mangled-name='gnutls_certificate_get_verify_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_get_verify_flags@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_limits' mangled-name='gnutls_certificate_set_verify_limits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_limits@@GNUTLS_3_4'>
      <parameter type-id='type-id-439' name='res'/>
      <parameter type-id='type-id-143' name='max_bits'/>
      <parameter type-id='type-id-143' name='max_depth'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers3' mangled-name='gnutls_certificate_verify_peers3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers3@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-3' name='hostname'/>
      <parameter type-id='type-id-253' name='status'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_certificate_expiration_time_peers' mangled-name='gnutls_certificate_expiration_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_expiration_time_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-504'/>
    </function-decl>
    <function-decl name='gnutls_certificate_activation_time_peers' mangled-name='gnutls_certificate_activation_time_peers' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_activation_time_peers@@GNUTLS_3_4'>
      <parameter type-id='type-id-261' name='session'/>
      <return type-id='type-id-504'/>
    </function-decl>
    <function-decl name='_gnutls_ocsp_verify_status_to_str' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-494'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cipher-cbc.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <function-decl name='_gnutls_make_preamble' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_add_auth' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-505'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_tag' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-505'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cipher.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <enum-decl name='gnutls_rnd_level' id='type-id-506'>
      <underlying-type type-id='type-id-129'/>
      <enumerator name='GNUTLS_RND_NONCE' value='0'/>
      <enumerator name='GNUTLS_RND_RANDOM' value='1'/>
      <enumerator name='GNUTLS_RND_KEY' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_aead_cipher_hd_t' type-id='type-id-507' id='type-id-508'/>
    <typedef-decl name='gnutls_rnd_level_t' type-id='type-id-506' id='type-id-385'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-507'/>
    <pointer-type-def type-id='type-id-510' size-in-bits='64' id='type-id-505'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-2'/>
    <function-decl name='gnutls_aead_cipher_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-508'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-508'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_data_mtu' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='cbc_mac_verify' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-511'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_encrypt2_tag' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-505'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_decrypt2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-505'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cipher_int.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='gnutls_crypto_cipher_st' size-in-bits='768' is-struct='yes' naming-typedef-id='type-id-512' visibility='default' id='type-id-513'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init' type-id='type-id-514' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='setkey' type-id='type-id-515' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='setiv' type-id='type-id-516' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='getiv' type-id='type-id-517' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='encrypt' type-id='type-id-518' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='decrypt' type-id='type-id-519' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='aead_encrypt' type-id='type-id-520' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='aead_decrypt' type-id='type-id-521' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='deinit' type-id='type-id-522' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='auth' type-id='type-id-523' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tag' type-id='type-id-524' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='exists' type-id='type-id-525' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_aead_decrypt_func' type-id='type-id-526' id='type-id-521'/>
    <typedef-decl name='gnutls_cipher_aead_encrypt_func' type-id='type-id-526' id='type-id-520'/>
    <typedef-decl name='gnutls_cipher_auth_func' type-id='type-id-527' id='type-id-523'/>
    <typedef-decl name='gnutls_cipher_decrypt_func' type-id='type-id-528' id='type-id-519'/>
    <typedef-decl name='gnutls_cipher_deinit_func' type-id='type-id-57' id='type-id-522'/>
    <typedef-decl name='gnutls_cipher_encrypt_func' type-id='type-id-528' id='type-id-518'/>
    <typedef-decl name='gnutls_cipher_getiv_func' type-id='type-id-527' id='type-id-517'/>
    <typedef-decl name='gnutls_cipher_init_func' type-id='type-id-529' id='type-id-514'/>
    <typedef-decl name='gnutls_cipher_setiv_func' type-id='type-id-527' id='type-id-516'/>
    <typedef-decl name='gnutls_cipher_setkey_func' type-id='type-id-527' id='type-id-515'/>
    <typedef-decl name='gnutls_cipher_tag_func' type-id='type-id-530' id='type-id-524'/>
    <typedef-decl name='gnutls_crypto_cipher_st' type-id='type-id-513' id='type-id-512'/>
    <qualified-type-def type-id='type-id-512' const='yes' id='type-id-169'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-257'/>
    <qualified-type-def type-id='type-id-531' const='yes' id='type-id-532'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-529'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-534'/>
    <function-decl name='_gnutls_get_crypto_cipher' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-257'/>
    </function-decl>
    <function-decl name='_gnutls_mac_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-534'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_mac_copy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-533'/>
      <parameter type-id='type-id-534'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_mac_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-534'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='compress.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-116'/>
    <qualified-type-def type-id='type-id-535' const='yes' id='type-id-536'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' id='type-id-537'/>
    <qualified-type-def type-id='type-id-8' restrict='yes' id='type-id-538'/>
    <function-decl name='gnutls_compression_get_name' mangled-name='gnutls_compression_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-535' name='algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_compression_get_id' mangled-name='gnutls_compression_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-535'/>
    </function-decl>
    <function-decl name='gnutls_compression_list' mangled-name='gnutls_compression_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_list@@GNUTLS_3_4'>
      <return type-id='type-id-537'/>
    </function-decl>
    <function-decl name='dlopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dlclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='dlsym' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-538'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strcasecmp' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='constate.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <function-decl name='_gnutls_cipher_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-540'/>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-505'/>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-505'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_handshake_set_secret_function' mangled-name='gnutls_handshake_set_secret_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_set_secret_function@@GNUTLS_3_7_0'>
      <parameter type-id='type-id-261' name='session'/>
      <parameter type-id='type-id-541' name='func'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_prf_raw' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_dtls_reset_window' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-542'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_record_overhead' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='_gnutls_switch_fips_state' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-543'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_generate_master' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_call_keylog_func' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_tls13_derive_secret' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_tls13_expand_secret' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_tls13_expand_secret2' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-api.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <class-decl name='api_cipher_hd_st' size-in-bits='1536' is-struct='yes' visibility='default' id='type-id-544'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-539' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctx_dec' type-id='type-id-539' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iov_iter_st' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-545'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov' type-id='type-id-407' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_count' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov_index' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iov_offset' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='block' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='block_size' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='block_offset' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_hd_t' type-id='type-id-546' id='type-id-547'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-546'/>
    <qualified-type-def type-id='type-id-548' const='yes' id='type-id-549'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' id='type-id-551'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-552'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-553'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-554'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-556'/>
    <pointer-type-def type-id='type-id-557' size-in-bits='64' id='type-id-558'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-560'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-562'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-559'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-561'/>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-560' id='type-id-555'/>
    <typedef-decl name='gnutls_hmac_hd_t' type-id='type-id-562' id='type-id-557'/>
    <function-decl name='gnutls_cipher_init' mangled-name='gnutls_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-552' name='handle'/>
      <parameter type-id='type-id-171' name='cipher'/>
      <parameter type-id='type-id-345' name='key'/>
      <parameter type-id='type-id-345' name='iv'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_tag' mangled-name='gnutls_cipher_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_tag@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='tag'/>
      <parameter type-id='type-id-6' name='tag_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_add_auth' mangled-name='gnutls_cipher_add_auth' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_add_auth@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_set_iv' mangled-name='gnutls_cipher_set_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_set_iv@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='iv'/>
      <parameter type-id='type-id-6' name='ivlen'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_cipher_get_iv' mangled-name='_gnutls_cipher_get_iv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_cipher_get_iv@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='iv'/>
      <parameter type-id='type-id-6' name='ivlen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt' mangled-name='gnutls_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt' mangled-name='gnutls_cipher_decrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='ctext'/>
      <parameter type-id='type-id-6' name='ctext_len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt2' mangled-name='gnutls_cipher_encrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt2@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <parameter type-id='type-id-8' name='ctext'/>
      <parameter type-id='type-id-6' name='ctext_len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt2' mangled-name='gnutls_cipher_decrypt2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt2@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='ctext'/>
      <parameter type-id='type-id-6' name='ctext_len'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_encrypt3' mangled-name='gnutls_cipher_encrypt3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_encrypt3@@GNUTLS_3_7_7'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <parameter type-id='type-id-8' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt3' mangled-name='gnutls_cipher_decrypt3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_decrypt3@@GNUTLS_3_7_7'>
      <parameter type-id='type-id-547' name='handle'/>
      <parameter type-id='type-id-8' name='ctext'/>
      <parameter type-id='type-id-6' name='ctext_len'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-2' name='ptext_len'/>
      <parameter type-id='type-id-143' name='flags'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_deinit' mangled-name='gnutls_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-547' name='handle'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_hmac_init' mangled-name='gnutls_hmac_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-558' name='dig'/>
      <parameter type-id='type-id-244' name='algorithm'/>
      <parameter type-id='type-id-8' name='key'/>
      <parameter type-id='type-id-6' name='keylen'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hmac_set_nonce' mangled-name='gnutls_hmac_set_nonce' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_set_nonce@@GNUTLS_3_4'>
      <parameter type-id='type-id-557' name='handle'/>
      <parameter type-id='type-id-8' name='nonce'/>
      <parameter type-id='type-id-6' name='nonce_len'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_hmac' mangled-name='gnutls_hmac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac@@GNUTLS_3_4'>
      <parameter type-id='type-id-557' name='handle'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hmac_output' mangled-name='gnutls_hmac_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_output@@GNUTLS_3_4'>
      <parameter type-id='type-id-557' name='handle'/>
      <parameter type-id='type-id-8' name='digest'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_hmac_deinit' mangled-name='gnutls_hmac_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-557' name='handle'/>
      <parameter type-id='type-id-8' name='digest'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_len' mangled-name='gnutls_hmac_get_len' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_len@@GNUTLS_3_4'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_hmac_get_key_size' mangled-name='gnutls_hmac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_get_key_size@@GNUTLS_3_6_12'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_hmac_fast' mangled-name='gnutls_hmac_fast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_fast@@GNUTLS_3_4'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <parameter type-id='type-id-8' name='key'/>
      <parameter type-id='type-id-6' name='keylen'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <parameter type-id='type-id-8' name='digest'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hmac_copy' mangled-name='gnutls_hmac_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hmac_copy@@GNUTLS_3_6_9'>
      <parameter type-id='type-id-557' name='handle'/>
      <return type-id='type-id-557'/>
    </function-decl>
    <function-decl name='gnutls_hash_output' mangled-name='gnutls_hash_output' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_output@@GNUTLS_3_4'>
      <parameter type-id='type-id-555' name='handle'/>
      <parameter type-id='type-id-8' name='digest'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_hash_fast' mangled-name='gnutls_hash_fast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_fast@@GNUTLS_3_4'>
      <parameter type-id='type-id-247' name='algorithm'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <parameter type-id='type-id-8' name='digest'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hash_copy' mangled-name='gnutls_hash_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hash_copy@@GNUTLS_3_6_9'>
      <parameter type-id='type-id-555' name='handle'/>
      <return type-id='type-id-555'/>
    </function-decl>
    <function-decl name='gnutls_key_generate' mangled-name='gnutls_key_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_key_generate@@GNUTLS_3_4'>
      <parameter type-id='type-id-330' name='key'/>
      <parameter type-id='type-id-143' name='key_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_init' mangled-name='gnutls_aead_cipher_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-551' name='handle'/>
      <parameter type-id='type-id-171' name='cipher'/>
      <parameter type-id='type-id-345' name='key'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_set_key' mangled-name='gnutls_aead_cipher_set_key' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_set_key@@GNUTLS_3_7_5'>
      <parameter type-id='type-id-508' name='handle'/>
      <parameter type-id='type-id-345' name='key'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encrypt' mangled-name='gnutls_aead_cipher_encrypt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encrypt@@GNUTLS_3_4'>
      <parameter type-id='type-id-508' name='handle'/>
      <parameter type-id='type-id-8' name='nonce'/>
      <parameter type-id='type-id-6' name='nonce_len'/>
      <parameter type-id='type-id-8' name='auth'/>
      <parameter type-id='type-id-6' name='auth_len'/>
      <parameter type-id='type-id-6' name='tag_size'/>
      <parameter type-id='type-id-8' name='ptext'/>
      <parameter type-id='type-id-6' name='ptext_len'/>
      <parameter type-id='type-id-8' name='ctext'/>
      <parameter type-id='type-id-2' name='ctext_len'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv2' mangled-name='gnutls_aead_cipher_encryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_encryptv2@@GNUTLS_3_6_10'>
      <parameter type-id='type-id-508' name='handle'/>
      <parameter type-id='type-id-8' name='nonce'/>
      <parameter type-id='type-id-6' name='nonce_len'/>
      <parameter type-id='type-id-407' name='auth_iov'/>
      <parameter type-id='type-id-7' name='auth_iovcnt'/>
      <parameter type-id='type-id-407' name='iov'/>
      <parameter type-id='type-id-7' name='iovcnt'/>
      <parameter type-id='type-id-8' name='tag'/>
      <parameter type-id='type-id-2' name='tag_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decryptv2' mangled-name='gnutls_aead_cipher_decryptv2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_decryptv2@@GNUTLS_3_6_10'>
      <parameter type-id='type-id-508' name='handle'/>
      <parameter type-id='type-id-8' name='nonce'/>
      <parameter type-id='type-id-6' name='nonce_len'/>
      <parameter type-id='type-id-407' name='auth_iov'/>
      <parameter type-id='type-id-7' name='auth_iovcnt'/>
      <parameter type-id='type-id-407' name='iov'/>
      <parameter type-id='type-id-7' name='iovcnt'/>
      <parameter type-id='type-id-8' name='tag'/>
      <parameter type-id='type-id-6' name='tag_size'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_deinit' mangled-name='gnutls_aead_cipher_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_aead_cipher_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-508' name='handle'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_extract' mangled-name='gnutls_hkdf_extract' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_extract@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-244' name='mac'/>
      <parameter type-id='type-id-345' name='key'/>
      <parameter type-id='type-id-345' name='salt'/>
      <parameter type-id='type-id-8' name='output'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_hkdf_expand' mangled-name='gnutls_hkdf_expand' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_hkdf_expand@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-244' name='mac'/>
      <parameter type-id='type-id-345' name='key'/>
      <parameter type-id='type-id-345' name='info'/>
      <parameter type-id='type-id-8' name='output'/>
      <parameter type-id='type-id-6' name='length'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pbkdf2' mangled-name='gnutls_pbkdf2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pbkdf2@@GNUTLS_3_6_13'>
      <parameter type-id='type-id-244' name='mac'/>
      <parameter type-id='type-id-345' name='key'/>
      <parameter type-id='type-id-345' name='salt'/>
      <parameter type-id='type-id-143' name='iter_count'/>
      <parameter type-id='type-id-8' name='output'/>
      <parameter type-id='type-id-6' name='length'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_mac_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_hash_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-563'/>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_hash_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-563'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='_gnutls_hash_copy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-550'/>
      <parameter type-id='type-id-563'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_hash_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_iov_iter_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-553'/>
      <parameter type-id='type-id-407'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_iov_iter_next' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-553'/>
      <parameter type-id='type-id-554'/>
      <return type-id='type-id-266'/>
    </function-decl>
    <function-decl name='_gnutls_iov_iter_sync' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-553'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-backend.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <var-decl name='crypto_cipher_prio' type-id='type-id-7' visibility='default'/>
    <function-decl name='gnutls_crypto_register_cipher' mangled-name='gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_cipher@@GNUTLS_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <parameter type-id='type-id-7' name='priority'/>
      <parameter type-id='type-id-514' name='init'/>
      <parameter type-id='type-id-515' name='setkey'/>
      <parameter type-id='type-id-516' name='setiv'/>
      <parameter type-id='type-id-518' name='encrypt'/>
      <parameter type-id='type-id-519' name='decrypt'/>
      <parameter type-id='type-id-522' name='deinit'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_crypto_register_cipher' mangled-name='_gnutls_crypto_register_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_crypto_register_cipher@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <parameter type-id='type-id-7' name='priority'/>
      <parameter type-id='type-id-514' name='init'/>
      <parameter type-id='type-id-515' name='setkey'/>
      <parameter type-id='type-id-516' name='setiv'/>
      <parameter type-id='type-id-518' name='encrypt'/>
      <parameter type-id='type-id-519' name='decrypt'/>
      <parameter type-id='type-id-522' name='deinit'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_aead_cipher' mangled-name='gnutls_crypto_register_aead_cipher' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_aead_cipher@@GNUTLS_3_4'>
      <parameter type-id='type-id-171' name='algorithm'/>
      <parameter type-id='type-id-7' name='priority'/>
      <parameter type-id='type-id-514' name='init'/>
      <parameter type-id='type-id-515' name='setkey'/>
      <parameter type-id='type-id-520' name='aead_encrypt'/>
      <parameter type-id='type-id-521' name='aead_decrypt'/>
      <parameter type-id='type-id-522' name='deinit'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_mac' mangled-name='gnutls_crypto_register_mac' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_mac@@GNUTLS_3_4'>
      <parameter type-id='type-id-244' name='algorithm'/>
      <parameter type-id='type-id-7' name='priority'/>
      <parameter type-id='type-id-564' name='init'/>
      <parameter type-id='type-id-565' name='setkey'/>
      <parameter type-id='type-id-566' name='setnonce'/>
      <parameter type-id='type-id-567' name='hash'/>
      <parameter type-id='type-id-568' name='output'/>
      <parameter type-id='type-id-569' name='deinit'/>
      <parameter type-id='type-id-570' name='hash_fast'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_crypto_register_digest' mangled-name='gnutls_crypto_register_digest' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_crypto_register_digest@@GNUTLS_3_4'>
      <parameter type-id='type-id-247' name='algorithm'/>
      <parameter type-id='type-id-7' name='priority'/>
      <parameter type-id='type-id-571' name='init'/>
      <parameter type-id='type-id-572' name='hash'/>
      <parameter type-id='type-id-573' name='output'/>
      <parameter type-id='type-id-574' name='deinit'/>
      <parameter type-id='type-id-575' name='hash_fast'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <var-decl name='crypto_mac_prio' type-id='type-id-7' visibility='default'/>
    <var-decl name='crypto_digest_prio' type-id='type-id-7' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests-pk.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-576' size-in-bits='64' id='type-id-577'/>
    <class-decl name='gnutls_pubkey_st' size-in-bits='4288' is-struct='yes' visibility='default' id='type-id-578'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='params' type-id='type-id-320' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='key_usage' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='pin' type-id='type-id-322' visibility='default'/>
      </data-member>
    </class-decl>
    <function-decl name='gnutls_pubkey_import_privkey' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_pubkey_encrypt_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_set_spki' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-579'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_sign_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_privkey_decrypt_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-345'/>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_fips140_mode_enabled' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-143'/>
    </function-decl>
    <function-decl name='gnutls_x509_spki_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-577'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_x509_spki_deinit' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-576'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='gnutls_x509_spki_set_rsa_oaep_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-576'/>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-345'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='bigint_t' type-id='type-id-8' id='type-id-580'/>
    <function-decl name='gnutls_pk_self_test' mangled-name='gnutls_pk_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-143' name='flags'/>
      <parameter type-id='type-id-291' name='pk'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_init_scan' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-352'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crypto-selftests.c' comp-dir-path='/home/zfridric/upstream/gnutls/lib' language='LANG_C11'>
    <qualified-type-def type-id='type-id-547' const='yes' id='type-id-581'/>
    <pointer-type-def type-id='type-id-582' size-in-bits='64' id='type-id-583'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-587'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' id='type-id-589'/>
    <class-decl name='hash_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-586'/>
    <class-decl name='hmac_hd_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-588'/>
    <function-decl name='gnutls_cipher_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-581'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-581'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='gnutls_hash_hd_t' type-id='type-id-587' id='type-id-582'/>
    <typedef-decl name='gnutls_hmac_hd_t' type-id='type-id-589' id='type-id-584'/>
    <function-decl name='_gnutls_cipher_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-547'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_cipher_self_test' mangled-name='gnutls_cipher_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-143' name='flags'/>
      <parameter type-id='type-id-171' name='cipher'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_mac_self_test' mangled-name='gnutls_mac_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-143' name='flags'/>
      <parameter type-id='type-id-244' name='mac'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='gnutls_digest_self_test' mangled-name='gnutls_digest_self_test' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_self_test@@GNUTLS_FIPS140_3_4'>
      <parameter type-id='type-id-143' name='flags'/>
      <parameter type-id='type-id-247' name='digest'/>
      <return type-id='type-id-7'/>
    </function-decl>
